{
    "course_id": "BAA00102",
    "course_name": "Kinh tế chính trị Mác - Lênin",
    "course_start_page": 10,
    "course_end_page": 13,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nBAA00102  – Kinh t ế chính tr ị Mác - Lênin   \n \n Thông tin chung  \n− Mã học phần  : BAA00102  \n− Khối kiến thức: Bắt buộc  – Đại cương  \n− Số tín chỉ: 2  \n• Lý thuyết  : 30 \n• Thực hành  : 0 \n• Bài tập  : 0 \n− Học phần học trước  : Triết học Mác – Lênin   \n Mô tả học phần  \nChương trình học phần Kinh tế chính trị Mác - Lênin được chia thành 6 chương . Chương 1 bàn \nvề đối tượng, phương pháp nghiên cứu và chức năng của kinh tế chính trị Mác -Lênin. Từ \nchương 2 đến chương 6 trình bày nội dung cốt lõi của kinh tế chính trị Mác -Lênin theo mục \ntiêu c ủa môn học. Cụ thể các vấn đề như: Hàng hóa, thị trường và vai trò của các chủ thể trong \nnền kinh tế thị trường: Sản xuất giá trị thặng dư trong nền kinh tế thị trường; Cạnh tranh và \nđộc quyền trong nền kinh tế thị trường; Kinh tế thị trường định hướng xã hội chủ nghĩa và các \nquan hệ lợi ích kinh tế ở Việt Nam; Công nghiệp hóa, hiện đại hóa và hội nhập kinh tế quốc tế \ncủa Việt Nam.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Biết hệ thống quan điểm, hệ thống lý luận của Kinh tế chính trị  Mác-Lênin. Xác lập \ncơ sở lý luận cơ bản nhất để từ đó tiếp cận được nội dung môn học Tư tưởng Hồ Chí \nMinh và Đường lối cách mạng của Đảng Cộng sản Việt Nam.  \n− Khái quát được hệ thống quan điểm, quy luật kinh tế. Đánh giá và nhận diện bản chất \ncác lợi ích kin h tế trong nền kinh tế thị trường.  \n− Giải quyết được các vấn đề thực tiễn đặt ra. Phân biệt đúng sai và phản biện.  \n− Lựa chọn phương pháp hoạt động thực tiễn trên cơ sở phương pháp luận của chủ nghĩa \nMác-Lênin.  \n  \n 11 \n Nội dung học phần   \nChương 1: Đối tượng, phương p háp nghiên cứu và chức năng của kinh tế chính trị Mác -\nLênin  \n1. KHÁI QUÁT SỰ HÌNH THÀNH VÀ PHÁT TRIỂN CỦA KINH TẾ CHÍNH TRỊ \nMÁC - LÊNIN  \n2. ĐỐI TƯỢNG VÀ PHƯƠNG PHÁP NGHIÊN CỨU CỦA KINH TẾ CHÍNH TRỊ \nMÁC - LÊNIN  \n2.1. Đối tượng nghiên cứu của kinh tế chính trị M ác-Lênin  \n2.2. Phương pháp nghiên cứu của kinh tế chính trị Mác -Lênin  \n3. CHỨC NĂNG CỦA KINH TẾ CHÍNH TRỊ MÁC -LÊNIN  \n3.1. Chức năng nhận thức  \n3.2. Chức năng thực tiễn  \n3.3. Chức năng tư tưởng  \n3.4. Chức năng phương pháp luận  \nChương 2: Hàng hóa, thị trường và va i trò của các chủ thể tham gia thị trường  \n1. LÝ LUẬN CỦA C.MÁC VỀ SẢN XUẤT HÀNG HÓA VÀ HÀNG HÓA  \n1.1. Sản xuất hàng hóa  \n1.2. Hàng hóa  \n1.3. Tiền  \n1.4. Dịch vụ và một số hàng hóa đặc biệt  \n2. THỊ TRƯỜNG VÀ VAI TRÒ CỦA CÁC CHỦ THỂ THAM GIA THỊ TRƯỜNG  \n2.1. Thị trường  \n2.2. Vai trò của một số chủ thể chính tham gia thị trường  \nChương 3: Giá trị thặng dư trong nền kinh tế thị trường  \n1. LÝ LUẬN CỦA C.MÁC VỀ GIÁ TRỊ THẶNG DƯ  \n1.1. Nguồn gốc của giá trị thặng dư  \n1.2. Bản chất của giá trị thặng dư  \n1.3. Các phương pháp sả n xuất giá trị thặng dư trong nền kinh tế thị trường tư \nbản chủ nghĩa  \n2. TÍCH LŨY TƯ BẢN  \n2.1. Bản chát của tích lũy cơ bản  \n2.2. Những nhân tố góp phần làm tăng quy mô tích lũy  \n2.3. Một số hệ quả của tích lũy tư bản  \n3. CÁC HÌNH THỨC BIỂU HIỆN CỦA GIÁ TRỊ TH ẶNG DƯ TRONG NỀN KINH \nTẾ THỊ TRƯỜNG  \n3.1. Lợi nhuận  \n3.2. Lợi tức  \n3.3. Địa tô tư bản chủ nghĩa   \n 12 Chương 4: Cạnh tranh và độc quyền trong nền kinh tế thị trường  \n1. QUAN HỆ GIỮA CẠNH TRANH VÀ ĐỘC QUYỀN TRONG NỀN KINH TẾ THỊ \nTRƯỜNG  \n2. ĐỘC QUYỀN VÀ ĐỘC QUYỀN NHÀ N ƯỚC TRONG NỀN KINH TẾ THỊ \nTRƯỜNG  \n2.1. Lý luận của V.I.Lênin về độc quyền trong nền kinh tế thị trường  \n2.2. Lý luận của V.I.Lênin độc quyền nhà nước trong chủ nghĩa tư bản  \nChương 5: Kinh tế thị trường định hướng xã hội chủ nghĩa và các quan hệ lợi ích kinh tế \nở Việt Nam  \n 1. KINH TẾ THỊ TRƯỜNG ĐỊNH HƯỚNG XÃ HỘI CHỦ NGHĨA Ở VIỆT NAM  \n1.1. Khái niệm kinh tế thị trường định hướng xã hội chủ nghĩa ở Việt Nam  \n1.2. Tính tất yếu khách quan của việc phát triển kinh tế thị trường định hướng \nxã hội chủ nghĩa ở Việt  Nam  \n1.3. Đặc trưng của kinh tế thị trường định hướng xã hội chủ nghĩa ở Việt Nam  \n2. HOÀN THIỆN THỂ CHẾ KINH TẾ THỊ TRƯỜNG ĐỊNH HƯỚNG XÃ HỘI CHỦ \nNGHĨA Ở VIỆT NAM  \n2.1. Sự cần thiết hoàn thiện thể chế kinh tế thị trường định hướng xã hội chủ \nnghĩa ở Việt Nam  \n2.2. Hoàn thiện thể chế kinh tế thị trường định hướng xã hội chủ nghĩa ở Việt \nNam trên một số khía cạnh chủ yếu  \n3. CÁC QUAN HỆ LỢI ÍCH KINH TẾ Ở VIỆT NAM  \n3.1. Lợi ích kinh tế và quan hệ lợi ích kinh tế  \n3.1.1. Lợi ích kinh tế  \n3.1.2. Quan hệ lợi ích kinh tế  \n3.2. Vai trò nhà nước trong bảo đảm hài hòa các quan hệ lợi ích  \n3.2.1. Bảo vệ lợi ích hợp pháp, tạo môi trường thuận lợi cho hoạt động tìm kiếm \nlợi ích của các chủ thể kinh tế  \n3.2.2. Điều hòa lợi ích giữa cá nhân – doanh nghiệp – xã hội  \n3.2.3. Kiểm soát, ngăn ngừa các quan hệ lợi ích có ảnh hưởng tiêu cực đối với \nsự phát triển xã hội  \n3.2.4. Giải quyết những mâu thuẫn trong quan hệ lợi ích kinh tế  \nChương 6: Công nghiệp hóa, hiện đại hóa và hội nhập kinh tế quốc tế của Việt Nam  \n1. CÔNG NGHIỆP HÓA, HIỆN ĐẠI H ÓA Ở VIỆT NAM  \n1.1 Khái quát cách mạng công nghiệp và công nghiệp hóa  \n1.1.1. Khái quát về cách mạng công nghiệp  \n1.1.2. Công nghiệp hóa và các mô hình công nghiệp hóa trên thế giới  \n1.2. Tính tất yếu khách quan và nội dung của công nghiệp hóa, hiện đại hóa ở  \nViệt Nam  \n1.2.1. Tính tất yếu của công nghiệp hóa, hiện đại hóa ở Việt Nam   \n 13 1.2.2. Nội dung công nghiệp hóa, hiện đại hóa ở Việt Nam  \n1.3. công nghiệp hóa, hiện đại hóa ở Việt Nam trong bối cảnh cách mạng công \nnghiệp lần thứ tư  \n1.3.1. Quan điểm về công nghiệ p hóa, hiện đại hóa ở Việt Nam trong bối cảnh \ncách mạng công nghiệp lần thứ tư  \n1.3.2. Công nghiệp hóa, hiện đại hóa ở Việt Nam thích ứng với cách mạng công \nnghiệp lần thứ tư  \n2. HỘI NHẬP KINH TẾ QUỐC TẾ CỦA VIỆT NAM  \n2.1. Khái niệm và các hình thức hội nhập kinh tế quốc tế  \n2.1.1. Khái niệm và sự cần thiết khách quan hội nhập kinh tế quốc tế  \n2.1.3. Nội dung hội nhập kinh tế quốc tế  \n2.2. Tác động của hội nhập kinh tế quốc tế đến phát triển của Việt Nam  \n2.2.1. Tác động tích cực của hội nhập kinh tế quốc tế  \n2.2.2 . Tác động tiêu cực của hội nhập kinh tế quốc tế  \n2.3. Phương hướng nâng cao hiệu quả hội nhập kinh tế quốc tế phát triển của \nViệt Nam  \n2.3.1. Nhận thức sâu sắc về thời cơ và thách thức do hội nhập kinh tế quốc tế \nmang lại  \n2.3.2. Xây dựng chiến lược và lộ tr ình hội nhập kinh tế phù hợp  \n2.3.3. Tích cực, chủ động tham gia vào các liên kết kinh tế quốc tế và thực hiện \nđầy đủ các cam kết của Việt Nam trong các liên kết kinh tế quốc tế và khu vực  \n2.3.4. Hoàn thiện thể chế kinh tế và luật pháp  \n2.3.5. Nâng cao năng lực cạnh tranh quốc tế của nền kinh tế  \n2.3.6. Xây dựng nền kinh tế độc lập, tự chủ của Việt Nam  \n Tài nguyên học phần  \nGiáo trình  \n− Bộ Giáo dục và Đào tạo, [2019]: Giáo trình Kinh tế chính trị Mác -Lênin dành cho bậc \nđại học không chuyên kinh tế chính trị, Nxb. Chính trị quốc gia, Hà Nội.  \nTài liệu tham khảo  \n− Hội đồng trung ương chỉ đạo biên soạn giáo trình quốc gia các môn khoa học Mác - \nLênin, tư tưởng Hồ Chí Minh, [1999]: Giáo trình Kinh tế chính trị Mác -Lênin, Nxb. \nChính trị quốc gia Hà Nội.  \n− Hội đồng trung ương chỉ đạo biên soạn giáo trình quốc gia các môn khoa học Mác - \nLênin, tư tưởng Hồ Chí Minh, [2010]: Giáo trình Kinh tế chính trị Mác -Lênin, Nxb. \nChính trị quốc gia Hà Nội.  \n− C.Mác và Ăngghen toàn tập, 50 tập, Nxb. Chính trị Quốc gia.  \n− V.I.Lênin toàn t ập, 55 tập, Nxb. Chính trị Quốc gia.  \nCông cụ hỗ trợ  "
}