{
    "course_id": "BAA00007",
    "course_name": "Phương pháp luận sáng tạo",
    "course_start_page": 35,
    "course_end_page": 36,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nBAA00007  – Phương pháp lu ận sáng t ạo  \n \n Thông tin chung  \n− Mã học phần  : BAA00007  \n− Khối kiến thức: Tự chọn  – Đại cương  \n− Số tín chỉ: 2  \n• Lý thuyết  : 30 \n• Thực hành  : 0 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn học này cung cấp cho sinh viên những kiến thức cơ sở về hoạt động tư duy giải quyết vấn \nđề và ra quyết định. Môn học giúp trang bị cho sinh viên một hệ thống các phương pháp, kĩ \nnăng cụ thể giúp nâng cao hiệu suất của việc tư duy, tránh khỏi phương pháp “thử và sai” đơn \nthuần. Môn học cung cấp cho sinh viên khả năng phát hiện vấn đề, phát ý tưởng và đánh quá \ngiải pháp. Đ ây là một cơ sở giúp phát huy phương pháp làm việc khoa học và giải quyết vấn \nđề trong các chuyên ngành cụ thể sau này.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Hiểu được các kiến thức cơ sở về quá trình tư duy giải quyết vấn đề và ra quy ết định \ncủa con người.  \n− Sử dụng được phương pháp giải quyết các sai lầm thường gặp trong quá trình tiếp thu \nthông tin.  \n− Sử dụng được các phương pháp tích cực hóa tư duy cho các vấn đề chuyên ngành và \ntrong cuộc sống.  \n− Sử dụng phương pháp tư duy hệ thống cho c ác vấn đề chuyên ngành và trong cuộc \nsống.  \n− Sử dụng được các công cụ TRIZ để giải quyết vấn đề trong chuyên ngành và trong cuộc \nsống.  \n \n  \n 36 \n Nội dung học phần   \n− Giới thiệu  \n− Phương pháp giải quyết những sai lầm thường gặp trong quá trình tiếp thu thông tin  \n− Hệ thống và phương pháp tư duy hệ thống  \n− Phương pháp Synestics  \n− Phương pháp phân tích hình thái  \n− Hệ thống các thủ thuật sáng tạo (01 -10) \n− Hệ thống các thủ thuật sáng tạo (11 -20) \n− Hệ thống các thủ thuật sáng tạo (21 -40) \n− Mâu thuẫn kĩ thuật và ma trận giải quyết mâu thuẫn kĩ thuật  \n− Mâu thuẫn vật lý và biến đổi mẫu  \n− Chương trình rút gọn và ôn tập  \n Tài nguyên học phần  \nGiáo trình  \n− Giáo trình Phương pháp luận Sáng tạo Khoa học kĩ thuật – Giải quyết vấn đề và ra \nquyết định, Phan Dũng.  \nTài liệu tham khảo  \n− Phương pháp luận Sáng tạo và Đổi mới, vol.1 -10, Phan Dũng.  \nCông cụ hỗ trợ  \n− Visual Studio .NET  "
}