{
    "course_id": "BAA00103",
    "course_name": "Chủ nghĩa xã hội khoa học",
    "course_start_page": 14,
    "course_end_page": 18,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nBAA00103  - Chủ nghĩa xã hội khoa h ọc  \n \n Thông tin chung  \n− Mã học phần:  BAA00103  \n− Khối kiến thức: Bắt buộc  - Đại cương  \n− Số tín chỉ: 2  \n• Lý thuyết  : 30 \n• Thực hành  : 0 \n• Bài tập  : 0 \n− Học phần học trước  : Triết học Mác - Lênin, Kinh t ế chính tr ị Mác - Lênin   \n Mô tả học phần  \nChương trình học phần Chủ nghĩa xã hội khoa học được chia thành 7 chương, chương 1 trình \nbày những vấn đề cơ bản có tính nhập môn của CNXHKH (quá trình hình thành, phát triển của \nCNXHKH), từ chương 2 đến chương 7 trình bày những nội dung cơ bản của CNXHKH. Cụ \nthể chươn g 2, trình bày về nội dung sứ mệnh lịch sử giai cấp công nhân nói chung và giai cấp \ncông nhân ở Việt Nam nói riêng, biểu hiện, ý nghĩa của sứ mệnh lịch sử đó trong bối cảnh hiện \nnay. Chương 3, trình bày những quan điểm cơ bản của chủ nghĩa Mác - Lênin về c hủ nghĩa xã \nhội, thời kỳ quá độ lên chủ nghĩa xã hội và sự vận dụng sáng tạo của Đảng Cộng sản Việt Nam \nvào điều kiện cụ thể Việt Nam. Chương 4, trình bày nội dung, bản chất của nền dân chủ xã hội \nchủ nghĩa và nhà nước xã hội chủ nghĩa nói chung cũng như ở  Việt Nam nói riêng. Chương 5, \ntrình bày những kiến thức nền tảng về cơ cấu xã hội - giai cấp và liên minh giai cấp, tầng lớp \ntrong thời kỳ quá độ lên chủ nghĩa xã hội; vị trí, vai trò của những giai cấp, tầng lớp cơ bản \ntrong quá trình xây dựng đất nước v à nội dung của liên minh giai cấp, tầng lớp trong thời kỳ \nquá độ lên chủ nghĩa xã hội ở Việt Nam. Chương 6, trình bày những quan điểm cơ bản chủ \nnghĩa Mác -Lênin về vấn đề dân tộc, tôn giáo và những nội dung cơ bản của chính sách dân tộc, \ntôn giáo của Đảng và Nhà nước ta. Chương 7, trình bày những quan điểm cơ bản của chủ nghĩa \nMác - Lênin, tư tưởng Hồ Chí Minh và Đảng Cộng sản Việt Nam về gia đình, xây dựng gia \nđình trong thời kỳ quá độ lên chủ nghĩa xã hội, xây dựng gia đình ở Việt Nam hiện nay.  \n  \n 15  \n Mục tiêu  của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Xác định được những tri thức cơ bản, cốt lõi nhất về Chủ nghĩa xã hội khoa học, một \ntrong 3 bộ phận cấu thành chủ nghĩa Mác - Lênin;  \n− Hiểu được những khái niệm, phạm trù, nguyên lý, quy luật của môn học về chủ nghĩa \nxã hội và con đường đi lên chủ nghĩa xã hội ở Việt Nam;  \n− Vận dụng được các tri thức của môn học vào việc xem xét, đánh giá những vấn đề chính \ntrị, xã hội của đất nước liên quan đến chủ nghĩa xã hội và con đường đi lên chủ nghĩa \nxã hội ở Việt Nam;  \n− Xây dựng được thái độ chính trị, tư tưởng đúng đắn về môn học CNXHKH nói riêng \nvà nền tảng tư tưởng của Đảng ta nói chung từ đó hình thành được niềm tin, lý tưởng \ncách mạng cho sinh viên.  \n Nội dung học phần   \nChương 1: Nhập môn Chủ nghĩa xã hội khoa học  \n1. SỰ RA ĐỜI CỦA CNXHKH  \n1.1. Hoàn cảnh ra đời của CNXHKH  \n1.2. Vai trò của C.Mác và Ph.Ăngghen  \n2. CÁC GIAI ĐOẠN PHÁT TRIỂN CƠ BẢN CỦA CNXHKH  \n2.1. C.Mác và Ph.Ăngghen phát triển CNXHKH  \n2.2. V.I.Lênin vận dụng và phát triển CNXHKH trong điều kiện mới  \n2.3. Sự vận dụng và phát triển sáng tạo của CNXHKH từ sau khi V.I.Lênin qua \nđời đến nay.  \n3. ĐỐI TƯỢNG, PHƯƠNG PHÁP VÀ Ý NGHĨA CỦA VIỆC NGHIÊN CỨU \nCNXHKH  \n3.1. Đối tượng nghiên cứu của CNXHKH  \n3.2. Phương pháp nghiên cứu của CNXHKH  \n3.3. Ý nghĩa của việc nghiên cứu CNXHKH.  \nChương 2: Sứ mệnh lịch sử của giai cấp công nhân  \n1. QUAN ĐIỂM CƠ BẢN CỦA CHỦ NGHĨA MÁC - LÊNIN VỀ GIAI CẤP CÔNG \nNHÂN VÀ SỨ MỆNH LỊCH SỬ THẾ GIỚI CỦA GIAI CẤP CÔNG NHÂN  \n1.1. Khái niệm và đặc điểm của giai cấp công nhân  \n1.2. Nội dung và đặc điểm sứ mệnh của lịch sử của giai cấp công nhân  \n1.2.1. Nội dung sứ mệnh lịch sử của giai cấp công nhân  \n1.2.2. Đặc điểm sứ mệnh lịch sử của giai cấp công nhân.  \n1.3. Những điều kiện quy định sứ mệnh lịch sử của giai cấp côn g nhân  \n1.3.1. Điều kiện khách quan quy định sứ mệnh lịch sử của giai cấp công nhân  \n1.3.2. Điều kiện chủ quan để giai cấp công nhân thực hiện sứ mệnh lịch sử  \n2. GIAI CẤP CÔNG NHÂN VÀ VIỆC THỰC HIỆN SỨ MỆNH LỊCH SỬ CỦA GIAI \nCẤP CÔNG NHÂN HIỆN NAY  \n2.1. Giai cấp công nhân hiện nay  \n2.2. Thực hiện sứ mệnh lịch sử của giai cấp công nhân trên thế giới hiện nay  \n2.2.1. Về nội dung kinh tế - xã hội  \n2.2.2. Về nội dung chính trị - xã hội  \n2.2.3. Về nội dung văn hoá, tư tưởng  \n3. SỨ MỆNH LỊCH SỬ CỦA GIAI CẤP CÔNG NHÂ N VIỆT NAM   \n 16 3.1. Đặc điểm của giai cấp công nhân Việt Nam  \n3.2. Nội dung sứ mệnh lịch sử của giai cấp công nhân Việt Nam hiện nay  \n3.3. Phương hướng và một số giải pháp chủ yếu để xây dựng giai cấp công nhân \nViệt Nam hiện nay  \n3.3.1. Phương hướng  \n3.3.2. Một số  giải pháp chủ yếu  \nChương 3: Chủ nghĩa xã hội và thời kỳ quá độ lên chủ nghĩa xã hội  \n1. CHỦ NGHĨA XÃ HỘI  \n1.1. Chủ nghĩa xã hội, giai đoạn đầu của Hình thái kinh tế - xã hội cộng sản chủ \nnghĩa  \n1.2. Điều kiện ra đời chủ nghĩa xã hội  \n1.3. Những đặc trưng cơ b ản của chủ nghĩa xã hội  \n2. THỜI KỲ QUÁ ĐỘ LÊN CHỦ NGHĨA XÃ HỘI  \n2.1. Tính tất yếu khách quan của thời kỳ quá độ lên chủ nghĩa xã hội  \n2.2. Đặc điểm thời kỳ quá độ lên chủ nghĩa xã hội  \n3. QUÁ ĐỘ LÊN CHỦ NGHĨA XÃ HỘI Ở VIỆT NAM  \n3.1. Quá độ lên chủ nghĩa xã hội  bỏ qua chế độ tư bản chủ nghĩa  \n3.2. Những đặc trưng của chủ nghĩa xã hội và phương hướng xây dựng chủ \nnghĩa xã hội ở Việt Nam hiện nay  \n3.2.1. Những đặc trưng bản chất của chủ nghĩa xã hội Việt Nam  \n3.2.2. Phương hướng xây dựng chủ nghĩa xã hội ở Việt Nam hiện nay  \nChương 4: Dân chủ xã hội chủ nghĩa và nhà nước xã hội chủ nghĩa  \n1. DÂN CHỦ VÀ DÂN CHỦ XÃ HỘI CHỦ NGHĨA  \n1.1. Dân chủ và sự ra đời, phát triển của dân chủ  \n1.1.1. Quan niệm về dân chủ  \n1.1.2. Sự ra đời, phát triển của dân chủ  \n1.2. Dân chủ xã hội c hủ nghĩa  \n1.2.1. Quá trình ra đời của nền dân chủ xã hội chủ nghĩa  \n1.2.2. Bản chất của nền dân chủ xã hội chủ nghĩa  \n2. NHÀ NƯỚC XÃ HỘI CHỦ NGHĨA  \n2.1. Sự ra đời, bản chất, chức năng của nhà nước xã hội chủ nghĩa  \n2.1.1. Sự ra đời của nhà nước xã hội chủ nghĩa  \n2.1.2. bản chất của nhà nước xã hội chủ nghĩa  \n2.1.3. Chức năng của nhà nước xã hội chủ nghĩa  \n2.2. Mối quan hệ giữa dân chủ xã hội chủ nghĩa và nhà nước xã hội chủ nghĩa  \n3. DÂN CHỦ XÃ HỘI CHỦ NGHĨA VÀ NHÀ NƯỚC PHÁP QUYỀN XÃ HỘI CHỦ \nNGHĨA Ở VIỆT NAM  \n3.1. Dâ n chủ xã hội chủ nghĩa ở Việt Nam  \n3.1.1. Sự ra đời, phát triển của nền dân chủ xã hội chủ nghĩa ở Việt Nam  \n3.1.2. Bản chất của nền dân chủ xã hội chủ nghĩa ở Việt Nam  \n3.2. Nhà nước pháp quyền xã hội chủ nghĩa ở Việt Nam  \n3.2.1. Quan niệm về nhà nước pháp qu yền xã hội chủ nghĩa ở Việt Nam  \n3.2.2. Đặc điểm của nhà nước pháp quyền xã hội chủ nghĩa ở Việt Nam  \n3.3. Phát huy dân chủ xã hội chủ nghĩa, xây dựng Nhà nước pháp quyền xã hội \nchủ nghĩa ở Việt Nam hiện nay  \n3.3.1. Phát huy dân chủ xã hội chủ nghĩa ở Việt Nam hiện nay  \n3.3.2. Tiếp tục xây dựng và hoàn thiện Nhà nước pháp quyền xã hội chủ nghĩa  \nChương 5: Cơ cấu xã hội - giai cấp và liên minh giai cấp, tầng lớp trong thời kỳ quá \nđộ lên chủ nghĩa xã hội   \n 17  1. CƠ CẤU XÃ HỘI - GIAI CẤP TRONG THỜI KỲ QUÁ ĐỘ LÊN  CHỦ NGHĨA \nXÃ HỘI  \n1.1. Khái niệm và vị trí của cơ cấu xã hội - giai cấp trong cơ cấu xã hội  \n1.2. Sự biến đổi có tính quy luật của cơ cấu xã hội - giai cấp trong thời kỳ quá \nđộ lên chủ nghĩa xã hội  \n2. LIÊN MINH GIAI CẤP, TẦNG LỚP TRONG THỜI KỲ QUÁ ĐỘ LÊN CH Ủ \nNGHĨA XÃ HỘI  \n2.1. Xét từ góc độ chính trị - xã hội  \n2.2. Xét từ góc độ kinh tế  \n3. CƠ CẤU XÃ HỘI - GIAI CẤP VÀ LIÊN MINH GIAI CẤP, TẦNG LỚP TRONG \nTHỜI KỲ QUÁ ĐỘ LÊN CHỦ NGHĨA XÃ HỘI Ở VIỆT NAM  \n3.1. Cơ cấu xã hội - giai cấp trong thời kỳ quá độ lên chủ nghĩ a xã hội ở Việt \nNam  \n3.2. Liên minh giai cấp, tầng lớp trong thời kỳ quá độ lên chủ nghĩa xã hội ở \nViệt Nam  \nChương 6: Vấn đề dân tộc và tôn giáo trong thời kỳ quá độ lên chủ nghĩa xã hội  \n1. DÂN TỘC TRONG THỜI KỲ QUÁ ĐỘ LÊN CHỦ NGHĨA XÃ HỘI  \n1.1. Chủ nghĩa M ác - Lênin về vấn đề dân tộc  \n1.1.1. Khái niệm, đặc trưng cơ bản của dân tộc  \n1.1.2. Hai xu hướng khách quan của sự phát triển quan hệ dân tộc  \n1.1.3. Cương lĩnh dân tộc của chủ nghĩa Mác - Lênin  \n1.2. Vấn đề dân tộc và quan hệ dân tộc ở Việt Nam  \n1.2.1. Đặc đi ểm dân tộc Việt Nam  \n1.2.2. Quan điểm và chính sách dân tộc của Đảng, Nhà nước Việt Nam  \n2. VẤN ĐỀ TÔN GIÁO TRONG THỜI KỲ QUÁ ĐỘ LÊN CHỦ NGHĨA XÃ HỘI  \n2.1. Chủ nghĩa Mác - Lênin về vấn đề tôn giáo  \n2.1.1. Bản chất, nguồn gốc và tính chất của tôn giáo  \n2.1.2. Nguyên tắc giải quyết vấn đề tôn giáo trong thời kỳ quá độ lên chủ nghĩa \nxã hội  \n2.2. Tôn giáo ở Việt Nam và chính sách tôn giáo của Đảng và Nhà nước ta hiện \nnay \n2.2.1. Đặc điểm tôn giáo ở Việt Nam  \n2.2.2. Chính sách của Đảng, Nhà nước Việt Nam đối vớ i tôn giáo, tín ngưỡng \nhiện nay  \n3. QUAN HỆ GIỮA DÂN TỘC VÀ TÔN GIÁO Ở VIỆT NAM  \n3.1. Đặc điểm quan hệ giữa dân tộc và tôn giáo ở Việt Nam  \n3.2. Định hướng giải quyết mối quan hệ dân tộc và tôn giáo ở Việt Nam hiện \nnay. \nChương 7: Vấn đề gia đình trong thời k ỳ quá độ lên chủ nghĩa xã hội  \n1. KHÁI NIỆM, VỊ TRÍ VÀ CHỨC NĂNG CỦA GIA ĐÌNH  \n1.1. Khái niệm gia đình  \n1.2. Vị trí gia đình trong xã hội  \n1.2.1. Gia đình là tế bào của xã hội  \n1.2.2. gia đình là cầu nối giữa cá nhân và xã hội  \n1.2.3. Xã hội là môi trường tồn tạ i và phát triển của gia đình  \n1.3. Chức năng cơ bản cảu gia đình  \n1.3.1. Chức năng tái sản xuất ra con người  \n1.3.2. Chức năng nuôi dưỡng, giáo dục  \n1.3.3. Chức năng kinh tế  \n1.3.4. Chức năng thoả mãn nhu cầu tâm sinh lý, duy trì tình cảm gia đình   \n 18 2. CƠ SỞ XÂY DỰNG GIA ĐÌNH TRONG THỜI KỲ QUÁ ĐỘ LÊN CHỦ NGHĨA \nXÃ HỘI  \n2.1. Cơ sở kinh tế - xã hội  \n2.2. Cơ sở chính trị - xã hội  \n2.3. Cơ sở văn hoá  \n2.4. Chế độ hôn nhân tiến bộ  \n3. XÂY DỰNG GIA ĐÌNH VIỆT NAM TRONG THỜI KỲ QUÁ ĐỘ LÊN CHỦ \nNGHĨA XÃ HỘI  \n3.1. Sự biến đổi c ủa gia đình Việt Nam trong thời kỳ quá độ lên chủ nghĩa xã \nhội \n3.1.1. Biến đổi quy mô, kết cấu của gia đình  \n3.1.2. Biến đổi các chức năng của gia đình  \n3.1.3. Sự biến đổi của quan hệ gia đình  \n3.2. Phương hướng cơ bản xây dựng và phát triển gia đình Việt Nam  trong thời \nkỳ quá độ lên chủ nghĩa xã hội  \n Tài nguyên học phần  \nGiáo trình  \n− Bộ Giáo dục và Đào tạo, [2019]: Giáo trình Chủ nghĩa xã hội khoa học dành cho bậc \nđại học không chuyên kinh tế chính trị, Nxb. Chính trị quốc gia, Hà Nội.  \nTài liệu tham khảo  \n− Hội đồn g trung ương chỉ đạo biên soạn giáo trình quốc gia các môn khoa học Mác - \nLênin, tư tưởng Hồ Chí Minh, [1999]: Giáo trình Chủ nghĩa xã hội khoa học, Nxb. \nChính trị quốc gia Hà Nội.  \n− Hội đồng trung ương chỉ đạo biên soạn giáo trình quốc gia các môn khoa học M ác- \nLênin, tư tưởng Hồ Chí Minh, [2010]: Giáo trình Chủ nghĩa xã hội khoa học, Nxb. \nChính trị quốc gia Hà Nội.  \n− C.Mác và Ăngghen toàn tập, 50 tập, Nxb. Chính trị Quốc gia.  \n− V.I.Lênin toàn tập, 55 tập, Nxb. Chính trị Quốc gia.  \nCông cụ hỗ trợ  "
}