{
    "course_id": "BAA00004",
    "course_name": "Pháp luật đại cương",
    "course_start_page": 31,
    "course_end_page": 34,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nBAA00004  – Pháp lu ật đại cương  \n \n Thông tin chung  \n− Mã học phần  : BAA00004  \n− Tên tiếng Anh  : General Law  \n− Khối kiến thức: Bắt buộc  – Đại cương  \n− Số tín chỉ: 3  \n• Lý thuyết  : 45 \n• Thực hành  : 0 \n• Bài tập  : 0 \n− Học phần học trước  : Những nguyên lý cơ bản của CN.Mác -Lênin    \n Mô tả học phần  \nMôn học này nhằm cung cấp cho sinh viên :  \n− Trang bị cho sinh viên những kiến thức lý luận cơ bản nhất về Nhà nước và Pháp luật.  \n− Người học sẽ được cung cấp các khái niệm, thuật ngữ pháp lý cũng như các kiến thức \nvề cấu trúc, chức năng của bộ máy Nhà Nước Việt Nam, các quy định của các ngành \nluật để người học có thể tham gia vào các quan hệ pháp luật một cách chủ động, hiệu \nquả. \n− Giúp cho sinh viên có nhận thức, quan điểm đúng đắn về đường lối, chính s ách của \nĐảng và Nhà nước được cụ thể hóa bằng các văn bản Quy phạm pháp luật; vận dụng \nkiến thức về nhà nước và pháp luật vào thực tiễn cuộc sống.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Trình bày được hệ thống tri thức cơ bản về nhà nướ c và pháp luật; nội dung chính của \nmột số ngành luật chủ yếu  \n− Vận dụng được những tri thức cơ bản về nhà nước và pháp luật vào trong các hoạt động \nnhận thức và hoạt động thực tiễn.  \n− Phân biệt được tính hợp pháp, và tính không hợp pháp của hành vi pháp lý.  \n− Phân biệt được các quan hệ xã hội với quan hệ pháp luật, từ đó nhận biết các quan hệ \npháp luật cụ thể: quan hệ pháp luật hình sự, dân sự, hành chính,...   \n 32 − Tham gia và tổ chức được các hoạt động góp phần thực hiện kỷ luật học đường, kỷ \ncương xã hội (thực hiện v à tuyên truyền thực hiện nội quy, quy chế, các quy định khác \nđối với công dân...và cách xử sự trong các mối quan hệ xã hội).  \n− Thể hiện được thái độ, ý thức chấp hành nghiêm chỉnh pháp luật của nhà nước, có ý \nthức đầy đủ về bổn phận và nghĩa vụ của một công dân đối với quốc gia.  \n− Thể hiện được thái độ chấp hành tốt nội quy, quy định của tập thể, tính gương mẫu, và \ntiên phong trong việc chấp hành các quy định pháp luật  \n Nội dung học phần   \nPhần 1. Những vấn đề chung về  Nhà nước và Pháp luật  \nBài 1. Nguồn gốc của Nhà nước và Pháp luật  \n1.1. Nguồn gốc nhà nước  \n1.1.1. Những quan điểm phi Mác -xít về nguồn gốc Nhà nước  \n1.1.1. Quan điểm của chủ nghĩa Mác - Lênin về nguồn gốc Nhà nước  \n1.2. Nguồn gốc, khái niệm pháp luật  \n1.1.1. Quan điểm duy tâm tôn giáo về nguồn gốc Pháp l uật \n1.1.2. Quan điểm CN. Mác -Lênin về Pháp luật  \n1.1.3. Quan điểm của các nhà luật Âu -Mỹ hiện đại.  \nBài 2. Những vấn đề cơ bản về  nhà nước và pháp luật  \n2.1. Vấn đề cơ bản về Nhà nước  \n2.1.1. Bản chất của nhà nước  \n2.1.2. Đặc trưng của Nhà nước  \n2.1.3. Chức năng của Nhà nước  \n2.1.4. Bộ máy nhà nước CHXHCN Việt Nam  \n2.1.5. Xây dựng nhà nước pháp quyền Việt Nam  \n2.2. Vấn đề cơ bản của pháp luật  \n2.2.1. Bản chất của nhà nước  \n2.2.2. Đặc trưng của Nhà nước  \n2.2.3. Chức năng của Nhà nước  \n2.2.4. Mối quan hệ giữa pháp luậ t với các hiện tượng xã hội  \n2.2.5. Pháp chế XHCN  \nBài 3. Quy phạm pháp luật - Hệ thống pháp luật  \n3.1. Quy phạm pháp luật   \n3.1.1. Khái niệm và đặc điểm của quy phạm pháp luật  \n3.1.2. Cấu trúc của quy phạm pháp luật  \n3.1.3. Phân loại quy phạm pháp luật  \n3.1.4. Hệ thống văn bản quy phạm pháp luật ở Việt nam  \n3.1.5. Hiệu lực của văn bản quy phạm pháp luật  \n3.2. Hệ thống pháp luật  \n3.2.1. Khái niệm hệ thống pháp luật  \n3.2.2. Cấu trúc của hệ thống pháp luật  \n3.2.3. Tiêu chuẩn xác định một hệ thống pháp luật hoàn thiện  \nBài 4. Quan hệ pháp luật  \n4.1. Khái niệm, đặc điểm của quan hệ pháp luật  \n4.1.1. Khái niệm quan hệ pháp luật  \n4.1.2. Đặc điểm của quan hệ pháp luật  \n4.2. Thành phần của quan hệ pháp luật  \n4.2.1. Chủ thể của quan hệ pháp luật  \n4.2.2. Khách thể của quan hệ pháp luật  \n 33 4.2.3. Nội dung của quan hệ pháp luật  \n4.3. Sự kiện pháp lý  \n4.3.1. Khái niệm sự kiện pháp lý  \n4.3.2. Phân loại sự kiện pháp lý  \nBài 5. Thực hiện pháp luật, vi phạm pháp luật, trách nhiệm pháp lý  \n5.1. Thực hiện pháp luật  \n5.1.1. Khái niệm  \n5.1.2. Các hình t hức thực hiện pháp luật  \n5.2. Vi phạm pháp luật  \n5.2.1. Khái niệm  \n5.2.2. Các dấu hiệu cơ bản của vi phạm pháp luật  \n5.2.3. Cấu thành vi phạm pháp luật  \n5.2.4. Phân loại VPPL  \n5.3. Trách nhiệm pháp lý  \n5.3.1. Khái niệm và đặc điểm của trách nhiệm pháp lý  \n5.3.2. C ăn cứ để truy cứu trách nhiệm pháp lý  \n5.3.3. Phân loại trách nhiệm pháp lý  \nPhần II. Các nghành luật trong hệ thống pháp luật Việt Nam  \nI. Luật Hiến pháp  \nI.1. Những vấn đề chung về luật Hiến pháp  \nI.2. Vai trò của ngành luật Hiến pháp  \nI.3. Một số nội dung cơ bản của Hiến pháp  \nII. Luật Hành chính  \nII.1. Những vấn đề chung về luật Hành chính.  \nII.2. Một số nội dung cơ bản của luật Hành chính  \nIII. Luật Hình sự  \nIII.1. Những vấn đề chung về luật Hình sự  \nIII.2. Một số nội dung cơ bản của luật Hình sự  \nIV. Luật Dân s ự \nIV.1. Những vấn đề chung về luật Dân sự  \nIV. 2. Một số nội dung cơ bản của luật Dân sự  \nV. Luật Hôn nhân và gia đình.(HN và GĐ)  \nV.1. Những vấn đề chung về luật HN và GĐ  \nV.2. Một số nội dung cơ bản của luật HN và GĐ  \nVI. Luật Lao động  \nVI.1. Những vấn đề chun g về luật Lao động.  \nVI.2. Một số nội dung cơ bản của Luật lao động  \nVII. Luật phòng, chống tham nhũng  \nVII.1. Những quy định chung  \nVII.2. Phòng ngừa tham nhũng  \nVII.3. Tố cáo và giải quyết tố cáo về hành vi tham nhũng  \nVII.4. Xử lý hành vi tham nhũng  \nVIII. Phá p Luật  về Tố tụng  \nVIII.1. Tố tụng về Hành chính    \nVIII.2. Tố tụng Hình sự   \nVIII.3. Tố tụng Dân sự   \nÔn tập  \n Tài nguyên học phần  \nGiáo trình   \n 34 − TS Đ ặng C ông Tr áng- Pháp luật Đại cương –NXB ĐHCNTPHCM n ăm 2017  \n− ThS. L ê Thị Kim Dung - ThS. L ê Ngọc Đức - Lg. L ê Thị Quỳnh: Gi áo trình ph áp luật \n(2010), Nxb. Lao đ ộng – Xã hội. \nTài liệu tham khảo  \n− Bộ Giáo dục và Đào tạo (2014): Ph áp luật Đại cương. Nxb. S ư phạm Hà Nội. \n− PGS. TS. Nguy ễn Minh Đoan (2010): Gi áo trình lý luận nhà nước và pháp luật. Nxb. \nChính trị Quốc gia, H à Nội. \n− Trường Đ ại học Luật Hà Nội (2012): Gi áo trình lý luận về nhà nước và pháp luật. Nxb. \nCông an nh ân dân. \n− PGS.TS. Ph ạm Duy Ngh ĩa (2011): Ph áp luật đại cương. Nx b. Công an nh ân dân (Khoa \nLuật Kinh t ế và Fulbright – ĐHKT Tp.HCM).  \nNgoài ra, sinh vi ên có thể tra cứu thông tin v à vấn đề liên quan đ ến môn học tại:  \n− www.luatvietnam.vn.  \n− www.thuvienphapluat.vn  \n− www.vanban.chinhphu.vn  \nCông cụ h ỗ trợ"
}