{
    "course_id": "BAA00101",
    "course_name": "Triết học Mác - Lênin",
    "course_start_page": 7,
    "course_end_page": 9,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nBAA00101  – Triết học Mác - Lênin   \n \n Thông tin chung  \n− Mã học phần  : BAA00101  \n− Khối kiến thức: Bắt buộc  – Đại cương  \n− Số tín chỉ: 3  \n• Lý thuyết  : 45 \n• Thực hành  : 0 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nChương trình học phần Triết học Mác - Lênin được chia thành 3 chương, trình bày những quan \nđiểm cơ bản của chủ nghĩa Mác -Lênin về lĩnh vực triết học. Thông qua những quan điểm về \nchủ nghĩa duy vật biện chứng, phép biện chứng duy v ật và chủ nghĩa duy vật lịch sử, học phần \ntrình bày một cách khái quát những nguyên lý, những quy luật cơ bản nhất của sự tồn tại, vận \nđộng và phát triển của tự nhiên, xã hội và tư duy.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Biết hệ thố ng quan điểm, hệ thống lý luận của Triết học Mác -Lênin gồm những vấn đề \nchung về triết học và vai trò của triết học, về chủ nghĩa duy vật biện chứng và chủ nghĩa \nduy vật lịch sử. Xác lập cơ sở lý luận cơ bản nhất để từ đó tiếp cận được nội dung các \nmôn học : Kinh tế - chính trị Mác -Lênin, Chủ nghĩa xã hội khoa học, Tư tưởng Hồ Chí \nMinh và Lịch sử Đảng Cộng sản Việt Nam.  \n− Khái quát được thế giới quan, nhân sinh quan và phương pháp luận chung nhất để tiếp \ncận các khoa học chuyên ngành.  \n− Giải quyết được các vấn đ ề thực tiễn đặt ra. Phân biệt đúng sai và phản biện.  \n− Lựa chọn phương pháp hoạt động thực tiễn trên cơ sở phương pháp luận của Triết học \nMác-Lênin.  \n Nội dung học phần   \nChương 1:  Triết học và vai trò của triết học trong đời sống xã hội   \n 8 I. TRIẾT HỌC VÀ VẤN ĐỀ CƠ BẢN CỦA TRIẾT HỌC  \n1. Khái lược về triết học  \n2. Vấn đề cơ bản của triết học  \n3. Biện chứng và siêu hình  \nII. TRIẾT HỌC MÁC – LÊNIN VÀ VAI TRÒ CỦA TRIẾT HỌC MÁC – LÊNIN \nTRONG ĐỜI SỐNG XÃ HỘI  \n1. Sự ra đời và phát triển của triển của triết học Mác – Lênin  \n2. Đối tượng và chức năng của triết học Mác – Lênin  \n3. Vai trò của triết học Mác – Lênin trong đời sống xã hội và trong sự nghiệp đổi mới \nở Việt Nam hiện nay  \nChương 2:  Chủ nghĩa duy vật biện chứng  \nI. VẬT CHẤT VÀ Ý THỨC  \n1. Vật chất và các hình thức tồn tại của vật chất  \n2. Nguồn góc, bản chất và kết cấu của ý thức  \n3. Mối quan hệ giữa vật chất và ý thức  \nII. PHÉP BIỆN CHỨNG DUY VẬT  \n1. Hai loại hình biện chứng và phép biện chứng duy vật  \n2. Nội dung của phép biện chứng duy vật  \nIII. LÝ LUẬN NHẬN THỨC  \n1. Các nguyên tắc của lý luận nhận thức duy vật biện chứng  \n2. Nguồn gốc, bản chất của nhận thức  \n3. Thực tiễn và vai trò của thực tiên đối với nhận thức  \n4. Các giai đoạn của quá trình nhận thức  \n5. Tính chất của chân lý  \nChương 3 : Chủ nghĩa duy vật lịch sử  \n I. HỌC THUYẾT HÌNH THÁI KINH TẾ - XÃ HỘI  \n1. Sản xuất vật chất là cơ sở của sự tồn tại và phát triển xã hội.  \n2. Biện chứng giữa lực lượng sản xuất và quan hệ sản xuất.  \n3. Biện chứng giữa cơ sở hạ tầng là kiến trúc thượng tầng của xã hội  \n4. Sự phát triển các hình thái  kinh tế - xã hội là một quá trình lịch sử tự nhiên.  \nII. GIAI CẤP VÀ DÂN TỘC  \n 1. Vấn đề giai cấp và đấu tranh giai cấp  \n 2. Dân tộc  \n 3. Mối quan hệ giai cấp - dân tộc -  nhân loại  \nIII. NHÀ NƯỚC VÀ CÁCH MẠNG XÃ HỘI  \n 1.  Nhà nước  \n 2.Cách mạng xã hội \nIV. Ý THỨC XÃ HỘI  \n 1.  Khái niệm tồn tại xã hội và các yếu tố cơ bản của tồn tại xã hội   \n 9  2. Ý thức xã hội và kết cấu của ý thức xã hội  \nV. TRIẾT HỌC VỀ CON NGƯỜI  \n1. Khái niệm con người và bản chất con người  \n2. Hiện tượng tha hóa con người và vấn đề giải  phóng con người  \n3. Quan điểm của triết học Mác – Lênin về quan hệ cá nhân và xã hội, về vai trò của \nquần chúng nhân dân và lãnh tụ trong lịch sử.  \n4. Vấn đề con người trong sự nghiệp cách mạng ở Việt Nam  \n Tài nguyên học phần  \nGiáo trình  \n− Hội đồng Trung ương c hỉ đạo biên soạn giáo trình quốc gia, Giáo trình Triết học Mác \nLênin (Tái bản có sửa chữa, bổ sung), Nxb. Chính trị Quốc gia, Hà Nội, 2010.  \nTài liệu tham khảo  \n− Hội đồng trung ương chỉ đạo biên soạn giáo trình quốc gia các môn khoa học Mác - \nLênin, tư tưởng Hồ Chí Minh, Giáo trình triết học Mác Lênin Nxb. Chính trị quốc gia \nHà Nội, 1999.  \n− Nguyễn Hữu Vui, Lịch sử triết học, NXB Chính trị Quốc gia, Hà Nội, 2004.  \n− C.Mác và Ăngghen toàn tập, 50 tập, NXB Chính trị Quốc gia.  \n− V.I.Lênin toàn tập, 55 tập, NXB Chính trị Quốc gia.  \nCông cụ hỗ trợ  "
}