{
    "course_id": "BAA00104",
    "course_name": "Lịch sử Đảng Cộng sản Việt Nam",
    "course_start_page": 19,
    "course_end_page": 20,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nBAA00104  – Lịch sử Đảng C ộng sản Việt Nam   \n \n Thông tin chung  \n− Mã học phần  : BAA00104  \n− Khối kiến thức: Bắt buộc  – Đại cương  \n− Số tín chỉ: 2  \n• Lý thuyết  : 30 \n• Thực hành  : 0 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn học trang bị cho sinh viên những kiến thức cơ bản về Lịch sử Đảng Cộng sản Việt Nam.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Về nội dung: Cung cấp những tri thức có tính hệ thống, cơ bản về sự ra đời của Đảng \nCộng sản Việt Nam (1920 -1930), sự lãnh đạo của Đảng đối với cách mạng Việt Nam \ntrong thời kỳ đấu tranh giành chính quyền (1930 -1945), trong hai cuộc kháng chiến \nchống thực dân Pháp và đế quốc Mỹ xâm lược (1945 -1975), trong sự nghiệp xây dựng, \nbảo vệ tổ quốc thời kỳ cả nước quá độ lên chủ nghĩa xã hội, tiến hành công cuộc đổi \nmới (1975 -2018)  \n− Về tư tưởng: Thông qua các sự kiện lịch sử và các kinh ng hiệm về sự lãnh đạo của \nĐảng để xây dựng ý thức tôn trọng sự thật khách quan, nâng cao lòng tự hào, niềm tin \nđối với sự nghiệp lãnh đạo của Đảng.  \n− Về kỹ năng: Trang bị phương pháp tư duy khoa học về lịch sử, kỹ năng lựa chọn tài \nliệu nghiên cứu, học tập môn  học và khả năng vận dụng nhận thức lịch sử vào công tác \nthực tiễn, phê phán quan niệm sai trái về lịch sử của Đảng.  \n Nội dung học phần   \n− Giới thiệu về môn học  \n− Chương nhập môn: Đối tượng, chức năng, nhiệm vụ, nội dung và phương pháp nghiên \ncứu, học tập Lịch sử Đảng cộng sản Việt Nam   \n 20 − Chương 1: Đảng Cộng sản Việt nam ra đời và lãnh đạo đấu tranh giành chính quyền \n(1930 -1945)  \n− Chương 2: Đảng lãnh đạo hai cuộc kháng chiến, hoàn thành giải phóng dân tộc, thống \nnhất đất nước (1945 -1975)  \n− Chương 3: Đảng lãnh đạo cả nư ớc quá độ lên Chủ nghĩa xã hội và tiến hành công cuộc \nđổi mới (1975 -2018)  \n Tài nguyên học phần  \nGiáo trình  \n− Bộ Giáo dục và Đào tạo (2019), Chương trình môn học Lịch sử Đảng Cộng sản Việt \nNam, ban hành 2019.  \n− Hội đồng Trung ương chỉ đạo biên soạn giáo trình quố c gia các môn khoa học Mác –\nLênin, Tư tưởng Hồ Chí Minh (2018), Giáo trình Lịch sử Đảng Cộng sản Việt Nam (tái \nbản có sửa chữa, bổ sung), NXB. Chính trị quốc gia, Hà Nội.  \nTài liệu tham khảo  \nCông cụ hỗ trợ  "
}