{
    "course_id": "BAA00001",
    "course_name": "Những nguyên lý cơ bản của Chủ nghĩa Mác -Lênin",
    "course_start_page": 21,
    "course_end_page": 22,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nBAA00001  - Những nguyên lý cơ b ản của Ch ủ nghĩa Mác -Lênin   \n \n Thông tin chung  \n− Mã học phần  : BAA00001  \n− Tên tiếng Anh  : The Basic Principles of  Marxism - Leninism  \n− Khối kiến thức:  Bắt buộc  - Đại cương  \n− Số tín chỉ:  5 \n• Lý thuyết  :  75 \n• Thực hành  :  0 \n• Bài tập  :  0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn học trang bị cho sinh viên những kiến thức cơ bản về triết học Mác-Lênin, kinh tế chính \ntrị Mác -Lênin, chủ nghĩa xã hội khoa học và sự vận dụng chúng vào cách mạng Việt Nam.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Mục tiêu chung: Môn học góp phần giúp sinh viên nắm vững những quan điểm khoa \nhọc, cách mạng, nhân văn của chủ nghĩa Mác -Lênin.  \n− Mục tiêu cụ thể về kiến thức, kỹ năng và thái độ sinh viên đạt được khi hoàn tất thành \ncông khóa học: Môn học trang bị cho sinh viên những nội dung cơ bản về thế giới quan, \nphương pháp luận triết học, học thuyết  kinh tế về phương thức sản xuất tư bản chủ \nnghĩa và lý luận về chủ nghĩa xã hội của chủ nghĩa Mác - Lênin; để từ đó giúp cho sinh \nviên vận dụng những lý luận đó một cách sáng tạo trong hoạt động nhận thức và thực \ntiễn, nhằm giải quyết những vấn đề mà đời sống xã hội của đất nước, của thời đại đang \nđặt ra trong rèn luyện và tu dưỡng đạo đức, đáp ứng yêu cầu của con người Việt Nam \ntrong sự nghiệp xây dựng Tổ quốc Việt Nam xã hội chủ nghĩa.  \n Nội dung học phần   \n− Nhập môn những nguyên lý cơ bản của Chủ nghĩa Mác -Lênin  \n− Chủ nghĩa duy vật biện chứng  \n− Phép biện chứng duy vật   \n 22 − Chủ nghĩa duy vật lịch sử  \n− Học thuyết giá trị  \n− Học thuyết giá trị thặng dư  \n− Học thuyết về chủ nghĩa tư bản độc quyền và chủ nghĩa tư bản độc quyền nhà nước  \n− Sứ mệnh lịch sử của giai cấp công nhân và cá ch mạng xã hội chủ nghĩa  \n− Những vấn đề chính trị - xã hội có tính quy luật trong tiến trình cách mạng xã hội chủ \nnghĩa  \n− Chủ nghĩa xã hội hiện thực và triển vọng  \n Tài nguyên học phần  \nGiáo trình  \n− Bộ Giáo dục và Đào tạo (2012), Giáo trình Những Nguyên lý cơ bản của chủ nghĩa \nMác - Lênin, Nxb. Chính trị quốc gia, Hà Nội.  \n− Trung tâm Lý luận chính trị, ĐHQG -HCM, Tài liệu hướng dẫn học tập Những Nguyên \nlý cơ bản của chủ nghĩa Mác - Lênin.  \n− Hội đồng Trung ương (2008), Giáo trình Triết học Mác -Lênin, Nxb. Chính trị quốc gia, \nHà Nội.  \n− Hội đồng Trung ương (2008), Giáo trình Kinh tế học chính trị Mác -Lênin, Nxb. Chính \ntrị quốc gia, Hà Nội.  \n− Hội đồng Trung ương (2008), Giáo trình Chủ nghĩa xã hội khoa học, Nxb. Chính trị \nquốc gia, Hà Nội.  \nTài liệu tham khảo  \nCông cụ hỗ trợ  "
}