{
    "course_id": "CSC00004",
    "course_name": "Nhập môn Công nghệ thông tin",
    "course_start_page": 73,
    "course_end_page": 74,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC00004  – Nhập môn Công ngh ệ thông tin  \n Thông tin chung  \n− Mã học phần  : CSC00004  \n− Tên tiếng Anh  :  Introduction to Information Technology  \n− Khối kiến thức: Bắt buộc  – Đại cương  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nThe course will give students an overview of the history of the development and formation of \nthe Information Technology (IT). In addition, general knowledge includes basic knowledge of \ncounting systems, computer architecture, operating systems, computer networks, and computer \nsafety are lectured. Students grasp the roles of software development, database systems. Some \ntrends that are becoming popular such as artificial intelligence, natural language processing, \nimage processing, etc. are introduced. The course also helps studen ts orient their study and \ncareer orientation through the introduction of majors and careers. Furthermore, the course \nequips students with the skills (such as teamwork, critical thinking, and creative thinking) and \nprofessional ethics necessary to work and communicate in the learning environment and in the \ncompany later.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Work at an individual and team level to implement and present some topics related to \nthe general knowledge, career orientation. Dem onstrate critical thinking and creative \nthinking in the process of implementing topics.  \n− Present the meaning, role, current status of hardware devices, software. Apply software, \ntechnology platforms to collaborate, present, share and backup data.  \n− Explain th e data storage platform in a computer and describe roles of database and \ndatabase administration system.  \n− Identify the role of the operating system, the development process, and distinguish \ndifferent types of operating systems.   \n 74 − Present basic knowledge about  computer networks, internet, network protocols, \ndevices, connection issues and security issues.  \n− Summarize the main characteristics of artificial intelligence and related fields and \ndescribe some emerging technologies.  \n− List some important rules and regulat ions in the university environment and in the \ncompany environment. Explain some characteristics of professional ethics.  \n Nội dung học phần   \n− Introduce an overview of the development process, the role of IT in life.  \n− Learn about computer classification, the ba sic architecture of a computer. Introduce the \ncharacteristics and role of software in the computer.  \n− Introduce basic hardware devices such as ports, circuits to peripheral devices such as \nRAM, hard drives, ... in computers. Identify the characteristics, rol es and meanings of \neach device and how they work together.  \n− Principle of storing information in computers such as number (integer and floating \npoint), text, images, sounds, ...  \n− Basic operations on the counting system.  \n− How the CPU executes a low -level progra m. How the CPU works with other devices \nto make a request.  \n− The relationship between low -level languages and high -level programming languages.  \n− Operating system (OS): characteristics, roles, and development process on all computer \nplatforms. The basic archit ecture and components of the operating system.  \n− Computer network: transmission principles, connection protocols, network  \n− Database system: roles, meanings, applications. Database management systems.  \n− Introduction to artificial intelligence, machine learning, and applications.  \n− Emerging technologies:  \n− - Virtual reality technology  \n− - Augmented reality technology - Cloud computing technology - Distributed \ntechnology  \n− - Network security technology - Blockchain technology  \n− Professional ethics such as copyright laws, privacy and legal documents related to IT. \nRules and regulations in university and company.  \n− Project Seminar  \n Tài nguyên học phần  \nGiáo trình  \n− Computer science: reflection on the field , reflections from the field, Committee on the \nFundamentals of Computer Science, National Academies Press, 2004.  \n− Computer science: an overview, Gleen Brookshear, Dennis Brylow, 12th edition, 2014  \n− Computers are your future, Introductory, Catherine Laberta, 12th Edition, 2011  \n− Ethics for the Information A ge, Mike Quinn, 7th Edition, 2016.  \nTài liệu tham khảo  \nCông cụ hỗ trợ  \n "
}