{
    "course_id": "CSC11003",
    "course_name": "Lập trình mạng",
    "course_start_page": 101,
    "course_end_page": 103,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC11003  - Lập trình m ạng \n \n Thông tin chung  \n− Mã học phần  : CSC11003  \n− Tên tiếng Anh  : Computer Network Programming  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Kỹ thuật Lập trình, M ạng Máy Tính, H ệ Điều  Hành, C ấu \ntrúc d ữ liệu và thu ật giải, Cơ sở dữ liệu    \n Mô tả học phần  \nMôn học trang bị cho sinh viên kiến thức để xây dựng các chương trình ứng dụng trao đổi \nthông tin trên môi trường mạng. Sinh viên sẽ được trang bị các kiến thức về xây dựng kịch bản, \nlựa chọn mô hình, thuật toán cho các ứng dụng mạng. Sinh viên sẽ được trang bị các kiến thức \nlập trình socket để xây dựng các ứng dụng mạng ở qui mô vừa và nhỏ. Ở mức độ nâng cao, \nmôn học  sẽ cung cấp cho sinh viên kiến thức nền tảng và kỹ năng để tích hợp các tính năng \nbảo mật vào chương trình ứng dụng mạng.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Nhận biết được khái niệm socket và các mô hình ứng dụng và hệ thống mạng tổng quát  \n− Nhận diện các mô hình kịch bản trao đổi thông tin của thành phần tham gia ứng dụng \nmạng  \n− Nhân diện các mô hình ứng dụng mạng phức tạp hơn  \n− Xây dựng được các ứng dụng mạng đơn giản theo yêu cầu  \n− Lập trình các ứng dụng mạng từ kịch bản, CTDL và t huật toán đã xây dựng, sử dụng \nngôn ngữ lập trình và thư viện C ++  \n− Bảo mật các ứng dụng mạng, sử dụng ngôn ngữ C++  \n Nội dung học phần    \n 102 − Giới thiệu và tổng quan mạng máy tính  \n• Mô hình OSI  \n• TCP \n• UDP  \n• FTP \n• TELNET  \n− Giới thiệu xây dựng chương trình ứng dụng mạng  \n• Client -Server  \n• Cái kiểu server  \n• Truy c ập đồng thời trong chương trình  \n− Lập trình socket  \n• Giới thiệu WinSock API  \n• Lập trình cơ bản  \n− Giới thiệu viết kịch bản client  \n• Kiến trúc của Client  \n• Ví dụ về lập trình socket ở client  \n− Giới thiệu viết kịch bản server  \n• Kiến trúc của Server  \n• Ví dụ về lập trình socket ở server  \n− Các kỹ thuật để viết kịch bản Server  \n• Multiprotocol servers  \n• Multiservice servers  \n• Concu rrency managerment and control  \n− Các kỹ thuật để viết kịch bản client  \n• Khái niệm  \n• Phương pháp tiếp cận  \n• Ví dụ  \n− WinSock Asynchronous Inp ut/Output  \n• Blocking and meassage  \n• Asynchronous calls  \n− WinSock Overlapped Input/Output  \n• Asynchronous I/O  \n• Overlapped I/O  \n• Ví dụ  \n− Phân tích ứng dụng ví dụ: TELNET  \n• Kịch bản  \n• Thuật toán  \n• Phương pháp  \n• Finite state machine  \n− Giới thiệu các phương pháp bảo mật trong chương trình ứng dụng mạng  \n− Phân tích yêu cầu bảo mật và giới thiệu phương pháp sử dụng ngôn C++ lập trình bảo \nmật \n− Ôn tập  \n Tài nguyên học phần  \n  \n 103  \nGiáo trình  \n− Network Application Design - by Scott F. Midkiff, Virginia Polytechnic Institute and \nState University.  \n− UNIX Network Programming - by W. Richard Stevens  \n− Internetworking with TCP/IP Vol. III Client -Server Programming and Applications -\nWindows Sockets Version - by Douglas E. Comer and David L. Stevens, ISBN -10: \n0138487146, Addison Wesley, 1997  \nTài l iệu tham khảo  \nCông cụ hỗ trợ  \n− Wireshark, Ubuntu, Vim, Linux command  "
}