{
    "course_id": "CSC11005",
    "course_name": "Thực tập mạng máy tính",
    "course_start_page": 107,
    "course_end_page": 108,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC11005  - Thực tập mạng máy tính  \n \n Thông tin chung  \n− Mã học phần  : CSC11005  \n− Tên tiếng Anh  : Computer Network Laboratory  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Mạng máy tính, M ạng máy tính nâng cao   \n Mô tả học phần  \nNội dung môn học cung cấp cho sinh viên những kiến thức về nguyên lí hoạt động các giao \nthức mạng, thi ết bị mạng thông dụng cũng như cách cấu hình các thiết bị đó. Học phần cũng \ncung cấp cho sinh viên kĩ năng sử dụng các tiện ích giả lập để xây dựng mô phỏng hệ thống \nmạng phục vụ cho việc nghiên cứu sau này. Hoàn thành môn học, sinh viên có các kĩ năng cần  \nthiết để vận hành, quản trị một hệ thống mạng vừa và nhỏ dựa trên các chính sách, yêu cầu cụ \nthể. Đây là một nhu cầu rất cần thiết cho sinh viên ngành mạng trước khi ra trường.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân trình bày một số báo cáo kỹ thuật trong lĩnh vực Mạng máy \ntính \n− Biết và giải thích được các thuật ngữ tiếng Anh thuộc chuyên ngành Mạng máy tính  \n− Trình bày và cấu hình được giao thức định tuyến tĩnh và động  \n− Trình bày và cấu hình được các giao thức ch uyển mạch (swiching protocols) hoạt động \nở tầng 2 và tầng 3.  \n− Trình bày và cấu hình đư ợc các kĩ thuật WAN giúp kết nối các mạng doanh nghiệp vừa \nvà nhỏ.  \n− Trình bày và cấu hình được IP Multicast, kĩ thuật chuyển địa chỉ IPv4 và Ipv6  \n− Sử dụng các công cụ phầ n mềm hỗ trợ   \n 108 \n Nội dung học phần   \n− Giới thiệu & nguyên lí hoạt động của Router và Switch và các lệnh cấu hình cơ bản.  \n− Định tuyến và các giao thức định tuyến.  \n− Giao thức định tuyến RIPv1, RIPv2  \n− Giao thức định tuyến EIGRP  \n− Giao thức định tuyến OSPF  \n− VLAN và VTP  \n− Giao thức STP  \n− Giao thức HSRP, VRRP, GLBP  \n− Kết nối WAN  \n− Frame Relay  \n− IPSec VPN  \n− IP Multicast  \n− IPv6  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− CCNA: Cisco Certified Network Associate Study Guide (640 -802), Todd Lammle  \n− Cisco CCNA Routing and Switching ICND2 200 -101 Official Cert Guide, Wendell \nOdom  \n− CCNP ROUTE 642 -902: Official Certification Guide, Wendell Odom  \n− CCNP SWITCH 642 -813 Official Certification Guide, David Hucaby  \nCông cụ hỗ trợ  \n− Dynmips  \n− GNS3  \n− Packet Tracert  \n− Wireshark  "
}