{
    "course_id": "CSC14007",
    "course_name": "Nhập môn phân tích độ phức tạp thuật toán",
    "course_start_page": 233,
    "course_end_page": 234,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC14007  – Nhập môn phân tích đ ộ phức tạp thu ật toán  \n \n Thông tin chung  \n− Mã học phần  : CSC14007  \n− Tên tiếng Anh  : Introduction to Algorithm Complexity Analysis  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Cấu trúc dữ liệu và giải thuật    \n Mô tả học phần  \nMôn học cung cấp cho các sinh viên những kiến thức nền tảng cùng với những kỹ thuật cơ bản \nđể phân tích và đánh giá độ phức tạp của các thuật toán. Nội dung môn học gồm các chủ đề: \nnhững khái niệm cơ sở về độ phức tạp tính toán, một số công cụ toán học (tính toán tổng số, \nphép đếm, l ý thuyết xác suất, phép hoán vị, hàm sinh) được vận dụng để phân tích và đánh giá \nđộ phức tạp thuật toán, khảo sát về mặt l ý thuyết và thực nghiệm về đ ộ phức tạp của những \nthuật toán đơn giản, một số thuật toán kinh điển, vài thuật toán thông dụng.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Biết cách tự tìm hiểu và trình bày lại một số vấn đề cơ bản liên quan đến các chủ đề độ \nphức tạp th uật toán đã được giao.  \n− Hiểu các thuật ngữ tiếng Anh cơ bản liên quan đến độ phức tạp thuật toán.  \n− Vận dụng một số công cụ toán học để phân tích độ phức tạp thuật toán và phân loại \nthuật toán theo độ phức tạp.  \n− Phân đoạn thuật toán để xác định được các thành phần chi phối độ phức tạp của một \nthuật toán.  \n− Phân tích độ phức tạp các thuật toán đơn giản dựa trên kỹ thuật phân đoạn, áp dụng \nphép đếm, kỹ thuật tính tổng.  \n− Vận dụng l ý thuyết xác suất để phân tích thuật toán.  \n− Áp dụng hàm sinh để phân tích những thuật t oán thông dụng.   \n 234 − Áp dụng phép hoán vị để phân tích độ phức tạp một số thuật toán thông dụng.  \n Nội dung học phần   \n− Giới thiệu môn học  \n− Những khái niệm và vấn đề trong phân tích độ phức tạp thuật toán  \n− Tiếp cận thực nghiệm để phân tích độ phức tạp thuật toán  \n− Tổng quan về tiếp cận lý thuyết để phân tích độ phức tạp thuật toán  \n− Các công cụ toán học để phân tích độ phức tạp thuật toán  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− The Art of Computer Programming (Volume I & III), Donald Knuth, Addison -Wesley, \n1981.  \n− Algorithmic Complexity and Communication Problems, J. P. Barthélemy, G. Cohen, \nA. Lobstein, UCL Press, 1996.  \n− Algorithms, Robert Sedgewick,  Addison -Wesley Longman, 1988.  \n− Data structures & Algorithm Analysis in C++, Mark Allen Weiss, Addison -Wesley \nLongman, 1999.  \nCông cụ hỗ trợ  \n− Một trình biên dịch hay IDE (Công cụ soạn thảo, biên dịch, chạy thử, bắt lỗi chương \ntrình như Visual Studio C++) cho C/C++.  \n− Trình soạn thảo văn bản như Microsoft Word.  \n− Phần mềm bảng tính như Microsoft Excel.  "
}