{
    "course_id": "CSC14101",
    "course_name": "Ẩn dữ liệu và chia sẻ thông tin",
    "course_start_page": 215,
    "course_end_page": 216,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC14101  – Ẩn dữ liệu và chia s ẻ thông tin  \n \n Thông tin chung  \n− Mã học phần  : CSC14101  \n− Tên tiếng Anh  : Data Hiding and Secret Sharing  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn học cung cấp khái niệm và các kỹ thuật cơ bản liên quan đến quá trình bảo mật thông tin \nđa truyền thông. Rèn luyện cho sinh viên khả năng phân tích, đánh g iá đặc điểm của một hệ \nthống ẩn dữ liệu và chia sẻ thông tin mật. Dựa trên đặc điểm, cấu trúc của từng loại thông tin \nvà các yêu cầu riêng của từng hệ thống, sinh viên có thể tự xây dựng các mô hình bảo vệ và \nchia sẻ dữ liệu phù hợp. Ngoài ra học phần cũng  giúp sinh viên có thái độ, quan điểm và nhận \nthức đúng đắn về tầm quan trọng của dữ liệu và ý thức bảo vệ các dữ liệu quan trọng. Hơn thế \nnữa, sau môn học này sinh viên có khả năng tự tạo cho bản thân mình một hệ thống bảo mật \nvà chia sẻ dữ liệu riêng.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Biết, hiểu thuật ngữ tiếng Anh chuyên ngành của môn học. Kỹ năng viết và nói, kỹ \nnăng trình bày liên quan đến các chủ đề của môn học.  \n− Kiến thức khoa học toán, lý, lập trình  \n− Trình bày được các khái niệm, thuật ngữ cơ bản và vấn đề liên quan đến lĩnh vực ẩn dữ \nliệu bao gồm: watermarking (thủy vân số), steganography (truyền thông mật); các ứng \ndụng của lĩnh vực này; và các mô hình chia sẻ thông tin mật.  \n− Áp dụng được kĩ thuật ẩn dữ liệu thích hợp ứ ng với những yêu cầu cho trước của các \nbài toán thực tế.   \n 216 − Dựa trên cấu trúc của từng loại thông tin và các yêu cầu riêng của từng hệ thống, sinh \nviên có thể tự xây dựng mô hình bảo vệ và chia sẻ dữ liệu phù hợp.  \n− Ý thức tôn trọng bản quyền của sản phẩm trí t uệ. \n− Phân tích and/or tổng hợp tài liệu, viết báo cáo khoa học  \n Nội dung học phần   \n− Tổng quan về Ẩn Dữ Liệu  \n− Bài toán Ẩn Dữ Liệu trên văn bản  \n− Bài toán Ẩn Dữ Liệu trên ảnh  \n− Bài toán Ẩn Dữ Liệu trên âm thanh  \n− Chia sẻ thông tin mật  \n− Các kĩ thuật Ẩn dữ liệu khác  \n Tài nguyên học phần  \nGiáo trình  \n− Giáo trình Ẩn dữ liệu và chia sẻ thông tin, 2011.  \nTài liệu tham khảo  \n− Information Hiding Techniques for Steganography and Digital Watermarking, Stefan \nKatzenbeisser and Fabien A.P. Petitcolas, Artech House, 2000.  \n− Multimedia Data Hiding, Min Wu and Bede Liu, Springer -Verlag New York, Inc, 2002.  \n− Techniques and Applications o f Digital Watermarking and Content Protection, Michael \nArnold, Martin Schmucker, Stephen D. Wolthusen, Artech House, Boston, London, \n2003  \n− Multimedia Security: Steganography and Digita Watermarking Techniques for \nProtection of Intellectual Property, Chun -Shien Lu, Idea Group Publishing, 2004.  \n− Multimedia Security Technology Digital Rights Management, Wenjun Zeng, Heather \nYu, and Ching -Yung Lin, Elsevier, 2006.  \nCông cụ hỗ trợ  \n− Matlab  "
}