{
    "course_id": "CSC13112",
    "course_name": "Thiết kế giao diện",
    "course_start_page": 192,
    "course_end_page": 193,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC13112  - Thiết kế giao di ện \n \n Thông tin chung  \n− Mã học phần  : CSC13112  \n− Tên tiếng Anh  : User Interface Design  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :  Nhập môn Công nghệ Phần mềm   \n Mô tả học phần  \nHọc phần này sẽ giới thiệu và cung cấp cho sinh viên những nguyên lý cơ bản, những phương \npháp, quy trình, kỹ thuật và công cụ hỗ trợ thiết kế giao diện người dùng. Học phần cũng sẽ \ngiới thiệu các nguyên lý và chỉ dẫn để thiết kế tốt giao diện người dùng t rên desktop, Web, và \nthiết bị di động (mobile devices).  \nSinh viên sẽ có cơ hội áp dụng các nguyên lý, phương pháp và công cụ hỗ trợ vào việc thiết kế \ngiao diện của một ứng dụng phần mềm. Sinh viên cũng sẽ có cơ hội thảo luận và đánh giá các \ngiao diện ngườ i dùng đã có sẵn. Qua học phần này, sinh viên sẽ có hiểu biết cơ bản về giao \ndiện người dùng, về kỹ năng thiết kế, về đánh giá giao diện, và rèn luyện thêm về kỹ năng làm \nviệc nhóm.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Vận dụng kỹ năng làm việc nhóm để hoàn thành và báo cáo thiết kế giao diện cho một \nứng dụng  \n− Đọc hiểu một số bài báo khoa học bằng tiếng Anh liên quan về thiết kế giao diện người \ndùng  \n− Phân tích và đánh giá các thiết kế giao diện người dùng  \n− Hiểu được tầm quan trọng, các  khái niệm cơ bản, và các thành phần của giao diện người \ndùng   \n 193 − Hiểu và vận dụng các nguyên lý cơ bản trong thiết kế giao diện trên Desktop, Web, và \nMobile.  \n− Hiểu và áp dụng các quy trình, phương pháp, và công cụ vào việc thiết kế giao diện \nngười dùng một cá ch hiệu quả  \n Nội dung học phần   \n− Introduction  \n− Usability  \n− Learnability, Visibility, and Efficiency  \n− Design Process  \n− Principles and rules  \n− Task Analysis  \n− Web UI  \n− Mobile UI  \n− Graphic DesignPrototyping  \n− Design and Development Tools  \n− Interaction Styles  \n− Interaction Devic es \n− Evaluating Interface Designs  \n− User Documentation and Online Help  \n− Internationalization  \n− Review and summary  \n Tài nguyên học phần  \nGiáo trình  \n− Designing the User Interface: Strategies for Effective Human -Computer Interaction, \n4th Ed., Ben Shneiderman and Catherine Plaisant, Addison -Wesley, 2004.  \nTài liệu tham khảo  \n− Usability Engineering, Jakob Nielsen, Morgan Kaufmann, 1994  \n− The Design of Everyday Things, Don Norman, Doubleday Business, 1990, ISBN: \n0385267746  \nCông cụ hỗ trợ  "
}