{
    "course_id": "CSC14002",
    "course_name": "Các hệ cơ sở tri thức",
    "course_start_page": 209,
    "course_end_page": 210,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC14002  - Các h ệ cơ sở tri th ức \n \n Thông tin chung  \n− Mã học phần:  CSC14002  \n− Tên tiếng Anh: Knowledge -Based Systems  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Cơ sở trí tuệ nhân tạo    \n Mô tả học phần  \nMôn học này nhằm cung cấp cho sinh viên một phương pháp t ổ chức tri thức từ cơ bản đến \nphức tạp: khái niệm, ứng dụng, các thuật toán tương ứng với mỗi cấu trúc tri thức khác nhau. \nMôn học giúp sinh viên có khả năng thiết kế, xây dựng các hệ cơ sở tri thức (tập trung vào hệ \nthông minh lai với nền tảng là tính toá n thông minh: Thuật giải di truyền, mạng Nơron và Logic \nmờ). Môn học cũng giúp sinh viên biết: Tích hợp cơ sở tri thức với các mô hình điều khiển; \nCài đặt và thử nghiệm các thuật toán trên các cấu trúc tri thức đã xây dựng; Phân tích và minh \nhọa các hệ thố ng tích hợp thông qua nhiều ứng dụng thực tế.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để trình bày một số báo cáo kỹ thuật về \ncác hệ cơ sở tri thức.  \n− Biết và giải thích được các thuật ngữ tiếng Anh về các hệ cơ sở tri thức, đọc được các \nbài báo khoa học tiếng Anh.  \n− Giải thích được các khái niệm cơ bản, thuật ngữ, trách nhiệm, công việc và phân tích \nđược bài toán... trong quản lý tri thức  \n− Hiểu  tri thức từ cơ bản đến phức tạp  \n− Thiết kế một hệ cơ sở tri thức đơn giản  \n− Phân tích và minh họa các hệ thống tích hợp cơ sở tri thức   \n 210 \n Nội dung học phần   \n− Giới thiệu về các hệ cơ sở tri thức  \n− Các kỹ thuật xử lý tri thức  \n− Phân tích một ví dụ về hệ thống cơ sở tri thức trong thực tế  \n− Máy học: Mạng Nơron nhân tạo \n− Thiết kế cài đặt thử nghiệm mạng nơron nhân tạo cho một bài toán nhận dạng mẫu  \n− Máy học: Thuật giải di truyền  \n− Thiết kế cài đặt thử nghiệm Thuật giải di truyền cho một bài toán tối ưu trong hóa học  \n− Máy học: Số mờ  \n− Một số hệ cơ sở tri thức ứng dụng  \n− Sử dụng  mã nguồn mở xây dựng cài đặt một khâu trong bài toán nhận dạng mặt người \nhoặc nhận dạng vân tay.  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− An Overview of the KL -ONE Knowledge Representation System, Brachman, R. J., & \nSchmolze, J.G., Cognit ive Science, 9, 171 -216, 1985.  \n− Pattern Classification 2nd Edition, Richard O. Duda, Peter E. Hart, and David G. Stork \nWiley, 2004.  \n− Machine Learning, MITCHELL, M. T., McGraw Hill, New York, 1996.  \n− Thuật giải di truyền: Cách giải tự nhiên các bài toán trên máy tính, Hoàng Kiếm và Lê \nHoàng Thái, NXB Giáo Dục,Việt nam, 2000.  \nCông cụ hỗ trợ  \n− Visual Studio .NET  \n− Mircosoft SQL, 2008  \n− Visio Axure  "
}