{
    "course_id": "CSC13009",
    "course_name": "Phát triển phần mềm cho thiết bị di động",
    "course_start_page": 183,
    "course_end_page": 185,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC13009  – Phát tri ển ph ần mềm cho thi ết bị di động \n \n Thông tin chung  \n− Mã học phần  : CSC13009  \n− Tên tiếng Anh  : Mobile Application Development  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn học này nhằm cung cấp cho sinh viên một mức nhìn tổng quát về lĩnh vực Phát triển Phần \nmềm cho Thiết bị Di động, các kiến thức nền tảng liên quan đến các thành phần chính yếu \ntrong lĩnh vực Phát triển Phần mềm cho  Thiết bị Di động (các nền tảng, các môi trường & công \ncụ, cách thiết kế đặc thù, các thư viện hỗ trợ phát triển, thử nghiệm và triển khai các ứng dụng \ncho điện thoại di động). Các chủ đề chính trong môn học bao gồm: thiết kế giao diện người \ndùng; quản lý vòng đời ứng dụng; lưu trữ & truy cập dữ liệu; xử lý đa tiểu trình; chia sẻ dữ liệu \ngiữa các ứng dụng; quản lý các dịch vụ chạy nền; giao tiếp liên lạc giữa các tiến trình; khai \nthác các dịch vụ web service; khai thác dịch vụ bản đồ & GPS; chức năng viễn t hông liên quan \ncuộc gọi & tin nhắn, đồ họa và multimedia. Nền tảng thiết bị di động được minh họa trong môn \nhọc sẽ thay đổi tùy theo xu hướng công nghệ tại Việt Nam và thế giới. Hiện tại môn học được \nminh họa dựa trên một trong những nền tảng thiết bị động  phổ biến nhất hiện nay là Android.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để Phát triển Phần mềm cho Thiết bị Di \nđộng  \n− Biết và giải thích được các thuật ngữ tiếng Anh thuộc lĩnh vực Phát triển Phần mềm \ncho Thiết bị Di động   \n 184 − Giải thích được các khái niệm cơ bản, thuật ngữ, trách nhiệm, công việc và nguyên tắc \nđạo đức cơ bản... thuộc lĩnh vực Phát triển Phần mềm cho Thiết bị Di động  \n− Xác định và phân loại được các nền tảng, môi trường Phát triển Phầ n mềm cho Thiết \nbị Di động  \n− Hiểu và áp dụng được các kỹ thuật trong lĩnh vực Phát triển Phần mềm cho Thiết bị di \nđộng  \n− Xây dựng được một sản phẩm phần mềm ở quy mô nhỏ  \n− Sử dụng các công cụ phần mềm hỗ trợ  \n Nội dung học phần   \n− Giới thiệu & tổng quan thị phần các nền tảng thiết bị di động  \n− các đặc điểm đặc trưng của nền tảng thiết bị di động và môi trường Phát triển phần \nmềm cho thiết bị di động  \n− Quản lý sự vòng đời ứng dụng  \n− Phân tích ứng dụng Hello World  \n− Lập trình giao diện và Quản lý sự kiện  \n− Các đối tượng layou t giao diện  \n− Các đối tượng giao diện đơn  \n− Giao diện dạng danh sách  \n− Giao diện con (Fragment)  \n− Các đối tượng giao diện phức hợp  \n− Xử lý đa tiểu trình  \n− Lưu trữ và truy cập dữ liệu văn bản  \n− Lưu trữ và truy cập dữ liệu XML/JSON  \n− Xử lý tập tin RSS  \n− Multimedia  \n− Location  \n− Xử lý SQLite  \n− Xử lý Service/Broadcast receiver  \n− Khai thác các webservices dạng SOAP & REST -API (ví dụ: ASMX, WCF, PHP…)  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \n− The Busy Coder's Guide to Android Development, Mark L. Murphy, CommonsWare \nPub., 2010  \nTài liệu tham khảo  \n− Unlocking Android - A Developer's Guide, W. Frank Abelson, Charlie Collins, and \nRobi Sen. Manning Pub., 2009  \n− Android Developer’s Guides – available at: http://developer.android.com/   \n− Android Application Development: Programming with t he Google SDK, Rick Rogers, \nJohn Lombardo, Zigurd Mednieks, Blake Meike. O'Relly Pub., 2009.  \nCông cụ hỗ trợ  \n− Eclipse  \n− Android Studio   \n 185 − Visual Studio .NET  \n− SQLite  \n− Visio  "
}