{
    "course_id": "CSC14118",
    "course_name": "Nhập môn dữ liệu lớn",
    "course_start_page": 231,
    "course_end_page": 232,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC14118  – Nhập môn d ữ liệu lớn  \n \n Thông tin chung  \n− Mã học phần  : CSC14118  \n− Tên tiếng Anh  : Introduction to Big Data  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nKhóa học được thiết kế để cung c ấp cho sinh vi ên kiến thức cơ bản về Dữ liệu lớn, bao g ồm \nnguy ên lý của Dữ liệu lớn, nhu c ầu và lợi ích của việc phân tích dữ liệu quy m ô lớn trong cu ộc \nsống hi ện đại và cách vận dụng các công cụ Dữ liệu lớn được biết đến rộng rãi. Dữ liệu quy \nmô lớn có những đặc điểm riêng bi ệt đòi hỏi phải mở rộng các công ngh ệ và thuật toán phân \ntích, do đ ó dẫn đến những quan đi ểm mới trong vi ệc hiểu dữ liệu và phân tích dữ liệu. \nSinh vi ên được cung c ấp một cái nhìn tổng quan v ề lĩnh vực Dữ liệu lớn đang ph át triển tích \ncực, các vấn đề chính của nó trong qu ản lý dữ liệu và các ứng dụng liên quan trong kinh doanh \nthông minh v à nghiên cứu khoa h ọc. Kinh nghi ệm thực tế của họ sẽ được củng cố thông qua \nviệc vận dụng các công cụ để quản lý và phân tích D ữ liệu lớn như Hadoop MapReduce đ ể xử \nlý hàng lo ạt, Spark đ ể xử lý trực tuy ến và cơ sở dữ liệu NoSQL. Đi ều đó cho ph ép sinh vi ên \nxây dựng các kỹ năng của riêng họ để giải quy ết các vấn đề phức tạp trong th ế giới thực để hỗ \ntrợ ra quy ết định. \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Trình bày được các nguy ên tắc chính của Dữ liệu lớn và động lực của việc chuy ển từ \nphân tích dữ liệu cổ điển sang c ác hình th ức nâng cao h ơn  \n 232 − Trình bày được các kỹ thuật cơ bản và các thu ật toán có thể mở rộng nh ư Hadoop Map \nReduce, Spark v à NoSQL trong ph ân tích dữ liệu quy m ô lớn \n− Thể hiện được quan đi ểm đầy đủ về phân tích D ữ liệu lớn thông qua vi ệc giới thiệu các \ncông cụ khác nhau đ ể phân tích dữ liệu quy m ô lớn và ứng dụng D ữ liệu lớn trong c ác \nứng dụng kh ác nhau  \n− Chọn lựa và triển khai c ác kỹ thuật học máy/phân tích dữ liệu vào môi trường m áy tính \nphù hợp với các ứng dụng đang đ ược xem x ét \n− Tham gia v à nắm bắt được nội dung c ủa một khóa học trực tuy ến có liên quan đ ến môn \nhọc \n Nội dung học phần   \n− Các nguy ên tắc cơ bản của Dữ liệu lớn \n− Nguy ên tắc cơ bản về Hadoop  \n− Hệ thống tệp phân tán Hadoop  \n− Hadoop MapReduce  \n− Nền tảng Spark  \n− Cấu trúc API Spark  \n− Tập dữ liệu phân tán cư trú Spark  \n− Phân tích nâng cao v ới Spark  \n− Seminar: Thuy ết trình nh ững gì đã học được qua c ác khóa học trực tuy ến \n Tài nguyên họ c phần  \nGiáo trình  \n− Tom White. 2015. Hadoop: The Definitive Guide (4th. ed.). O’Reilly Media, Inc.  \n− Bill Chambers and Matei Zaharia, 2018. Spark: The Definitive Guide: Big Data \nProcessing Made Simple. O’Reilly Media, Inc.  \nTài liệu tham khảo  \n− Anand Rajaraman a nd Jef rey David Ulman. 2012. Mining of Massive Datasets. \nCambridge University Press.  \n− Dirk deRoos, Paul C. Zikopoulos, Bruce Brown, Rafael Coss, and Roman B. Melnyk. \n2012. Hadoop for Dummies. John Wiley & Sons, Inc.  \n− https://www.youtube.com/channel/UCXFjdDwI_CRTPxlshXWMu7w  \n− https://www.coursera.org/specializations/big -data \nCông cụ hỗ trợ  \n− Zoom (SV c ần dùng email sinh vi ên để kích ho ạt tài kho ản và tham gia l ớp học) \n− Padlet (đ ịnh danh t ài kho ản bằng MSSV)  \n− Google doc, slides, sites... (đ ịnh danh t ài kho ản bằng MSSV)  "
}