{
    "course_id": "CSC10007",
    "course_name": "Hệ điều hành",
    "course_start_page": 88,
    "course_end_page": 89,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC10007  - Hệ điều hành  \n \n Thông tin chung  \n− Mã học phần  : CSC10007  \n− Tên tiếng Anh  : Operating Systems  \n− Khối kiến thức: Bắt buộc  - Cơ sở ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :  Introduction to Computer Systems  \n Mô tả học phần  \nThis course examines the important problems in operating system design  and implementation. \nThe operating system provides an established, convenient, and efficient interface between user \nprograms and the bare hardware of the computer on which they run. The operating system is \nresponsible for sharing resources (e.g., disks, ne tworks, and processors), providing common \nservices needed by many different programs (e.g., file service, the ability to start or stop \nprocesses, and access to the printer), and protecting individual programs from interfering with \none another. The course w ill start with a brief historical perspective of the evolution of \noperating systems over the last fifty years and then cover the major components of most \noperating systems. This discussion will cover the tradeoffs that can be made between \nperformance and f unctionality during the design and implementation of an operating system. \nParticular emphasis will be given to three major OS subsystems: process management \n(processes, threads, CPU scheduling, synchronization, and deadlock), memory management \n(segmentatio n, paging, swapping), and file systems; and on operating system support for \ndistributed systems.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:   \n 89 − Learn a lot of practical information about how programming languages, operating \nsystems, and architectures interact and how to use each effectively.  \n− Learn about how concurrency and distributed systems communicate and work correctly  \n− Have knowledge to more effectively use and manipulate computers and computer \nprogram  \n Nội dung học phần   \n− Overview  \n− A brief of History  \n− Architecture  \n− Processes and Threads  \n− Synchronnization  \n− Midterm examination  \n− CPU Schedule  \n− Memory management  \n− Virtual memory  \n− Disk  \n− File systems  \n− Review  \n Tài nguyên học phần  \nGiáo trình  \n− Giáo trình H ệ điều hành, Tr ần Trung D ũng & Ph ạm Tu ấn Sơn \nTài liệu tham khảo  \n− Modern Operating System, 4th Edition, Andrew Tanebaum & Herbert Bos, Pearson \nPLC, 2014  \n− Operating System Concepts, 10th Edition, Abraham Silberschatz, Peter B. Galvin & \nGreg Gagne, John Wiley & Sons, 2018  \nCông cụ hỗ trợ  "
}