{
    "course_id": "CSC13114",
    "course_name": "Phát triển ứng dụng web nâng cao",
    "course_start_page": 279,
    "course_end_page": 281,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC13114  - Phát tri ển ứng d ụng web nâng cao  \n \n Thông tin chung  \n− Mã học phần  : CSC13114  \n− Tên tiếng Anh  : Advanced Web Application Development  \n− Khối kiến thức: Tự chọn  - Kiến thức tốt nghiệp  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :  Cơ sở dữ liệu, Phương pháp lập trình hướng đối tượng, \nmột trong các môn học có hướng dẫn xây dựng ứng dụng web   \n Mô tả học phần  \nNội dung của môn học cung cấp cho sinh viên tiếp cận một số công nghệ tiên tiến  trong việc \nphát triển phần mềm. Bên cạnh việc cung cấp các nội dung về lý thuyết, môn học còn cung cấp \ncho sinh viên các kỹ năng để tự tìm hiểu và sử dụng được các công nghệ tương tự trong việc \nphát triển phần mềm. Ngoài ra, các nội dung của môn học sẽ gi úp sinh viên tiến hành xây dựng \ncác ứng dụng sử dụng các công nghệ mà sinh viên đã nắm bắt.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để tìm hiểu và trình bày một số công \nnghệ mới trong lĩnh vực kỹ thuật phần mềm  \n− Biết và giải thích được các thuật ngữ tiếng Anh thuộc chuyên ngành Kỹ thuật phần \nmềm  \n− Trình bày tổng quan về xu hướng Web 2.0  \n− Áp dụng được các kỹ thuật để trao đổi thông tin trên web thông qua RESTful Service  \n− Hiểu được các xu hướng phá t triển ứng dụng có khả năng phát triển và mở rộng nhanh: \nĐiện toán đám mây, NOSQL, …  \n− Để xuất và áp dụng các công nghệ phù hợp cho một dự án phần mềm  \n− Xây dựng được các ứng dụng dựa trên các công nghệ mới và giải quyết được một số \nvấn đề cụ thể của ứng dụng  hiện đại   \n 280 − Độc lập, tự tin, sáng tạo trong suy nghĩ và công việc; có khả năng thích nghi với môi \ntrường mới, học và tự học suốt đời  \n Nội dung học phần   \n− Giới thiệu môn học  \n− Giới thiệu Web service  \n• Ý nghĩa Web service  \n• Các loại Web service  \n• Kiến trúc SOAP Web service  \n• SOAP Web service trong .NET  \n− Window Communication Foundation  \n− RESTful web service  \n• Giao thức HTTP  \n• Kiến trúc REST  \n• RESTful Web service  \n− ASP.NET Web API  \n− Giới thiệu công nghệ mới  \n− Seminar về sử dụng RESTful web service  \n− Hướng dẫn thiết kế và xây dựng ứng dụn g cung cấp và sử dụng RESTful web service  \n− Giới thiệu Điện toán đám mây  \n• Khái niệm Cloud Computing  \no Các mô hình dịch vụ  \no Các mô hình triển khai  \n• Lợi ích của Cloud Computing  \n• Những vấn đề cần lưu ý khi sử dụng Cloud Computing  \n− Giới thiệu công nghệ mới  \n− Seminar ứng dụng các dịch vụ điện toán đám mây trong phát triển phần mềm  \n− Giới thiệu mối nguy hiểm về bảo mật của ứng dụng web và cách hạn chế  \n− Giới thiệu OAuth và OpenID  \n− Giới thiệu công nghệ mới  \n− Chủ đề rút trích thông tin web  \n• Nhu cầu của các hệ thống rút tr ích thông tin web  \n• Cơ chế hoạt động của các hệ thống rút trích thông tin web  \n• Cách thức rút trích thông tin từ một trang web  \n• Cách thức thực hiện các hành động tự động hóa web cơ bản  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− Mr. Ray J Rafaels,  Cloud Computing: From Beginning to End, 2015  \n− Leonard Richardson, Mike Amundsen, Sam Ruby, RESTful Web APIs, O'Reilly \nMedia, 2013  \n− Subbu Allamaraju, RESTful Web Services Cookbook, O'Reilly Media, 2010  \n− James Governor, Dion Hinchcliffe, and Duane Nickull, Web  2.0 Architectures, \nO'Reilly Media, 2009   \n 281 − Jesse Feiler, How to Do Everything with Web 2.0 Mashups, McGraw -Hill, 2008  \n− Christoph Klocker, Mashups: A New Concept in Web Application Programming, \nVDM Verlag, 2008  \n− Eric van der Vlist, Danny Ayers, Erik Bruchez, Joe Fawcett, Alessandro Vernet, \nProfessional Web 2.0 Programming, Wrox, 2007  \nCông cụ hỗ trợ  \n− Các IDE hỗ trợ lập trình tùy theo ngôn ngữ lập trình mà sinh viên lựa chọn.  "
}