{
    "course_id": "CSC10102",
    "course_name": "Kiến tập nghề nghiệp",
    "course_start_page": 117,
    "course_end_page": 119,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC10102  - Kiến tập ngh ề nghi ệp \n \n Thông tin chung  \n− Mã học phần  : CSC10102  \n− Tên tiếng Anh  : Career Observation  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 2  \n• Lý thuyết  : 15 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nHọc phần này sẽ giúp cho sinh viên tìm hiểu môi trường làm việc thực tế ở các doanh nghiệp \nCông nghệ thông tin thông qua hình thức thực tập /kiến tập/tham gia các workshop của doanh \nnghiệp. Sinh viên sẽ tham gia làm việc tại các dự án thực tế/quan sát cách làm việc của các \nnhân viên/ biết được những xu hướng công nghệ đang được triển khai thực tế tại các doanh \nnghiệp. Qua đó, sinh viên sẽ được  thực hành các kỹ năng chuyên môn cũng như các kỹ năng \nnghề nghiệp, làm quen với văn hóa doanh nghiệp, đồng thời có cái nhìn cụ thể hơn về con \nđường và trách nhiệm nghề nghiệp. Ngoài ra, môn học còn giúp sinh viên tự định hướng được \ncon đường nghề nghiệp c ũng như môi trường làm việc của mình sau khi ra trường, thực hành \ncác kỹ năng mềm, tác phong và thái độ hành xử chuyên nghiệp để có thể thích nghi, giao tiếp \nvà làm việc trong môi trường doanh nghiệp.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả nă ng: \n− Ứng dụng và trải nghiệm các kỹ năng nhóm trong môi trường làm việc thực tế  \n− Sử dụng kỹ năng ngoại ngữ cần thiết cho yêu cầu công việc  \n− Vận dụng các kỹ năng giao tiếp trong môi trường làm việc  \n− Nhận thức được tầm quan trọng của ý thức trách nhiệm và đạo đ ức nghề nghiệp mà xã \nhội yêu cầu  \n− Nhận thức và phát triển các kỹ năng và tính cách cá nhân   \n 118 − Hiện thực hóa được một hệ thống hoặc một phần của hệ thống CNTT theo thiết có có \nsẵn \n Nội dung học phần   \n1. Thực tập:  \nNội dung:  \n− Đây là hoạt động dành cho sinh viên đã hoàn tất xong chương trình học từ Học kỳ 4 trở \nđi. Mỗi sinh viên bắt buộc tham gia và hoàn tất ít nhất 1 đợt thực tập tại 1 doanh nghiệp \ntrong lĩnh vực CNTT trong thời gian tối thiểu là 2 tháng. Để tích lũy được hoạt động \nnày sinh viên hoàn tất những yê u cầu sau:  \n− Trường hợp sinh viên thực tập tại các doanh nghiệp do Khoa giới thiệu trong đợt thực \ntập chung của Khoa thì sinh viên sẽ đăng ký nguyện vọng theo thông báo của Khoa. \nSau đó, sinh viên sẽ thực hiện bài test của doanh nghiệp. Nếu đạt sinh viên sẽ thực tập \ntheo thông báo của Khoa.  \n− Trường hợp sinh viên thực tập tại các doanh nghiệp khác (không nằm trong số những \ndoanh nghiệp Khoa giới thiệu) hoặc thời điểm thực tập không nằm trong đợt thực tập \nchung của Khoa thì trước khi thực tập: sinh viên nộp đơn (theo mẫu) và đề cương thực \ntập có xác nhận của công ty thực tập để Khoa xét duyệt. Kết quả xét duyệt sẽ được \nthông báo cho sinh viên sau 1 tuần làm việc. Sinh viên sẽ thực tập tại doanh nghiệp đó \nnếu được duyệt.  \nMinh chứng:  \n− Trong tuần đầu tiên ngay sau kh i đợt thực tập kết thúc sinh viên sẽ phải nộp lại:  \n• Báo cáo thực tập (theo mẫu gợi ý của Khoa).  \n• Bản nhận xét thực tập của công ty thực tập (theo mẫu của Khoa).  \n− Báo cáo và nhận xét thực tập sẽ được giáo viên phụ trách thực tập xem xét và thông \nbáo kết quả ch o sinh viên sau 1 tuần làm việc. Sinh viên đạt nếu cả bảng nhận xét và \nbáo cáo thực tập được đánh giá là đạt. Ngược lại, sinh viên được xem như chưa tích lũy \nđược hoạt động này và phải thực tập lại.  \n2. Kiến tập:  \nNội dung:  \n− Mỗi sinh viên cần phải tham gia ít  nhất 2 chuyến tham quan thực tế tại 2 doanh nghiệp \nkhác nhau trong suốt 4 năm học. Sinh viên sẽ đăng ký tham gia theo thông báo của \nKhoa và nghiêm túc chấp hành những quy định của chuyến tham quan.  \nMinh chứng:  \n− Trong vòng 3 ngày làm việc sau khi kết thúc chuyến tham quan, sinh viên phải nộp về \ncho Khoa bài thu hoạch (theo mẫu gợi ý) sau chuyến đi. Sinh viên được xem là tích lũy \nđược hoạt động này nếu chấp hành nghiêm túc các quy định của chuyến đi (do giáo \nviên phụ trách xác nhận) và nộp bài thu hoạch đầy đủ và đúng hạn.  \n3. Seminar/ hội thảo giới thiệu doanh nghiệp và công nghệ:  \nNội dung:  \n− Đối với hoạt động Tham dự seminar/ hội thảo chuyên môn, sinh viên lựa chọn, đăng \nký và tham dự ít nhất 2 buổi seminar/hội thảo chuyên môn do Khoa phối hợp với các \ncông t y tổ chức.  \nMinh chứng:  \n− Mỗi lần tham dự sinh viên cần phải nộp bài thu hoạch (theo mẫu) ngay khi buổi hội \nthảo kết thúc về cho giáo viên phụ trách. Sinh viên được xem là đạt được hoạt động này \nnếu sinh viên có đăng ký, điểm danh tham dự, tuân thủ nghiêm tú c các hoạt động diễn \nra trong buổi seminar và nộp bài thu hoạch nghiêm chỉnh và đúng hạn. Ngược lại sinh \nviên được xem là chưa tích lũy được hoạt động này.   \n 119 4. Các hoạt động học thuật khác:  \nNội dung:  \n− Các hoạt động trong mục này tương đương với một trong 3 hoạt động bắt buộc được \nnêu ở trên. Nếu sinh viên tham gia những hoạt động học thuật khác, khi xét kết quả học \nphần sẽ được quy đổi thành các hoạt động tương ứng.  \n− Hoạt động Nghiên cứu khoa học:  \n Sinh viên có thể chọn lựa và tham gia các hoạt động b ên dưới:  \n \nSTT  Hoạt động  Hoạt động được \nquy đổi  Minh chứng  \n \n1 Tham gia các nhóm nghiên cứu thuộc \ncác phòng Lab của Khoa hoặc các \nđơn vị đào tạo có uy tín trong lĩnh vực \nCNTT (tối thiểu 2 tháng)  Thực tập thực tế  Báo cáo thực tập  \n2 Tham gia đóng góp và báo cáo các \ncông trình NCKH trong nước  Kiến tập  Bản sao báo cáo \ncông trình  \n3 Tham gia và báo cáo công trình \nNCKH quốc tế  Thực tập  Bản sao báo cáo \ncông trình  \n4 Đạt thành tích tại các cuộc thi học \nthuật trong lĩnh vực CNTT trong \nnước và quốc tế  Kiến tập  Bản sao chứng \nnhận thành tích  \n \nGiáo trình  \nTài liệu tham khảo  \nCông cụ hỗ trợ  "
}