{
    "course_id": "CSC11002",
    "course_name": "Hệ thống viễn thông",
    "course_start_page": 98,
    "course_end_page": 100,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC11002  - Hệ thống vi ễn thông  \n \n Thông tin chung  \n− Mã học phần  : CSC11002  \n− Tên tiếng Anh  : Telecommunication Systems   \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nĐây là môn học thuộc khối kiến thức chuyên ngành, bắt buộc cho sinh viên chuyên ngành \nMạng máy tính và viễn thông. Môn học này nhằm trang bị cho sinh viên các kiến thức tổng \nquan về hệ thống viễn thông. Giúp sinh viên hiểu được những khái niệm cơ bản, những yếu tố \nliên quan đến quá trình truyền thông tổng quát. Môn học cũng giúp sinh viên có những trải \nnghiệm thực tế về quá trình xây dựng một hệ thống điện t hoại VoIP một cách có hệ thống và \ncó phương pháp. Sinh viên sẽ được tìm hiểu những thành phần và mô hình hoạt động thực tiễn \ncủa các hệ thống viễn thông Việt Nam; các dịch vụ viễn thông đang được cung cấp và các dịch \nvụ chuẩn bị triển khai ở Việt Nam, cũng  như xu hướng phát triển trên thế giới.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để trình bày một số báo cáo kỹ thuật \ntrong lĩnh vực mạng máy tính, viễn thông  \n− Biết và giải thích được các thuật ng ữ tiếng Anh cơ bản thuộc về nhánh mạng máy tính, \nviễn thông  \n− Giải thích được các khái niệm cơ bản, các thuật ngữ, công việc và nguyên tắc đạo đức \ncơ bản... thuộc lĩnh vực mạng máy tính, viễn thông  \n− Trình bày và mô tả được quan hệ giữa các thành phần cơ bản, nguyên tắc hoạt động \ncủa các hệ thống viễn thông trong thực tế   \n 99 − Định nghĩa và mô tả được những đặc điểm cơ bản một số dịch vụ viễn thông đang được \ncung cấp và các dịch vụ chuẩn bị triển khai trong thực tế.  \n− Có khả năng phân tích và triển khai một số dịch vụ,  hệ thống viễn thông đơn giản  \n− Có khả năng sử dụng các công cụ phần mềm hỗ trợ, cài đặt giao tiếp giữa một số thiết \nbị thật và mạng viễn thông thực tế  \n Nội dung học phần   \n− Giới thiệu môn học: mục tiêu, đồ án, quy định về các hoạt động cá nhân / nhóm…  \n− Tổng quan về hệ thống viễn thông: Khái niệm, thuật ngữ viễn thông cơ bản;  \n− Quá trình truyền thông.  \n− Điều chế: Khái niệm, mục đích, nguyên tắc, phân loại;  \n− Kỹ thuật điều chế PCM.  \n− Giới thiệu về kỹ thuật ghép kênh; Kỹ thuật FDM.  \n− Kỹ thuật  TDM;  \n− PAM - TDM;  \n− PCM -TDM.  \n− Hệ thống ghép kênh sơ cấp  theo chuẩn Bắc Mỹ và Nhật.  \n− PCM 24 kênh 12 khung  \n− PCM 24 kênh 24 khung  \n− Hệ thống ghép kênh sơ cấp theo chuẩn Châu Âu;  \n− Giới thiệu về ghép kênh số cấp cao  \n− Phân cấp số các nước.  \n− Chuyển mạch: mục đích, phân loại  \n− Chuyển mạch kỹ thuật số  \n− Hệ thống điện thoại công cộng  \n− Hệ thống điện thoại di động  \n− Hệ thống điện thoại di động - thông số thực tế  \n− Hệ thống vệ tinh  \n− Mạng băng rộng  \n− Sự kết hợp các hệ thống viễn thông trong thực tế  \n− Giới thiệu về công nghệ - dịch vụ  \n− Giới thiệu về công nghệ - dịch vụ  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− Essentials of Modern Telecommunications Systems, Nihal Kularatna, Dileeka Dias, \nArtech House, 2004.  \n− Fundamentals of Telecommunications, Roger L. Freeman, John Wiley & Sons, Inc., \nPublication, 2005.  \n− Telecommunications: A Beginner’s Guide, Mitchell S. Moore, N. Todd Pritsky, Cliff \nRiggs, Peter V. Southwick, McGraw -Hill, 2002.  \n− Broadband Telecommunications Handbook, Second Edition, Regis J. (Bud) Bates, \nMcGraw−Hill, 2002.   \n 100 − Theory and Applications of OFDM a nd CDMA, Henrik Schulze, Christian Luders, \nJohn Wiley & Sons, 2005.  \n− Principles of Mobile Communication, Second Edition, Gordon L. Stüber, Kluwer \nAcademic Publishers, 2002.  \n− Technologies and Systems for Access and Transport Networks, Jan A. Audestad, \nArtech House, 2008.  \n− Next Generation Networks, Dr Jingming Li Salina, Pascal Salina, John Wiley & Sons, \n2007.  \n− Asterisk -primer,   Roger S. Pressman.  \n− Building a telephony systems with Asteisk, David Gomillion, Barrie Dempster  \n− TrixBox Made Easy, Barr ie DempsterKerry Garrison  \nCông cụ hỗ trợ  \n− VMWare Workstation  \n− Hyper Terminal  \n− Softphone  \n− Hệ thống PSTN thực tế  "
}