{
    "course_id": "CSC10108",
    "course_name": "Trực quan hóa dữ liệu",
    "course_start_page": 153,
    "course_end_page": 154,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC10108  – Trực quan hóa d ữ liệu \n \n Thông tin chung  \n− Mã học phần  : CSC10108  \n− Tên tiếng Anh  : Data Visualization  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn học cung cấp kiến thức cơ bản về biểu diễn trực quan dữ liệu nhằm tạo ra “thông tin để \nnhìn” (visual information) cho phép nhìn thấy được các xu hướng, điểm nổi bật, mẫu dữ liệu, \ngiá trị ngoại lệ hoặc những thông tin quan trọng khác mà ta không thể thấy nếu chỉ nhìn vào \ndữ liệu gốc ban đầu. Si nh viên sẽ tìm hiểu làm thế nào máy tính hiển thị thông tin bằng đồ họa \nvà làm thế nào con người cảm nhận được thông tin một cách trực quan. Sinh viên cũng sẽ được \nhọc các hình thức của dữ liệu, bao gồm dữ liệu định lượng và không định lượng, và làm thế \nnào chúng được ánh xạ đúng với các yếu tố của trực quan hóa để người quan sát cảm nhận tốt \nđược ý nghĩa của dữ liệu. Môn học sẽ tích hợp trực quan hóa dữ liệu vào các hệ thống khai \nthác dữ liệu để hỗ trợ cho việc ra quyết định, và xây dựng hiệu quả bảng điều  khiển (dashboard) \ntrực quan.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Phối hợp với các thành viên trong nhóm để trao đổi chính kiến của mình trong quá trình \nthiết kế  \n− Trình bày lại tài liệu/bài báo tiếng Anh có liên quan tới việc vận dụng  nguyên lý tương \ntác người - máy vào HTTT  \n− Thực hành suy nghĩ có phê phán, sáng tạo trong việc nắm bắt các vấn đề của TTNM \ntrong HTTT   \n 154 − Vận dụng các phương pháp biểu diễn dữ liệu để biểu diễn trực quan cho nhiều loại dữ \nliệu khác nhau thông qua các công cụ bi ểu diễn  \n− Đánh giá ý nghĩa của dữ liệu sau khi biểu diễn trực quan  \n Nội dung học phần   \n− Giới hiệu về trực quan hóa  \n− Sử dụng đồ họa để hiển thị dữ liệu  \n− Nhận thức bằng hình ảnh và luật của Fitts  \n− Các loại trực quan hóa cho dữ liệu số (charts)  \n− Các loại trực quan hóa cho dữ liệu số (scatter plots)  \n− Các loại trực quan hóa cho dữ liệu phi số (graphs, networks)  \n− Các loại trực quan hóa cho dữ liệu phi số (treemaps)  \n− Các loại trực quan hóa cho dữ liệu phi số (PCA và multidimensional scaling)  \n− Trực quan hóa dữ liệu cho kết quả khai thác dữ liệu  \n− Phân tích trực quan để hỗ trợ quyết định  \n− Bảng điều khiển trực quan  \n Tài nguyên học phần  \nGiáo trình  \n− Visualization Analysis and Design, Tamara Munzner, AK Peters Visualization Series, \nCRC Press, 2014.  \nTài liệu tham khảo  \n− The Visual Display of Quantitative Information, 2nd  Edition, Edward Tufte, Graphics \nPress, 2001.  \n− Envisioning Information, 3rd Edition, Edward Tufte, Graphics Press, 1990.  \n− Information Visualization : Perception for Design, 3rd Edition,  Colin Ware, Elsevior, \n2013.  \nCông cụ hỗ trợ  "
}