{
    "course_id": "CSC15003",
    "course_name": "Mã hóa ứng dụng",
    "course_start_page": 134,
    "course_end_page": 136,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC15003  – Mã hóa ứng dụng \n \n Thông tin chung  \n− Mã học phần  : CSC15003  \n− Tên tiếng Anh  : Applied Cryptography  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn học này nhằm cung cấp cho sinh viên các kiến thức cơ bản và nền tảng về kiến trúc, tính \nchất, ý nghĩa và công dụng của các nhóm thuật toán chính trong lĩnh vực an toàn thông tin (mã \nhóa đối xứng, mã hóa bất đối xứng, chữ ký điện tử, hàm băm mật mã). Ngoài ra, môn học cũng \ntrình bày và phân tích một số bài  toán và giải pháp phổ biến trong lĩnh vực an toàn thông tin \n(trao đổi khóa, chứng nhận khóa công khai, an toàn thông tin trong giao dịch trên mạng, quản \nlý định danh, bảo vệ tính riêng tư).  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Tham g ia chủ động thảo luận nhóm (theo nhóm lớn của môn học) và phối hợp làm việc \ntrong nhóm nhỏ (2 sinh viên); ý thức được trách nhiệm trong việc bảo vệ an toàn thông \ntin của cá nhân và tổ chức  \n− Đọc hiểu các tài liệu chuyên ngành bằng tiếng Anh, giải thích được một số thuật ngữ \ntiếng Anh trong lĩnh vực an toàn thông tin; trình bày (dạng báo cáo viết) và thuyết trình \nvề chủ đề trong lĩnh vực an toàn thông tin.  \n− Có tư duy phản biện và cách suy nghĩ toàn diện khi phân tích, đánh giá giải pháp bảo \nvệ an toàn thông tin  \n− Trình bày và giải thích các kiến thức nền tảng cơ bản về kiến trúc, tính chất, ý nghĩa và \ncông dụng của các nhóm thuật toán chính trong lĩnh vực an toàn thông tin  \n− Trình bày và phân tích một số nhóm bài toán chính trong an toàn thông tin   \n 135 − Xác định và phân t ích các yêu cầu an toàn thông tin cơ bản trong hệ thống, từ đó có khả \nnăng xây dựng giải pháp, giao thức, quy trình để an toàn thông tin trong các ứng dụng \nthực tế  \n− Phân tích, đánh giá ưu điểm và hạn chế của các giải pháp, giao thức, quy trình an toàn \nthông  tin \n− Thiết kế và phát triển được các phần mềm bảo mật và an toàn thông tin ở mức đơn giản  \n Nội dung học phần   \n− Giới thiệu môn học  \n− Chủ đề 1: Tổng quan về An toàn thông tin & Ứng dụng  \n− Chủ đề 2: Các hệ thống mật mã đối xứng (cổ điển)  \n− Chủ đề 3: Lý thuyết Shannon  \n− Chủ đề 4: Các hệ thống mã hóa đối xứng mới (DES, AES…)  \n− Chủ đề 5: Các chế độ hoạt động, các chiến lược padding  \n− Chủ đề 6: Các hệ thống mật mã bất đối xứng  \n− Chủ đề 7: Chữ ký điện tử  \n− Chủ đề 8: Hàm băm mật mã  \n− Chủ đề 9: Chứng nhận khóa công  \n− Chủ đề 10: Secured Socket Layer  \n− Chủ đề 11: Phân tích yêu cầu, thiết kế quy trình, giao thức bảo vệ thông tin trong hệ \nthống phần mềm  \n− Chủ đề 11: Phân tích yêu cầu, thiết kế quy trình, giao thức bảo vệ thông tin trong hệ \nthống phần mềm (tiếp theo)  \n− Seminar các chủ đề tì m hiểu nâng cao  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \n− Dương Anh Đức, Trần Minh Triết, Mã hóa và Ứng dụng, NXB Đại học Quốc gia, 2005  \n− Bùi Doãn Khanh, Nguyễn Đình Thúc, Mã hoá thông tin : phương pháp và ứng dụng, \n2005  \nTài liệu tham khảo  \n− Douglas R. Stinson, Cryptography – Theory and Practice, 3rd edition, CRC Press,  \n2005.  \n− William Stallings, Cryptography and Network Security: Principles and Practice, 5th \nEdition, Prentice Hall, 2005.  \n− Alfred J. Menezes, Paul C. van Oorschot , Scott A. Vanstone,  Handbook of Ap plied \nCryptography,  CRC Press, 1997  \n− Bruce Schneier, Schneier on Security, Wiley, 2008  \n− Rolf Oppliger, Contemporary Cryptography, Artech House Publishers, 2005  \n− Christof Paar, Jan Pelzl, Understanding Cryptography: A Textbook for Students and \nPractitioners, Springer, 2009  \n− Phil Windley, Digital Identity, O'Reilly, 2005  \n− Jonathan Katz and Yehuda Lindell.  Introduction to Modern Cryptography, Chapman \nand Hall/CRC Press, August 2007.   \n 136 − Henk van Tilborg (Editor), Encyclopedia of Cryptography and Security , Springer -\nverlag, 2005  \n− Oded Goldreich, Foundations of Cryptography: Basic Tools. Cambridge University \nPress.  \n− Bruce Schneier, Applied Cryptography (Second Edition), John Wiley & Sons, 1996  \nCông cụ hỗ trợ  \n− Visual Studio .NET  \n− Eclipse/Netbean  "
}