{
    "course_id": "CSC12002",
    "course_name": "Cơ sở dữ liệu nâng cao",
    "course_start_page": 145,
    "course_end_page": 146,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC12002  – Cơ s ở dữ liệu nâng cao  \n \n Thông tin chung  \n− Mã học phần  : CSC12002  \n− Tên tiếng Anh  : Advanced Database Systems  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :  Introduction to Databases (C ơ sở dữ liệu )  \n Mô tả học phần  \nThis course aims to equip students with advanced knowledge in the field of relational database \ndesign. The content of the course focusing on four phases in database design: collecting a nd \nanalyzing user requirements, conceptual database design, logical database design, and physical \ndatabase design. In conceptual database design, students learn how to determine user \nrequirements for data and develop data models to represent those requirem ents. Logical \nspecifications, which map the conceptual requirements into the data model associated with a \nspecific database management system. In the conceptual and logical design phases, the role of \nfunctional dependency will be discussed, especially rela ted to the issues of integrity constraints \nchecking, quality assessment of database schema and selecting the right database schema \nassociated with information system requirements. In physical database design, students learn \nhow to transform the requirement s for data storage developed during database analysis into \nspecifications to guide database implementation. Physical specifications, which  \nindicate all the parameters for data storage that are then used as input for database \nimplementation. During this pha se, the content of course also focuses on how to select the \nappropriate physical techniques (index, data fragment, partition) for efficient queries on a \nspecific relational database management system such as MS SQL, Oracle. In addition, the \ncontent of the course also introduces to some new popular databases today, such as NoSQL \ndatabase, geographic information database and other types of databases on the Internet.   \n 146 \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Practice teamwork skills  \n− Practice r eading English documents related to relational database design.  \n− Practice critical and creative thinking in relational database design.  \n− Present the meaning and importance of relational databases design  \n− Knowing and applying the basic knowledge for the relati onal database design phases \nsuch as data models, functional dependency, normal form, ...  \n− Knowing and applying some techniques to get user requirements  \n− Knowing and realizing the tasks in the conceptual and logical database design.  \n− Knowing and executing the tasks in the physical design phases  \n− Listing some modern popular databases currently  \n Nội dung học phần   \n− Overview of Relation Database Design  \n− Data Models: Entity Relationship Model  \n− Data models: Enhanced Entity Relationship, Model Relational Data Model  \n− Concep tual Database Design  \n− Data Dependency & Normal Form  \n− Logic Database Design  \n− Physical Database Design  \n− Advanced Topics  \n− Review  \n Tài nguyên học phần  \nGiáo trình  \n− Jeff Hoffer, Ramesh Venkataraman, Heikki Topi, Modern Database System, 12th \nedition.  \n− Carlos Coronel, Steven Morris, Database System: Design, Implementation, and \nManagement, 12th edition.  \n− Toby Teorey, Sam Lightstone, Tom Nadeau, Database Modeling and Design - Logical \nDesign, 4th Edition.  \n− Sam Lightstone, Toby Teorey, Tom Nadeau, Physical Database D esign, 4th Edition.  \nTài liệu tham khảo  \nCông cụ hỗ trợ  \n− Data Design Tools: ER -Win, Power Designer, ... Programing Environments: C#, MS \nSQL Server,  "
}