{
    "course_id": "CSC14109",
    "course_name": "Logic mờ và ứng dụng",
    "course_start_page": 223,
    "course_end_page": 224,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC14109  - Logic m ờ và ứng d ụng \n \n Thông tin chung  \n− Mã học phần  : CSC14109  \n− Tên tiếng Anh  : Fuzzy Logic and Applications  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Cơ sở trí tuệ nhân tạo, Các hệ cơ sở tri thức    \n Mô tả học phần  \nMôn học này nhằm cung cấp cho sinh viên kiến thức lý thuyết tập mờ từ cơ bản đến phức tạp: \nkhái niệm tập mờ, Logic mờ, quan hệ mờ, số mờ. Môn học giúp sinh viên nắm được các phương \npháp giải quyết một số bài toán cơ bản trên số mờ: Giải phương trình số mờ bậc nhất, giải \nphương trình mờ bậc 2; và hiểu các bước cần thiết để xây dựng một hệ thống mờ: Hàm thành \nviên cho các biến rời rạc, hàm thành viên cho không gian các biến liên tục, xử lý bài toán mờ. \nMôn học cũng giúp sinh viên biết cách áp dụng bộ điều khiển logic mờ cho một ví dụ ứng dụng \nthực tế: Ứng dụng bộ điều khiển logic mờ mô phỏng điều khiển trực thăng kh ông người lái; \nCó khả năng thiết kế, xây dựng một hệ thống mờ cho một bài toán ứng dụng đơn giản.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để trình bày một số báo cáo kỹ thuật \ntrong các ứng dụng của logic mờ.  \n− Biết và giải thích được các thuật ngữ tiếng Anh về Logic mờ và ứng dụng của nó, đọc \nđược các bài báo khoa học tiếng Anh.  \n− Giải thích được các khái niệm cơ bản, thuật ngữ, trách nhiệm, công việc và phân tích \nđược bài toán... trong các áp dụng c ủa Logic mờ.  \n− Hiểu lý thuyết tập mờ.  \n− Hiểu các bước cần thiết để xây dựng một hệ thống mờ   \n 224 − Hiểu cách áp dụng bộ điều khiển logic mờ cho một ví dụ ứng dụng thực tế.  \n− Biết cài đặt một hệ thống mờ cho một bài toán ứng dụng đơn giản.  \n Nội dung học phần   \n− Các khái ni ệm cơ bản về lý thuyết tập mờ  \n− Logic mờ  \n− Quan hệ mờ  \n− Tìm hiểu các nghiên cứu mới về công nghệ mờ  \n− Số mờ  \n− Giải biện luận phương trình bậc 2 mờ cho tất cả các trường hợp  \n− Các hệ thống mờ  \n− Thiết kế, cài đặt hệ thống mờ cho một ví dụ cụ thể  \n− Một hệ thống mờ trong ứng dụng thực tế  \n− Sử dụng mã nguồn mở xây dựng cài đặt bộ điều khiển mờ cho bài toán điều khiển trực \nthăng không người lái trong môi trường giả lập trên máy tính  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− The Fuzzy Systems Handbook, Cox, E., MA: Academic Press, Cambridge, 1994.  \n− Fuzzy Sets and Systems: Theory and Applications, Dubois, D. and Prade, H., New \nYork: Academic Press, 1980.  \n− Fuzzy sets, Zadeh, L. A., Information and Control, vol, 8, pp, 338 -353, 1965.  \n− PRUF —A meaning representation language for natural languages, Zadeh, L. A., \nInternational Journal of Man -Machine Studies, vol. 10, pp. 395 -460, 1978.  \n− Fuzzy logic, neural networks and soft computing, Zadeh, L. A., Communications of the \nACM, vol.37, pp. 77 -84, 1994.  \n− Machine Learning, MIT CHELL, M. T., McGraw Hill, New York, 1996.  \n− Thuật giải di truyền: Cách giải tự nhiên các bài toán trên máy tính, Hoàng Kiếm và Lê \nHoàng Thái, NXB Giáo Dục,Việt nam, 2000.  \n− Mô hình lai GA -FL trong bài toán mô phỏng điều khiển tự động trực thăng không người \nlái,  Lê Hoàng Thái, Bùi Tiến Lên, Kỷ yếu hội thảo khoa học công nghệ quốc gia lần \nthứ ba (Fair’07): Nghiên cứu cơ bản và ứng dụng CNTT (Nha trang, Khánh hòa 9 -\n10/8/2007), Nhà xuất bản Khoa học và Kỹ thuật , Việt nam, tr. 133 -149, 2008.  \nCông cụ hỗ trợ  \n− Visua l Studio .NET  \n− Mircosoft SQL, 2008  \n− Visio Axure  "
}