{
    "course_id": "CSC12107",
    "course_name": "Hệ thống thông tin phục vụ trí tuệ kinh doanh",
    "course_start_page": 271,
    "course_end_page": 273,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC12107  – Hệ thống thông tin ph ục vụ trí tu ệ kinh doanh  \n \n Thông tin chung  \n− Mã học phần  : CSC12107  \n− Tên tiếng Anh  : Information Systems for Business Intelligence  \n− Khối kiến thức: Tự chọn  – Kiến thức tốt nghiệp  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nNội dung của môn học cung cấp cho sinh viên các khái niệm về khung nhìn, kho dữ liệu, cách  \ntích hợp dữ liệu từ nhiều nguồn vào kho dữ liệu và cách làm mới nội dung kho dữ liệu. Sinh \nviên cũng được trang bị phương pháp phân tích dữ liệu trực tuyến đa chiều và các phương pháp \nphổ biến trong khai phá dữ liệu. Khái niệm Giải pháp thông minh trong h ệ thống thông tin kinh \ndoanh (Business Intelligence) sẽ được biết đến thông qua việc ứng dụng kỹ thuật khai phá dữ \nliệu vào khai thác HTTT. Ngoài ra sinh viên sẽ được thực hành nhằm vận dụng được những \nkiến thức lý thuyết vào các yêu cầu khai thác nâng cao  trong một môi trường công nghệ liên \nhoàn.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Sử dụng khả năng cộng tác nhóm và trình bày lại các vấn đề liên quan đến Kho dữ liệu \n- KDL (mô hình thiết kế kho DL, cách khai thác kho DL)  \n− Sử dụng kỹ nă ng đọc tài liệu kỹ thuật về KDL bằng tiếng Anh  \n− Thực hành suy nghĩ có phê phán, sáng tạo trong việc xây dựng KDL và khai thác KDL \nvới các kỹ thuật thông minh  \n− Giải thích được ý nghĩa và mục tiêu của chức năng trí tuệ kinh doanh của hệ thống \nthông tin  \n− Phân tích các yêu cầu khai thác thông minh và xây dựng KDL phù hợp   \n 272 − Ứng dụng được các kỹ thuật phân tích trực tuyến (OLAP) và kỹ thuật khai thác dữ liệu \nphổ biến trong kinh doanh (Data Mining -DM).  \n− Sử dụng được các công cụ liên quan đến hiện thực KDL, khai thác KDL với các kỹ \nthuật OLAP và DM gắn kết với hệ quản trị CSDL. Phân tích được ý nghĩa của kết quả \ncủa OLAP và của các kỹ thuật DM trong từng bối canh ứng dụng cụ thể.  \n Nội dung học phần   \nGiới thiệu cách học, đánh giá môn học, yêu cầu thành lập nhóm (15’)  \n– Chủ đề I: (2t15’): Dẫn nhập về KDL, đặc trưng KDL, vai trò của KDL và công cụ phân \ntích trong hỗ trợ quyết định  \n– Chủ đề II : Tích hợp dữ liệu vào KDL (2t)  \n– Cho BT1, làm sơ bộ và thảo luận ngay tại chỗ (1t)  \n– BT1a: thảo luận về mô hình lôgíc (1t)  \n– Chủ đề III (1): Thiết KDL (2t)  \n– BT1b: thảo luận về lược đồ quan hệ của KDL (2t)  \n \n– BT2a (1t): thảo luận bài giải  \n– Chủ đề III (2): Thiết KDL (1t)  \n– Kiểm tra #1 (30’)  \n– BT2b (1t): thảo luận bài giải  \n– Chủ đề IV (1): Xác định mục tiêu cho phân tích trực t uyến (1t30)  \n– BT2c (1t30): thảo luận bài giải  \n– Chủ đề IV (2): các kỹ thuật phân tích trực tuyến (1t)  \n– Chủ đề IV (3): các kỹ thuật phân tích trực tuyến (2t)  \n– Thảo luận trên BT3  \n– Chọn lọc 2 -3 lời giải của SV để thảo luận (3t)  \n– Chủ đề V (1): các kỹ thuật  khai thác DL (2t)  \n– Kiểm tra #2 (30’)  \n– Thảo luận BT4 (1t)  \n– Chủ đề V (2): các kỹ thuật khai thác DL (1t30)  \n– Chủ đề V (3): Báo cáo của SV về các ứng dụng khai thác DL trong kinh doanh  \n– Chủ đề V (4): các kỹ thuật khai thác DL (1t30)  \n– Thảo luận trên tổng  thể các bài tập và gắn kết với các bài thực hành  \nTổng kết  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− Ralph Kimball and Margy Ross: Relentlessly Practical Tools for Data Warehousing \nand Business Intelligence, The Kimball Group Reader, Wiley Publishing Inc., 2010.  \n− Vincent Rainardi: Building a Data Warehouse with Examples in SQL Server, Apress, \n2008.  \n− Michael J.A. Berry and Gordon S. Linoff: Data Mining Techniques for Marketing, \nSales and Customer Relationship Management, Wiley and Sons, second edition, Wiley \nPublishing Inc., 2004.  \n− Claudia Imhoff, Nicholas Galemmo, Jonathan G.Geiger. Mastering data warehouse \ndesign – Relational and dimentional techniques. Wiley Publishing, Inc. 2003.   \n 273 − Joseph Guerra, SVP, CTO & Chief Architect. “Why You Need a Data  Warehouse”. \nCopyright RapidDecision 2013  \nCông cụ hỗ trợ  \n− Phần mềm MS -SQL Server 2005/2012 và các công cụ SSIS, SSAS ;  \n− Công cụ DM (Weka hoặc công cụ có sẵn trong MS -SQL -Server);  \n− Visual Studio  2005/2012.  "
}