{
    "course_id": "CSC16101",
    "course_name": "Đồ họa ứng dụng",
    "course_start_page": 255,
    "course_end_page": 256,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC16101  – Đồ họa ứng dụng \n \n Thông tin chung  \n− Mã học phần  : CSC16101  \n− Tên tiếng Anh  : Applied Computer Graphics  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Đồ họa máy tính    \n Mô tả học phần  \nMôn học cung cấp các kiến thức nền tảng, tiên tiến về Đồ họa ứng dụng để sử dụng và phát \ntriển các ứng dụng trên nền các phần mềm đồ họa đã có nhằm đáp ứng nhanh chóng yêu cầu \ntrong các lĩnh vực như: CAD, C AM, Game, Mô phỏng, Tăng cường hiện thực ảo, Quảng cáo, \nGiáo dục…Nội dung bao gồm các phần chính như phương pháp sử dụng các phần mềm thiết \nkế hình hai chiều (CorelDraw, PhotoShop, AutoCad), hình ba chiều (AutoCad, 3DStudio Max, \nMaya) và phương pháp phát t riển các ứng dụng dựa trên nền các phần mềm đồ họa với các \nngôn ngữ nhúng như Visual Lisp, VBA.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Có khả năng báo cáo và ứng dụng các kiến thức trong lĩnh vực Đồ họa ứng dụng ở mức \nđộ cá nhân và nhóm.  \n− Biết và giải thích được các thuật ngữ tiếng Anh thuộc chuyên ngành Đồ họa ứng dụng.  \n− Phân tích và giải quyết vấn đề liên quan đến lĩnh vực Đồ họa ứng dụng.  \n− Sử dụng  phương pháp tạo hình hai chiều trong các phần mềm thiết kế về mỹ thuật và \nkỹ thuật  \n− Sử dụng phương pháp tạo hình ba chiều trong các phần mềm thiết kế về mỹ thuật và kỹ \nthuật   \n 256 − Sử dụng phương pháp tạo hoạt hình trong các phần mềm thiết kế về mỹ thuật và kỹ \nthuật  \n− Sử dụng ngôn ngữ nhúng trong các phần mềm thiết kế về mỹ thuật và kỹ thuật  \n Nội dung học phần   \n− Giới thiệu về Đồ họa ứng dụng  \n− Các khái niệm cơ bản của Đồ họa ứng dụng  \n− Phương pháp vẽ và tô màu trong phần mềm đồ họa mỹ thuật hai chiều  \n− Phương pháp vẽ và tổ chức bản vẽ trong phần mềm đồ họa kỹ thuật hai chiều  \n− Phương pháp tạo hình ba chiều trong phần mềm đồ họa mỹ thuật ba chiều  \n− Phương pháp tạo hình ba chiều trong phần mềm đồ họa kỹ thuật ba chiều  \n− Phương pháp gán chất liệu lên đối tượng ba chiều.  \n− Phương pháp tạo hoạt cảnh  \n− Sử dụng ngôn ngữ nhúng trên phần mềm thiết kế về mỹ thuật, kỹ t huật \n− Seminar đồ án về phương pháp tạo hình hai chiều  \n− Seminar đồ án về phương pháp tạo hình ba chiều.  \n− Seminar đồ án về ngôn ngữ nhúng  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− Tài liệu hướng dẫn sử dụng phần mềm CorelDRAW  \n− Tài liệu hướng dẫn sử dụng  phần mềm Adobe Illustrator  \n− Tài liệu hướng dẫn sử dụng phần mềm AutoCAD.  \n− Tài liệu hướng dẫn sử dụng phần mềm 3DStudio MAX  \nCông cụ hỗ trợ  \n− Các phần mềm có bản quyền CorelDRAW, Adobe Illustrator, AutoCAd, 3DStudio \nMAX  "
}