{
    "course_id": "CSC13010",
    "course_name": "Thiết kế phần mềm",
    "course_start_page": 186,
    "course_end_page": 188,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC13010  - Thiết kế phần mềm \n \n Thông tin chung  \n− Mã học phần  : CSC13010  \n− Tên tiếng Anh  : Software Design  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :  Nhập môn Công nghệ Phần mềm   \n Mô tả học phần  \nMôn học này nhằm cung cấp cho sinh viên các kiến thức nền tảng liên quan đến việc phân tích \nvà thiết kế phần mềm theo tiếp cận hướng  đối tượng. Sinh viên sẽ được giới thiệu phương pháp, \nkỹ thuật để xây dựng phần mềm theo hướng đối tượng, đặc biệt trong giai đoạn phân tích và \nthiết kế phần mềm. Tính tiến hóa và kiến trúc linh hoạt của phần mềm là nội dung quan trọng \ntrong môn học này.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Tham gia chủ động thảo luận nhóm (theo nhóm lớn của môn học); có khả năng phân \nchia công việc và phối hợp làm việc theo kế hoạch trong nhóm ở quy mô nhỏ (gồm 2 -\n3 sinh viên); ý thức được vai trò và trách nhiệm của thành viên trong nhóm  \n− Đọc hiểu các tài liệ u chuyên ngành bằng tiếng Anh trong việc phân tích và thiết kế phần \nmềm cũng như các công nghệ được sử dụng; giải thích được một số thuật ngữ tiếng \nAnh trong việc phân tích  và thiết kế phần mềm; trình bày (dạng báo cáo viết theo mẫu \nquy định) và thuyết tr ình về đề tài của nhóm.  \n− Có tư duy phản biện và cách suy nghĩ toàn diện khi phân tích và thiết kế phần mềm  \n− Trình bày và giải thích vai trò của phân tích và thiết kế phần mềm trong quy trình phát \ntriển phần mềm, một số hướng tiếp cận chính trong việc phân tí ch và thiết phần mềm   \n 187 − Vận dụng phương pháp phân tích hướng đối tượng và các nguyên tắc cơ bản trong phân \ntích để phân tích phần mềm ở quy mô nhỏ và vừa, hướng đến tính tiến hóa của phần \nmềm  \n− Vận dụng các phương pháp thiết kế theo hướng đối tượng và các nguyê n tắc cơ bản \ntrong phân thiết kế để thiết kế phần mềm ở quy mô nhỏ và vừa, hướng đến tính tiến hóa \ncủa phần mềm  \n− Bước đầu đánh giá được chất lượng của mô hình phân tích - thiết kế phần mềm và vận \ndụng một số mẫu thiết kế để cải tiến chất lượng của mô hình p hân tích - thiết kế  \n− Chọn lựa và sử dụng thành thạo một số công cụ và môi trường phần mềm hỗ trợ để \nphân tích và thiết kế được phần mềm ở quy mô nhỏ và vừa  \n Nội dung học phần   \n− Mở đầu  \n− Yêu cầu của người sử dụng  \n− Mô hình hóa yêu cầu  \n− Phân tích theo hướng đối tượn g \n− Thiết kế dữ liệu lưu trữ  \n− Kiến trúc phần mềm  \n− Thiết kế giao diện  \n− Một số vấn đề khác (mẫu thiết kế hướng đối tượng, tái tổ chức phần mềm, một số kỹ \nthuật bổ sung tính năng động cho chương trình)  \n Tài nguyên học phần  \nGiáo trình  \n− Ian Sommerville, Software Engin eering: (Update) (8th Edition), Addison Wesley, \n2006.  \nTài liệu tham khảo  \n− Software Engineering: A Practitioner's Approach, Roger S Pressman, Roger Pressman, \nMcGraw -Hill Science/Engineering/Math, 2004.  \n− Ian Sommerville, Software Engineering: (Update) (8th E dition), Addison Wesley, \n2006.   \n− Software Engineering - Object -Oriented System Development, Dennis de Champeaux, \nDouglas Lea, Penelope,  Faure, Addison Wesley, 1993.  \n− Software Architecture in Practice, 2nd edition, Len Bass, Paul Clements, Rick Kazman, \nAddison Wesley, 2003.  \n− Data Access Patterns: Database Interactions in Object -Oriented Applications, Clifton \nNock, Addison Wesley, 2003.  \n− Pattern -Oriented Analysis and Design: Composing Patterns to Design Software \nSystems, Sherif M. Yacoub, Hany H. Am mar, Addison Wesley, 2003.  \n− Enterprise Solution Patterns Using Microsoft .NET, Microsoft Corporation, Microsoft \nPress, 2003.  \n− Patterns of Enterprise Application Architecture, Martin Fowler, David Rice, Matthew \nFoemmel, Edward Hieatt, Robert Mee, Randy Staffo rd, Addison Wesley, 2002.  \n− Design Patterns Explained - A New Perspective on Object Oriented Design, Alan \nShalloway, James R. Trott, Addison Wesley, 2004.   \n 188 − Enterprise Integration Patterns: Designing, Building, and Deploying Messaging \nSolutions, Gregor Hohpe, Bobby Woolf, Addison Wesley, 2003.  \nCông cụ hỗ trợ  \n− Visual Studio .NET  \n− Eclipse/Netbean  \n− Mircosoft SQL  \n− Rational Rose, Visio, StarUML…  "
}