{
    "course_id": "CSC15004",
    "course_name": "Học thống kê",
    "course_start_page": 237,
    "course_end_page": 238,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC15004  – Học thống kê  \n \n Thông tin chung  \n− Mã học phần  : CSC15004  \n− Tên tiếng Anh  : Statistical Learning  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Toán rời rạc, Cấu trúc dữ liệu và giải thuật,  \n       Kĩ thuật lập trình    \n Mô tả học phần  \nMục tiêu của môn học này nhằm giới thiệu các phương pháp cơ bản trong mô hình máy học sử \ndụng kiến thức xác suất thống kê. Nội dung chính sẽ hướng dẫn sinh viên áp dụng các kiến \nthức xác suất thống kê trong việc tìm hiểu mô hình máy học như hồi quy tuyến tính, mạng \nneural, mô hình Markov và Markov ẩn, mô hình vector hổ trợ và mô hình câ y quyết định. Sinh \nviên sẽ tìm hiểu các mô hình học trên, cài đặt và áp dụng các mô hình học để giải quyết các bài \ntoán đơn giản trong nhận dạng và phân tích dữ liệu. Ngôn ngữ lập trình không bắt buộc nhưng \nsinh viên cần rèn luyện kỹ năng lập trình để xây dựng chương trình demo, kỹ năng phân tích \nkết quả thu được, kỹ năng thu thập và chuẩn hóa dữ liệu.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Vận dụng được các kỹ năng đọc tài liệu, viết báo cáo và trình bày.  \n− Hiểu rõ các khái niệm thống kê và máy học trong phân tích dữ liệu.  \n− Sử dụng được các mô hình thống kê (hồi quy đa trị/đơn trị) cho mục đích phân tích dữ \nliệu. \n− Sử dụng được các mô hình máy học (Mạng Neural, Markov ẩn, Vector hỗ trợ, cây quyết \nđịnh) cho mục đích mô hình hóa dữ liệ u. \n− Giải quyết được các bài toán phân tích dữ liệu cụ thể   \n 238 \n Nội dung học phần   \n− Giới thiệu máy học  \n− Ôn tập thống kê  \n− Mô hình cây quyết định  \n− Hồi quy đơn  \n− Hồi quy bội  \n− Phương pháp rút gọn số chiều dữ liệu  \n− Mô hình Markov ẩn  \n− Mô hình máy học Vector hỗ trợ  \n− Mô hình mạng Nơ -ron \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \n− Pattern Recognition and Machine Learning, CHRIS BISHOP, Springer, UK, 2006  \nTài liệu tham khảo  \n− Pattern Classification, Second Edition, RICHARD O. DUDA, PETER E. HART, \nDAVID G. STORK, Wiley Interscience, USA , 2001.  \n− Machine Learning, TOM MITCHELL, McGraw Hill, USA, 1997.  \nCông cụ hỗ trợ  \n− Matlab  "
}