{
    "course_id": "CSC12110",
    "course_name": "Phân tích dữ liệu ứng dụng",
    "course_start_page": 168,
    "course_end_page": 170,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC12110  – Phân tích d ữ liệu ứng dụng \n \n Thông tin chung  \n− Mã học phần  : CSC12110  \n− Tên tiếng Anh  : Applied Data Analytics  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Cơ sở dữ liệu   \n Mô tả học phần  \nMôn học này bao gồm các khái niệm cơ bản về phân tích dữ liệu, đến thiết kế kho dữ liệu và \ncác nguyên tắc trực quan hóa dữ liệu. Môn học sẽ cung cấp hiểu biết về các khái niệm chính \nvà cách biến đổi dữ liệu thành giá trị, cung cấp một số kỹ năng thực hành liên quan đến phân \ntích dữ liệu.  \nMôn học giúp sinh viên hiểu được một hệ sinh thái dữ liệu và các thành phần trong đó, cũng \nnhư các nguyên tắc cơ bản của phân tích dữ liệu như thu thập dữ liệu hoặc khai thác dữ liệu. \nSinh viên cũng được rèn luyện các kỹ n ăng kỹ thuật và kỹ năng mềm cần thiết để truyền đạt \nhiệu quả dữ liệu của bạn cho các bên liên quan và thành thạo các kỹ năng này có thể cung cấp \ncho sinh viên lựa chọn trở thành người ra quyết định theo hướng dữ liệu, thông qua việc  khám \nphá các nền tảng Dữ liệu lớn như Hadoop, Hive và Spark. Môn học cũng giúp sinh viên khám \nphá các nguyên tắc cơ bản của việc thu thập dữ liệu và xác định các nguồn dữ liệu, làm sạch, \nphân tích và chia sẻ dữ liệu của mình bằng cách sử dụng các công cụ trực quan hóa và trang \ntổng quan.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để trình bày một số báo cáo kỹ thuật theo \nmẫu cho trước liên quan đến môn học phân tích dữ liệu   \n 169 − Biết và giải thích được các thuật ngữ tiếng Anh liên quan đến phân tích dữ liệu  \n− Giải thích được các khái niệm cơ bản, thuật ngữ, trách nhiệm, công việc và nguyên tắc \nđạo đức cơ bản... liên quan đến phân tích dữ liệu  \n− Hiểu được các loại phân tích dữ liệu khác nhau và các bước chính trong tiến tr ình phân \ntích dữ liệu, vai trò và trách nhiệm liên quan  \n− Hiểu các hệ sinh thái dữ liệu và triển khai ở mức độ cơ bản, các kiểu khác nhau của cấu \ntúc dữ liệu, định dạng dữ liệu, nguồn dữ liệu và ngôn ngữ xử lý dữ liệu.  \n− Hiểu và triển khai các kỹ thuật, công c ụ xác định, thu thập dữ liệu, làm sạch và xử lý \ndư liệu  \n− Hiểu vai công cụ và kỹ thuật phân tích thống kê khác nhau, trực quan hóa dữ liệu  \n Nội dung học phần   \n− Giới thiệu về phân tích dữ liệu, vai trò và trách nhiệm phân tích viên, ứng dụng phân \ntích dữ liệu  \n− Giới thiệu hệ sinh thái dữ liệu  \n− Các cấu trúc dữ liệu, định dạng dữ liệu, lưu trữ dữ liệu  \n− Kỹ thuật liên quan Data Marts, Data Lakes, ETL, và Data Pipelines  \n− Sửa bài tập liên quan Data Marts, Data Lakes, ETL, và Data Pipelines  \n− Giới thiệu về dữ liệu lớn, sử dụ ng  mức cơ bản một số công cụ xử lý dữ liệu lớn  \n− Trải nghiệm giai đoạn giai đoạn thu thập, nhập dữ liệu  \n− Kỹ thuật làm sạch dữ liệu  \n− Phân tích thống kê, khai thác dữ liệu, công cụ khai thác dữ liệu, giao tiếp và chia sẽ dữ \nliệu phân tích  \n− Phân tích thống kê, kh ai thác dữ liệu, công cụ khai thác dữ liệu, giao tiếp và chia sẽ dữ \nliệu phân tích (tiếp)  \n− Trực quan hóa dữ liệu và triển khai một số công cụ phân tích dữ liệu  \n− Ôn tập/ seminar  \n Tài nguyên học phần  \nGiáo trình  \n− Data Analytics for Absolute Beginners: A Deconstructed Guide to Data Literacy: \n(Introduction to Data, Data Visualization, Business Intelligence & Machine Learning),  \nOliver Theobald .  \n− DATA ANALYTICS: A Comprehensive Beginner’s Guide To Learn About The \nRealms Of Data Analytics From A -Z, Benjamin S mith.  \n− SQL for Data Analytics: Perform fast and efficient data analysis with the power of SQL. \nUpom Malik, Matt Goldwasser, Benjamin Johnston.  \n− DATA ANALYTICS: A Comprehensive Beginner’s Guide to Learn the Realms of \nData Analytics. Liam Damien.  \n− Link website  tham khảo bài học: https://www.coursera.org/learn/introduction -to-data-\nanalytics#syllabus  \n− Link website tham khảo bài học: https://app.pluralsight.com/library/courses/data -\nanalytics -hands -on/table -of-contents  \nTài liệu tham khảo  \nCông cụ hỗ trợ   \n 170 − Microsoft Ex cel \n− Moodle  \n− Zoom (SV cần dùng email sinh viên để kích hoạt tài khoản và tham gia lớp học)  \n− Google doc, slides, sites… (định danh tài khoản bằng MSSV)  \n− Các công cụ chuyên phân tích dữ liệu  "
}