{
    "course_id": "CSC10006",
    "course_name": "Cơ sở dữ liệu",
    "course_start_page": 86,
    "course_end_page": 87,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC10006  – Cơ s ở dữ liệu \n \n Thông tin chung  \n− Mã học phần:  CSC10006  \n− Tên tiếng Anh: Introduction to Databases  \n− Khối kiến thức: Bắt buộc  – Cơ sở ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :  Data structures and Algorithms  \n Mô tả học phần  \nThe course introduces the overview of the needs o f databases in enterprises or organizations. \nThe course provide the study of data models including entity relationship model (or ER model), \nrelational database model and the examination of practical issues such as database design, \nsetup, and manipulation. For database manipulation, the course guides how to use database \nlanguages such as relational algebra, relational calculus and structured query language (SQL). \nThe course also provides concepts of functional dependency, normal forms of database \nschemes as well as the way to normalize a database scheme. Other cructial topics include \nintegrity constraints and the enforcements all of them. Moreover, the techniques, tools and \nskills are provided for students to declare and manipulate the database via a relation al database \nmanagement system. The course also mentions future trends in database systems research. The \ncourse mentions the way to get the data managed by a selected database management system.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Work independently or in group to solve issues in database systems  \n− Practice English reading comprehension skills to read textbooks and other documents \nrelated to database systems  \n− Explain basic concepts and characteristics of the database and database  systems   \n 87 − Apply the Entity -Relationship Model and Relational Data Model for data modeling  \n− Use database languages to manipulate the databases  \n− Evaluate the quality of a given database scheme and practice the methods to normalize \na database scheme  \n− Describe and  enforce integrity constraints in a database  \n− Describe the future trends in database systems research  \n− Setup and manipulate the database using a relational database management system  \n Nội dung học phần   \n− An overview of database systems  \n− Entity relationship mod el \n− Relational data model  \n− Relational algebra  \n− Structured Query Language (SQL)  \n− Relational Calculus  \n− Functional dependency and Normal forms  \n− Integrity constraints  \n− Review  \n Tài nguyên học phần  \nGiáo trình  \n− Fundamentals of Database Systems (7th Edition), Ramez Elmasri, Shamkant B.  \n− Navathe, Addison Wesley, 2017.  \nTài liệu tham khảo  \n− Database Systems: The Complete Book (2nd Edition), Hector Garcia -Molina,  \n− Jeffrey D. Ullman, Jennifer Widom, Prentice Hall, 2008.  \nCông cụ hỗ trợ  \n− MS-SQL Server (or PostgreSQL)  "
}