{
    "course_id": "CSC13103",
    "course_name": "Công nghệ Java cho hệ thống phân tán",
    "course_start_page": 201,
    "course_end_page": 202,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC13103  – Công ngh ệ Java cho h ệ thống phân tán  \n \n Thông tin chung  \n− Mã học phần:  CSC13103  \n− Tên tiếng Anh: Development of Distributed Systems with Java  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Lập Trình Ứng Dụng Java    \n Mô tả học phần  \nMôn học này cung cấp cho sinh viên các kiến thức về các công nghệ Java cần thiết để xây dựng \nhệ thống web bao gồm: servlet, jsp, hibernate, mvc 2, spring framework. Ngoài ra sinh viên \ncòn được giới thiệu các công nghệ Java khác liên quan như jsf, tapestry, struts 2, maven,…. \nMôn học cũng giúp sinh viên có những trải nghiệm thực tế về quá trình xây dựng một ứng dụng \nweb hoàn chỉnh bằng cách kết hợp các công nghệ Java một các h có hệ thống và có phương \npháp.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để trình bày đồ án môn học.  \n− Biết được các thuật ngữ tiếng Anh của các công nghệ Java trong môn học.  \n− Hiểu và vận dụng được công nghệ Servlet, JSP  \n− Hiểu và vận dụng được công nghệ Hibernate  \n− Hiểu và vận dụng được kiến trúc MVC 2  \n− Hiểu và vận dụng được Spring Framework  \n− Tổng hợp các công nghệ vào trong đồ án môn học.  \n− Sử dụng các công cụ phần mềm hỗ trợ  \n Nội dun g học phần    \n 202 − Công nghệ Servlet  \n− Công nghệ JSP  \n− Hibernate  \n− Kiến trúc MVC 2  \n− Spring Framework  \n− Đồ án môn học  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− Joel Murach, Michael Urban. (2014). Murach's Java Servlets and JSP, 3rd Edition. \nMike Murach & Associates.  \n− Madhusudhan Konda. (2014). Just Hibernate, 1st Edition. O'Reilly Media.  \n− Nicholas S. Williams. (2014. Professional Java for Web Applications, 1st Edition. \nWrox.  \n− Gary Mak, Daniel Rubio , Josh Long. (2010). Spring Recipes: A Problem -Solution \nAppro ach, 2nd Edition. Apress.  \nCông cụ hỗ trợ  \n− Eclipse IDE for Java EE Developers  \n− PostgreSQL  "
}