{
    "course_id": "CSC14112",
    "course_name": "Sinh trắc học",
    "course_start_page": 225,
    "course_end_page": 226,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC14112  – Sinh tr ắc học \n \n Thông tin chung  \n− Mã học phần  : CSC14112  \n− Tên tiếng Anh  : Biometrics  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Nhận dạng   \n Mô tả học phần  \nMôn học này nhằm cung cấp cho sinh viên những lý thuyết về Sinh trắc học: khái niệm, áp \ndụng, nhiệm vụ của Sinh trắc học trong các lĩnh vực thực tế khác nhau. Môn học giúp sinh viên \nnắm được các phương pháp xác định danh tính của người dựa trên các đặc điểm sinh trắc của \nngười đó ( đặc điểm giải phẫu, đặc điểm hóa học hay đặc điểm về hành vi ứng với từng người).  \nMôn học cũng phân tích ưu, nhược điểm của từng loại sinh trắc học để có thể chọn các đặc \nđiểm sinh trắc phù hợp áp dụng trong các hệ thống định danh thực tế. Môn học còn cun g cấp \ncác thuật toán sử dụng một số đặc điểm sinh trắc bộ phận cơ thể con người cho việc định danh \nđối tượng: Sinh trắc vân tay, sinh trắc khuôn mặt, sinh trắc tròng mắt, cũng như các thuật toán \nsử dụng một số đặc điểm sinh trắc hành vi con người: Sinh trắ c chữ ký, sinh trắc gõ bàn phím. \nMôn học cũng giúp sinh viên có thể tự cài đặt các thuật toán hoặc sử dụng phần mềm mã nguồn \nmở cho một hệ thống sinh trắc học đơn giản.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và  cộng tác nhóm để trình bày một số báo cáo kỹ thuật \ntrong lĩnh vực sinh trắc học  \n− Biết và giải thích được các thuật ngữ tiếng Anh thuộc chuyên ngành Sinh trắc học, đọc \nđược các bài báo khoa học tiếng Anh   \n 226 − Giải thích được các khái niệm cơ bản, thuật ngữ, trác h nhiệm, công việc và phân tích \nđược bài toán... thuộc lĩnh vực Sinh trắc học  \n− Hiểu  và vận dụng về Sinh trắc học  \n− Biết thiết kế hệ thống định danh sinh trắc học  \n− Hiểu và vận dụng thuật toán sử dụng một số đặc điểm sinh trắc bộ phận cơ thể con \nngười và hành vi con người cho việc định danh đối tượng  \n− Biết cài đặt một hệ thống sinh trắc học đơn giản dựa vào mã nguồn mở  \n Nội dung học phần   \n− Giới thiệu hệ thống nhận dạng sinh trắc học  \n− Sinh trắc bộ phận cơ thể: Sinh trắc mặt người  \n− Phân tích hệ thống sinh trắc mặt người trong thực tế  \n− Sinh trắc bộ phận cơ thể: Sinh trắc vân tay  \n− Tìm hiểu các ứng dụng của hệ thống nhận dạng mẫu vân tay  ngoài thực tế  \n− Sinh trắc bộ phận cơ thể: Sinh trắc tròng mắt  \n− Thực nghiệm xây dựng phần mềm cho bài toán chứng thực mắt người trên cơ sở  dữ \nliệu CASIA  \n− Sinh trắc hành vi: Sinh trắc chữ ký  \n− Sinh trắc hành vi: Sinh trắc Kiểu gõ bàn phím  \n− Các hệ thống đa sinh trắc học  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− Pattern Classification 2nd Edition, Richard O. Duda, Peter E. Hart, and David G. Stork \nWiley, 2004.  \n− Hanbook of Biometrics, Anil K. Jain, Patrick Flynn, and Arun A. Ross, Springer, 2008.  \n− Hanbook of Face recognition, Stan Z. Li and Anil K. Jain, Springer, 2005.  \n− Hanbook of Fingerprintf recognition, Davide Maltoni, Dario  Maio, Anil K. Jain, and \nSalil Prabhakar, Springer, 2003.  \nCông cụ hỗ trợ  \n− Visual Studio .NET  \n− Mircosoft SQL, 2008  \n− Visio Axure  "
}