{
    "course_id": "CSC16104",
    "course_name": "Thị giác robot",
    "course_start_page": 259,
    "course_end_page": 260,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC16104  – Thị giác robot  \n \n Thông tin chung  \n− Mã học phần  : CSC16104  \n− Tên tiếng Anh  : Robot Vision  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Xác suất thống kê, Kỹ thuật lập trình,  \n      Cấu trúc dữ liệu và giải thuật    \n Mô tả học phần  \nMôn học này cung cấp cho sinh viên hướng tiếp cận xác suất cho bài toán định tuyến robot tự \nhành di chuyển trong môi trường động. Môn học bắt đầu với với các ưu điểm của hướng tiếp \ncận xác suất so với các hướng tiếp truyền thống, khái niệm phân bố độ tin cậy trạng thái của  \nrobot tự hành di chuyển trong môi trường động, giả định Markov, lọc Bayes. Các nền tảng này \nđưa đến việc xây dựng các mô hình xác suất cho chuyển động, xử lý tín hiệu từ cảm biến, ước \nlượng phân bố tin cậy. Đây là công cụ phục vụ nhóm các bài toán định vị , định tuyến robot \ntrong môi trường hữu đồ và phi đồ. Môn học cũng tạo môi trường để sinh viên vận dụng các \nkiến thức về xác suất, thuật toán, kỹ năng lập trình và hiện thực hóa đề xuất trong việc giải \nquyết vấn đề thỏa hiệp độ chính xác – tốc độ trên thiế t bị phản ứng thời gian thực.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để giải quyết các vấn đề liên quan môn \nhọc \n− Hiểu và có thể giải thích lại một cách mạch lạc các thuật ngữ tiếng Anh thuộc chu yên \nngành liên quan môn học  \n− Giải thích một cách chính xác và đầy đủ các khái niệm cơ bản, các mô hình xác suát và \ncác thuật toán liên quan môn học   \n 260 − Xác định và phân loại các bài toán và giải pháp khác nhau  \n− Thiết kế và cài đặt hệ thống phần mềm hiện thực hóa  các thuật toán liên quan đến môn \nhọc \n− Sử dụng các công cụ phần mềm hỗ trợ  \n Nội dung học phần   \n− Giới thiệu môn học  \n− Ôn tập xác suất  \n− Tiếp cận xác suất trong các bài toán liên quan robot tự hành  \n− Mô hình chuyển động  \n− Mô hình cảm biến  \n− Các thuật toán lọc  \n− Theo vết robot tự hành trong môi trường hữu đồ  \n− Định vị robot tự hành trong môi trường hữu đồ  \n− Song song định tuyến, định đồ robot tự hành trong môi trường phi đồ  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \n− Probabilistic Robotics, Sebastian Thrun, Wolfram Burgard, and Diet er Fox.  \nTài liệu tham khảo  \n− MRPT, http://www.mrpt.org/  \nCông cụ hỗ trợ  \n− Visual Studio  \n− Open Office  "
}