{
    "course_id": "CSC13115",
    "course_name": "Các công nghệ mới trong phát triển phần mềm",
    "course_start_page": 282,
    "course_end_page": 284,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC13115  - Các công ngh ệ mới trong phát tri ển ph ần mềm \n \n Thông tin chung  \n− Mã học phần  : CSC13115  \n− Tên tiếng Anh  : Modern Software Development Technologies  \n− Khối kiến thức: Tự chọn  - Kiến thức tốt nghiệp  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Phát tri ển ứng dụng web   \n Mô tả học phần  \nMôn học này nhằm đáp ứng nhu cầu áp dụng các công nghệ mới, hiện đại như blockchain, AI \nservices, điện toán đám mây, trong các hệ thống phần mềm ngày càng tăng. Sinh viên tốt nghiệp \nchuyên ngành Kỹ thuật phần mềm cần có các kiến thức cơ bản về các công nghệ hiện đại, khả \nnăng tiếp cận được các xu thế công nghệ mới, khả năng ngh iên cứu chuyên sâu, nhằm đáp ứng \ncác nhu cầu thực tế của xã hội, cũng như đặt nền tảng để tiếp tục nghiên cứu các lĩnh vực đặc \nthù. \nMôn học Các công nghệ mới trong phát triển phần mềm giới thiệu cho sinh viên những xu \nhướng công nghệ mới trong việc phát tr iển phần mềm, cung cấp cho sinh viên các kiến thức \nnền tảng, các trải nghiệm trong việc xây dựng, mở rộng các phần mềm bằng cách áp dụng các \ncông nghệ hiện đại.  \nCác chủ đề trọng tâm của môn học bao gồm việc xây dựng hệ thống blockchain, xây dựng \nchatbot bằ ng cách áp dụng các dịch vụ AI, xử lý các sự kiện theo thời gian thực, cài đặt và cấu \nhình các hệ thống hạ tầng đám mây, tương tác với hệ thống thông qua thực tại tăng cường.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc được ở mức độ  cá nhân và cộng tác nhóm để thực hiện các đồ án áp dụng các \ncông nghệ mới trong phát triển phần mềm.   \n 283 − Giải thích được các thuật ngữ tiếng Anh về các xu hướng công nghệ mới trong việc \nphát triển phần mềm.  \n− Giải thích được các khái niệm cơ bản, thuật ngữ, trư ờng hợp áp dụng các xu hướng \ncông nghệ mới trong việc phát triển phần mềm.  \n− Áp dụng được các công nghệ mới để phát triển một sản phẩm phần mềm.  \n− Sử dụng được các công cụ phần mềm hỗ trợ áp dụng các công nghệ mới.  \n Nội dung học phần   \n− Giới thiệu & tổng quan về các công nghệ mới trong phát triển phần mềm  \n− Tổng quan về Blockchain  \n− Thiết kế và cài đặt Blockchain: Blocks, Chain, Blockchain Network, Proof of Work  \n− Wallets và Transactions trong Blockchain  \n− Transaction Pool, Mine Transactions  \n− Các chủ đề khác :  \n• Smart Contract, Ethereum  \n• Các trường hợp thực tế sử dụng Blockchain  \n− Phát triển ứng dụng thông minh  \n• Cách xây dựng ứng dụng thông minh dựa trên Azure Machine Learning Web \nServices  \n• Cách sử dụng Azure Machine Learning APIs  \n− Phát triển ứng dụn g thông minh  \n• Cách xây dựng autonomous \"bots\"  \n− Phát triển hệ thống thông minh  \n• Cách xử lý sự kiện Realtime áp dụng cho trường hợp IOT/BigData  \n− Tổng quan về điện toán đám mây  \n− Các mô hình dịch vụ  \n• Infrastructure as a service (IaaS)  \n• Platform as a service (PaaS)  \n• Software as a service (SaaS)  \n• Mobile \"backend\" as a service (MBaaS)  \n• Serverless computing  \n• Function as a service (FaaS)  \n− Các mô hình triển khai  \n• Private cloud  \n• Public cloud  \n• Hybrid cloud  \n− Các dịch vụ đám mây tiêu biểu  \n• Amazon Web Service  \n• Microsoft Azure  \n• Google Cloud Platform  \n− AR Technology  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo   \n 284 − Andreas M. Antonopoulos.(2017). Mastering Bitcoin.  \n− Imran Bashir .(2018). Mastering Blockchain.  \n− Tutorial for building a cryptocurrency, https://lhartikk.github.io/  \n− Developing intelligent apps and bots,  \nhttps://www.my -mooc.com/en/mooc/developing -intelligent -apps-bots-microsoft -dat211x -\n2/  \nCông cụ hỗ trợ  \n− Visual Studio .NET  \n− Mircosoft SQL  \n− Node.js  \n− Azure Services  \n− Unity  \n− Unreal  "
}