{
    "course_id": "CSC12103",
    "course_name": "Chuyên đề Hệ quản trị cơ sở dữ liệu nâng cao",
    "course_start_page": 157,
    "course_end_page": 159,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC12103  – Chuyên đ ề Hệ quản trị cơ sở dữ liệu nâng cao  \n \n Thông tin chung  \n− Mã học phần  : CSC12103  \n− Tên tiếng Anh  : Advanced Topics in Database Management Systems  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Hệ quản t rị Cơ sở dữ liệu    \n Mô tả học phần  \nMôn học này được thiết kế nhằm giúp sinh vi ên (SV) hi ểu nguy ên lý hoạt động của các thành \nphần trong m ột Hệ Quản trị Cơ sở Dữ liệu (HQT CSDL) th ương m ại cụ thể, từ đó có cái nhìn \nso sánh đối chiếu giữa thực tế với những kỹ thuật lý thuyết tương ứng (đ ã học trong h ọc phần \nHệ quản trị Cơ sở Dữ liệu) \nSV c ó kiến thức nền tảng để sử dụng được một HQT CSDL th ương m ại cụ thể khi đ ảm trách \nnhiệm vụ của người quản trị cơ sở dữ liệu. \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Sử dụng kh ả năng cộng tác nhóm và trình bày lại các vấn đề liên quan đ ến CSDL  \n− Sử dụng kỹ năng đọc tài liệu kỹ thuật về CSDL b ằng tiếng Anh  \n− Mô tả và cấu hình được các thành ph ần kiến trúc của một HQT CSDL th ương m ại cụ \nthể. \n− Định ngh ĩa và cấu hình được các thành ph ần trong t ổ chức lưu trữ dữ liệu của một HQT \nCSDL th ương m ại cụ thể. \n− Xây dựng được các giao t ác hoàn chỉnh trên một HQT CSDL th ương m ại cụ thể. \n− Áp dụng được các kỹ thuật khôi phục dữ liệu sau s ự cố trên một HQT CSDL th ương \nmại cụ thể. \n− Cài đặt được các ràng bu ộc dữ liệu trên một HQT CSDL th ương m ại cụ thể.  \n 158 − Áp dụng được các kỹ thuật quản lý người dùng tr ên một HQT CSDL th ương m ại cụ \nthể. \n− Áp dụng được các kỹ thuật CSDL ph ân tán trên một HQT CSDL th ương m ại cụ thể. \n Nội dung học phần   \n− Kiến trúc của một HQT CSDL  \n• Cài đặt một HQT CSDL  \n• Xây dựng cấu trúc CSDL  \n• Kiến trúc của một HQT CSDL  \n• Các thao t ác trên Instance v à các file tham s ố \n• Các thao t ác trên Database v à các file đi ều khi ển \n− Tổ chức lưu trữ DL trong HQT CSDL  \n• Tổ chức lưu trữ luận lý \n• Tổ chức lưu trữ vật lý \n• Cấu hình th ành ph ần lưu trữ luận lý cấp cao  \n• Cấu hình th ành ph ần lưu trữ luận lý cấp thấp \n• Cấu hình các thành ph ần lưu trữ vật lý \n• Quản lý phân cụm (Cluster ) \n− Quản lý giao t ác \n• Sử dụng ki ểu DL c ơ sở \n• Sử dụng bi ến \n• Sử dụng cấu trúc điều khi ển \n• Sử dụng ki ểu DL t ập hợp \n• Cài đặt giao t ác bằng ch ương trình con  \n• Sử dụng ki ểu DL m ở rộng \n• Khai th ác các hàm tiện ích dựng sẵn để cài đặt giao t ác \n• Quản lý lỗi trong th ân giao t ác \n• Đóng gói chương trình con  \n• Điều khi ển truy xu ất đồng th ời \n− An to àn dữ liệu \n• Tổng quan v ề vấn đề An to àn DL  \n• Công cụ sao lưu và phục hồi DL m à HQT CSDL cung c ấp \n• CSDL nhi ều phi ên bản \n• Nhật ký giao tác phục vụ \n− Redo -logging  \n• Nhât ký giao t ác phục vụ Undo -logging  \n• Sao l ưu và phục hồi CSDL b ằng m ã lệnh \n• Phục hồi CSDL b ằng các phi ên bản và lập lịch trình hệ thống \n• Quản lý các nhật ký và điểm kiểm tra  \n− Ràng bu ộc dữ liệu \n• Ràng bu ộc khóa chính \n• Ràng bu ộc khóa ngo ại \n• Ràng bu ộc duy nh ất \n• Ràng bu ộc kiểm tra  \n• Ràng bu ộc giá trị mặc định \n• Ràng bu ộc not null  \n• Trạng th ái và chế độ của ràng bu ộc dữ liệu  \n 159 • Database Trigg er \n− An ninh D ữ liệu \n• Người dùng \n• Quyền hệ thống \n• Quyền đối tượng \n• Chức danh  \n• Những ch ức danh v à những quy ền định ngh ĩa sẵn \n• Phân quy ền người dùng m ức dòng DL  \n• Theo d õi hành vi ng ười dùng \n− CSDL ph ân tán \n• CSDL nh ân bản \n• CSDL  phân mảnh \n Tài nguyên học phần  \nGiáo  trình  \nTài liệu tham khảo  \n− TÀI NG5. Oracle Enterprise Manager Concepts, Jacqueline G5  \n− Oracle Database Advanced Security Administrator’s guide, Laurel P.Hale, Oracle \nCorporation 2003  \n− PL/SQL User guide and Reference, Tom Portfolio, Oracle Corporation 1999  \n− Oracle Database Backup and Recovery basics, Antonio Romero, Oracle Corporation \n2005  \n− Oracle Database Backup and Recovery Advanced User’s G5  \n− Oracle Database Advanced Replication, Randy Urbano, Oracle Corporation 2003  \n− Oracle Database Advanced Replication Manag ement API Reference, Randy Urbano, \nOracle Corporation 2007  \n− Oracle Database Net Services Administrator’s G5. Oracle Database Security  \nCông cụ hỗ trợ  "
}