{
    "course_id": "CSC16107",
    "course_name": "Ứng dụng thị giác máy tính",
    "course_start_page": 263,
    "course_end_page": 264,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC16107  – Ứng d ụng th ị giác máy tính  \n \n Thông tin chung  \n− Mã học phần  : CSC16107  \n− Tên tiếng Anh  : Applications of Computer Vision  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nDữ liệu hình ảnh và video đ óng vai tr ò ngày càng quan tr ọng trong đ ời sống con ng ười. Hình \nảnh và video đ ược số hóa với chất lượng và số lượng ng ày càng tăng. B ạn có bao gi ờ tự hỏi \nlàm thế nào có thể khai th ác ảnh số hóa để đạt được các ứng dụng hữu ích trong cu ộc sống nh ư \nchuẩn đoán ảnh y khoa, ph át hiện lỗi trên thiết bị điện vi, h ồi phục ảnh, c ác công cụ tìm kiếm \ncó thể lập chỉ mục hàng tỷ hình ảnh và video, robot c ó thể điều hướng kh ông gian v à thực hiện \nnhiệm vụ? Trong m ôn học này, sinh vi ên sẽ khám ph á tất cả các công ngh ệ và cách tạo ra sản \nphẩm công nghi ệp thương m ại hoá trong th ực tiễn. Nằm ở trung t âm của các ứng dụng AI (tr í \ntuệ nhân tạo) hiện đại, các công ngh ệ TGMT c ó thể nhận thức, hiểu và tái cấu trúc thế giới thị \ngiác phức tạp. TGMT l à một trong nh ững m ôn học phát triển nhanh nh ất và thú vị nhất trong \nngành học thu ật và công nghi ệp hiện nay. M ôn học được thiết kế để mở ra cánh cửa cho nh ững \nsinh vi ên mu ốn tìm hiểu về các nguy ên tắc cơ bản và các ứng dụng quan tr ọng của TGMT. \nQuan tr ọng hơn, môn học sẽ hướng dẫn sinh vi ên thông qua m ột loạt dự án liên quan th ực tế \nđể sinh vi ên có kiến thức trong vi ệc ứng dụng các thu ật toán TGMT ti ên tiến trong l ĩnh lực \ncông nghi ệp. \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:   \n 264 − Làm vi ệc ở mức độ cá nhân và cộng tác nhóm để trình bày một số báo cáo kỹ thuật \ntrong l ĩnh vực thị giác máy tính. \n− Diễn dịch và giải thích được các thu ật ngữ tiếng Anh thu ộc chuy ên ngành Th ị Giác \nMáy Tính. \n− Sử dụng tư duy ph ân tích logic đ ể đọc hiểu bài báo khoa h ọc và viết chương trình \n− Biết cách kh ởi đầu hoạt động ngh ề nghiệp thông qua đ ồ án môn học, gợi ý tưởng về \ncác sản phẩm trong t ương lai  \n− Xây dựng sản phẩm ph ần mềm ứng dụng th ị giác máy tính đáp ứng m ột số yêu cầu cho \ntrước. \n− Sử dụng các công cụ mã nguồn mở để xây dựng hệ thống. \n Nội dung học phần   \n− Thu th ập và tổ chức dữ liệu ảnh và video  \n− Bài toán đối sánh m ẫu \n− Bài toán phân đoạn ảnh \n− Mô tả đồ án và các công cụ hổ trợ \n− Bài toán ảnh stereo  \n− Quiz 01  \n− Mô hình CNN  \n− Quiz 02  \n− Mô hình GAN  \n− Quiz 03  \n− Bài toán nhận dạng hành động \n− Bài toán nhận dạng hoạt động \n− Bài giảng th ực tế từ doanh nghi ệp \n− Seminar  \n− Bài thu ho ạch \n− Trường Makov ng ẫu nhi ên và ứng dụng trong TGMT  \n Tài nguyên học phần  \nGiáo trình  \n− Computer Vision: Algorithms and Applications, Richard Szeliski, Springer; 2011.  \nTài liệu tham khảo  \n− Computer Vision: A Modern Approach, Second Edition, David A. Forsyth, Jean Ponce, \nPrentice Hall International Inc, 2011.  \nCông cụ hỗ trợ  \n− OpenCV  \n− OpenFramework  \n− Visual Studio C++  \n− Anaconda for Python https://www.udacity.com/course/computer -vision -nanodegree --\nnd891  "
}