{
    "course_id": "CSC12005",
    "course_name": "Phát triển ứng dụng hệ thống thông tin hiện đại",
    "course_start_page": 151,
    "course_end_page": 152,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC12005  - Phát tri ển ứng d ụng h ệ thống thông tin hi ện đại \n \n Thông tin chung  \n− Mã học phần  : CSC12005  \n− Tên tiếng Anh  : Modern Information Systems Development  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nHọc phần tập trung vào các vấn đề và kỹ thuật liên quan đến việc phát triển các ứng dụng hệ \nthống thông tin (HTTT) trong bối cảnh và môi trường công nghệ hiện nay. Hai chủ đề chính \nđược quan tâm trong học phần này: kiến tthức phát triển ứng dụng HTTT và kiến thức nâng \ncao trong phát triển HTTT. Đối với chủ đề liên quan đến kiến thức phát triển ứng dụng HTTT, \nhọc phần trang bị cho sinh kiến thức xây dựng hoàn chỉnh một ứng dụng hệ thống thông tin \nthông qua các kịch bản minh họa cho các pha phát triển ứng dụng HTTT, bao gồm: xác định \nyêu cầu người dùng, phân tích thiế t kế hệ thống, lập trình thử nghiệm. Trong chủ đề về kiến \nthức nâng cao trong phát triển ứng dụng HTTT, sinh viên được trình bày về các chủ đề nâng \ncao về phát triển ứng dụng HTTT hiện nay ví dụ như: hệ thống thông tin di động, các dạng lưu \ntrữ dữ liệu khá c (CSDL NoSQL), …  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Phân tích sử dụng các kỹ thuật hoạt động nhóm để thảo luận và trình bày các vấn đề \nliên quan đến phát triển ứng dụng HTTT.  \n− Phân tích, tổng hợp và đọc tài liệu tiếng Anh liên quan đến các vấn đề trong phát triển \nứng dụng HTTT.  \n− Phân tích, thẩm định suy nghĩ có phê phán, sáng tạo trong công việc phát triển ứng \ndụng HTTT.   \n 152 − Vận dụng được các kiến thức nền tảng phục vụ cho các giai đoạn phát triển ứng dụng \nHTTT (bao gồm: xác định yêu cầu  người dung, các mô hình biểu diễn kết quả khảo sát \nyêu cầu người dùng, kết quả phân tích thiết kế hệ thống ở các mức) và các công nghệ \nlập trình liên quan để cài đặt các chức năng của ứng dụng HTTT.  \n− Liệt kê được một số  chủ đề nâng cao trong phát triển ứn g dụng HTTT hiện nay.  \n Nội dung học phần   \n− Tầm quan trọng của việc phát triển ứng dụng HTTT hiện nay.  \n− Vận dụng kỹ thuật xác định yêu cầu để xác định yêu cầu người dùng  \n− Phân tích yêu cầu người dùng, xác định phạm vi hệ thống  \n− Phát hiện những điểm còn tồn đọng trong hệ thống và đề xuất hướng phát triển.  \n− Mô hình hóa nghiệp vụ của HTTT: mô hình hóa xử lý cho hệ thống  \n− Mô hình hóa nghiệp vụ của HTTT: mô hình hóa dữ liệu cho hệ thống.  \n− Thiết kế hệ thống: thiết kế dữ liệu cho hệ thống  \n− Thiết kế hệ thống: thiết kế giao d iện cho hệ thống  \n− Thiết kế chức năng phần mềm cho ứng dụng HTTT.  \n− Thiết kế chức năng phần mềm theo mô hình 3 lớp.  \n− Các công nghệ phục vụ lập trình phát triển ứng dụng.  \n− Phần mềm quản lý phiên bản  \n− Báo cáo cài đặt chức năng phần mềm tiêu biểu cho ứng dụng HTTT.  \n− Chủ đề HTTT trong kinh doanh toàn cầu  \n− Chủ đề Cơ sở hạ tầng và các môi trường phát triển HTTT hiện nay.  \n− Chủ đề các ứng dụng HTTT chủ chốt trong thời đại số.  \n− Chủ đề phát triển ứng dụng HTTT trong môi trường di động  \n− Chủ đề một số loại CSDL khác CSDL qua n hệ hiện nay (NoSQL, CSDL địa lý)  \n− Tổng kết phần mềm ứng dụng HTTT đã cài đặt  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− James A. O’Brien, George M. Marakas, Introduction to Information Systems, 15th \nEdition, 2007, ISBN -13: 978-0-07-337677 -6 (alk. paper).  \n− Gary B. Shelly, Harry J. Rosenblatt , Systems Analysis and Design, 9th  Edition, \nBoston: Thomson Learning  , 2012, ISBN -13: 978 -0-538-48161.  \n− Jaroslav Pokorny, Vaclav Repa, Karel Richta, Wita Wojtkowski, Henry Linger, Chris \nBarry, Michael Lang, Information System Development: Business Systems and \nServices: Modeling and Development, ISBN 978 -1-4419 -9645 -9 e-ISBN 978 -1-4419 -\n9790 -6, DOI 10.1007/978 -1-4419 -9790 -6, Springer Science+Business Media, LLC \n2011  \nCông cụ hỗ trợ  \n− Rational R ose, UML 2.0  \n− .NET, JAVA  "
}