{
    "course_id": "CSC11109",
    "course_name": "An ninh mạng nâng cao",
    "course_start_page": 113,
    "course_end_page": 114,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC11109  – An ninh mạng nâng cao  \n \n Thông tin chung  \n− Mã học phần  : CSC11109  \n− Khối kiến thức:  Tự chọn  – Kiến thức tốt nghiệp  \n− Số tín chỉ:  4 \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : An Ninh M ạng   \n Mô tả học phần  \nMôn học sẽ sử dụng và kế thừa nội dung của môn học an ninh mạng và tập trung đi sâu vào \ncác lĩnh vực của an ninh máy tính như reverse engineering, phân tích malware, mobile security, \npenetration testring, forensic, … đồng thời cũng cung cấp cho sinh viên những khái niệm liên \nquan tới việc quản lý an toàn thông tin như quản lý và đánh giá rủi ro, cân bằng quyền hạn, …  \n Mục tiêu  của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để trình bày một số vấn đề an ninh lĩnh \nvực máy tính & mạng máy tính  \n− Biết và giải thích được các thuật ngữ tiếng Anh thuộc chuyên ngành an ninh mạng  \n− Giải thích đư ợc các khái niệm cơ bản, thuật ngữ, trách nhiệm, công việc và nguyên tắc \nđạo đức cơ bản... thuộc lĩnh vực an ninh mạng  \n− Xác định và phân loại được các loại malware, hình thức lây nhiễm lan truyền và các \nnguy cơ tấn công máy tính & mạng máy tính  \n− Hiểu và sử d ụng các phần mềm bảo mật mạng, các phần mền quản lý và đánh giá rủi \nro. \n− Thiết kế + tăng cường  được an ninh cho một số hệ thống mạng đơn giản.  \n− Sử dụng các công cụ phần mềm hỗ trợ để tìm lỗi và tăng cường bảo mật cho hệ thống \nmạng  \n Nội dung học phần    \n 114 − Giới thiệu & tổng quan về an ninh máy tính, các lỗi phổ biến các thức khai thác và giảm \nthiểu thiệt hại.  \n− Giới thiệu tổng quan về virus, malware các thức lây nhiễm và lan truyền.  \n− Dịch ngược mã nguồn và các phương pháp phân tích malware, virus.  \n− Cách thức và  cơ chế hoạt động của các chương trình antivirus. Các cơ chế ẩn mình của \nmalware.  \n− Các mô hình bảo mật của các hệ điều hành mobile: Sanbox, quản lý và cung cấp quyền \nhạn \n− Các hướng tấn công phổ biến trên mobile: ăn cắp thông tin, cài đặt malware, tấn công \nphần cứng  \n− Digital forensic (điều tra số)  \n− Penetration testing  \n− Quản lý,  đánh giá rủi ro, và phân chia quyền hạn.  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \n− Network Security: Private Communication in a Public World, Second Edition, Charlie \nKaufman, Radia Perlman, M ike Speciner  \nTài liệu tham khảo  \n− Slide và tài liệu phát cùng môn học  \nCông cụ hỗ trợ  "
}