{
    "course_id": "CSC15011",
    "course_name": "Nhập môn ngôn ngữ học thống kê và ứng dụng",
    "course_start_page": 243,
    "course_end_page": 245,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC15011  - Nhập môn ngôn ng ữ học thống kê và ứng d ụng  \n \n Thông tin chung  \n− Mã học phần  : CSC15011  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn học này nhằm cung cấp cho sinh viên một cái nhìn tổng quát về lĩnh vực Ngôn ngữ học \nthống kê, các kiến thức nền tảng liên quan đến việc chuẩn bị, xây dựng các kho ngữ liệu phục \nvụ việc thống kê, các p hương pháp thống kê, kiểm định để rút trích thông tin ngôn ngữ từ các \nkho ngữ liệu. Môn học cũng giúp xây dựng kiến thức nền tảng cho chuyên ngành Công nghệ \ntri thức (lĩnh vực Xử lý ngôn ngữ tự nhiên) nhằm tạo sự sẵn sàng cho các môn học chuyên sâu \nhơn ở c ác năm sau. Môn học cũng giúp sinh viên có những trải nghiệm thực tế về quá trình xây \ndựng kho ngữ liệu, xử lý và ứng dụng các phương pháp thống kê, kiểm định vào việc khai thác \nkho ngữ liệu.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để nghiên cứu, xây dựng và khai khác \nkho ngữ liệu và trình bày kết quả.  \n− Hiểu và áp dụng ở mức độ cơ bản các phương pháp thống kê, kiểm định trên ngữ liệu \nthực tế.  \n− Biết những khái niệm cơ bản về ngữ liệu, phân loại  ngữ liệu; các tiêu chí xây dựng kho \nngữ liệu, xử lý và khai thác kho ngữ liệu.  \n− Có khả năng nhận diện, miêu tả và phân tích, đánh giá về tổ chức và chất lượng của \nmột kho ngữ liệu cụ thể.   \n 244 − Biết và áp dụng các tiêu chí khi thu thập ngữ liệu (tính cân bằng, t ính đại diện, lấy mẫu \nngữ liệu); xử lý ngữ liệu : gán nhãn ngôn ngữ ở các bình diện ngôn ngữ khác nhau và \nở cấp độ ngôn ngữ khác nhau; khai thác ngữ liệu.  \n− Nhận thức được vai trò và tầm quan trọng của ngôn ngữ học thống kê và việc chuẩn bị \nkho ngữ liệu. \n Nội dung học phần   \n− Tổng quan về Ngôn ngữ học thống kê.  \n• Cơ sở lý thuyết xác suất  \n• Biến ngẫu nhiên một chiều, các luật phân phối xác suất thường gặp  \n• Thống kê ngôn ngữ học  \n• Ước lượng tham số và kiểm định giả thuyết thống kê.  \n• Tương quan và hồi quy.  \n• Từ điển  tần số.  \n• Phong cách học định lượng.  \n• Tổ chức định lượng của vốn từ.  \n• Tính đa  dạng của vốn từ  \n− Đại cương về Ngôn ngữ học Ngữ liệu  \n• Đại cương về NNHNL  \n• Lịch sử nghiên cứu về ngữ liệu  \n• Cơ sở lý  luận NNHNL  \n− Xây dựng kho ngữ liệu  \n• Lập kế hoạch xây dựng kho ngữ liệu  \n• Tiêu chí lựa chọn ngữ liệu  \n• Các dạng ngữ liệu  \n• Thu thập ngữ liệu  \n• Xây dựng ngữ liệu đơn ngữ (tiếng Việt)  \n• Xây dựng ngữ liệu song ngữ (Anh -Việt)  \n− Xử lý kho ngữ liệu  \n• Tiền xử lý ngữ liệu  \n• Gán nhãn ngôn ngữ  \n• Hình thức hóa các nhãn ngôn ngữ  \n• Gán nhãn ngôn ngữ cho ngữ l iệu đơn ngữ (tiếng Việt)  \n• Gán nhãn ngôn ngữ cho ngữ liệu song ngữ (Anh -Việt)  \n• Thiết kế kho ngữ liệu song ngữ (Anh -Việt)  \n• Đánh dấu ngữ liệu  \n• Siêu dữ liệu  \n• Kho ngữ liệu văn bản nói  \n− Các ứng dụng của NNHNL  \n• Ứng dụng trong NNH tính toán  \n• Ứng dụng trong nghiên cứu ngôn  ngữ \n• Ứng dụng trong giảng dạy ngôn ngữ  \n• Các ứng dụng khác  \n− Thuyết trình  \n Tài nguyên học phần  \nGiáo trình   \n 245 − Nhập môn thống kê Ngôn ngữ học, Nguyễn Đức Dân, 1998, NXB. Giáo dục.  \n− Thống kê Ngôn ngữ học: một số ứng dụng, Nguyễn Đức Dân, 1999, NXB. Giáo dục.  \n− Ngôn ngữ học Ngữ liệu, Đinh Điền, 2018, Tp HCM: NXB. ĐHQG -HCM.  \n− Corpus Linguistics: Method, Theory and Practice, Tony McEnery and Andrew Hardie, \n2012, UK: Cambridge University Press. ISBN: 978 -0-52-154736 -9. \nTài liệu tham khảo  \n− Corpus Linguistics and Linguistica lly annotated corpora, Sandra Kubler and Heike \nZinsmeister, 2015, USA: Bloomsbury Publishing Plc. ISBN: 978 -1-44-116447 -6. \n− Recent Advances in Corpus Linguistics: Developing and Exploiting Corpora, Lieven \nVandelanotte, Kristin Davidse, Caroline Gentens, Dit te Kimps, 2014, USA: Rodobi \nPublisher. ISBN: 978 -90-420-3871 -4. \n− Developing Linguistic Corpora: a Guide to Good Practice, edited by Martin Wynne, \n2005, ISSN 1463 5194.  \n− Corpus Linguistics for Translation and Contrastive Studies, Mikhail Mikhailov and \nRobert Cooper, 2016, USA -NY: Routledge Publisher. ISBN: 978 -1-13-894404 -6 \n− Link Youtube  \n− Slide nội dung tự học  \n− Tài liệu tự học dạng văn bản  \nCông cụ hỗ trợ  "
}