{
    "course_id": "CSC12004",
    "course_name": "Phân tích thiết kế hệ thống thông tin",
    "course_start_page": 149,
    "course_end_page": 150,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC12004  - Phân tích thi ết kế hệ thống thông tin  \n \n Thông tin chung  \n− Mã học phần  : CSC12004  \n− Tên tiếng Anh  : Information Systems Analysis and Design  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Nhập môn c ơ sở dữ liệu    \n Mô tả học phần  \nNội dung môn học cung cấp cho sinh viên các khái niệm cơ bản về HTTT và xây dựng HTTT \ntrong một đơn vị tổ chức. Môn học giới thiệu đến si nh viên một cách có hệ thống qui trình và \nphương pháp luận để tin học hoá HTTT quản lý cho các đơn vị tổ chức từ giai đoạn lên kế \nhoạch khởi tạo dự án tin học hóa đến đến triển khai vận hành hệ thống. Trong đó, tập trung vào \nviệc khảo sát và phân tích đánh  giá hiện trạng, đánh giá rũi ro, phát sinh và chọn lực phương \nán phát triển, mô hình hoá nghiệp vụ và thiết kế cài đặt hệ thống. Bên cạnh đó, sinh viên còn \nđược làm quen với các kỹ thuật và công cụ để có thể thực hành việc mô hình hóa, thiết kế và \ntriển k hai HTTT tự động hóa. Hơn nữa trong quá trình triển khai môn học, sinh viên sẽ được \ntrao dồi các kỹ năng làm việc nhóm, giải quyết vấn đề, sáng tạo và ra quyết định thông qua các \nbài tập tương tác trên lớp cũng như đồ án cuối kỳ của môn học.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Có khả năng làm việc độc lập và tự phối hợp nhóm để giải quyết và trình bày các báo \ncáo kỹ thuật trong phân tích và thiết kế HTTT  \n− Có khả năng đọc các tài liệu về môn học và giải thích được các thuật ngữ, kh ái niệm \nchuyên ngành HTTT bằng tiếng Anh  \n− Có khả năng tư duy hệ thống, khả năng phân tích giải quyết vấn đề HTTT thực tế đơn \ngiản.   \n 150 − Trình bày qui trình và các giai đoạn để xây dựng và phát triển một HTTT tự động hóa \ntrong các đơn vị tổ chức  \n− Áp dụng công cụ và mô hình để thiết kế và mô tả nghiệp vụ của tổ chức.  \n− Nhận dạng, mô tả và mô hình hóa thành phần tĩnh và động trong HTTT.  \n− Hiểu và áp dụng một số kiến trúc, công nghệ phần mềm để thiết kế và xây dựng ứng \ndụng HTTT.  \n− Hiểu công việc triển khai hệ thống trong môi trường nghiệp vụ, tầm quan trọng của \nviệc hướng dẫn và đào tạo người dùng  \n Nội dung học phần   \n− Bài 1 - Tổng quan về HTTT  \n− Bài 2 - Mô hình và phương pháp mô hình hóa  \n− Bài 3 - Khởi tạo và lập kế hoạch phát triển HTTT  \n− Bài 4 - Phân tích yêu cầu và đánh g iá hiện trạng HTTT  \n− Bài 4 - Phân tích yêu cầu và đánh giá hiện trạng HTTT (tt)  \n− Bài 5 - Mô hình hóa nghiệp vụ  \n− Bài 5 - Mô hình hóa nghiệp vụ (tt)  \n− Bài 6 - Phân tích và mô hình hóa thành phần tĩnh  \n− Bài 6 - Phân tích và mô hình hóa thành phần tĩnh (tt)  \n− Bài 7 - Thiết kế kiến trúc và chức năng ứng dụng  \n− Bài 7 - Thiết kế kiến trúc và chức năng ứng dụng (tt)  \n− Bài 8 - Thiết kế dữ liệu  \n− Bài 9 - Thiết kế giao diện  \n− Bài 10 - Cài đặt và triển khai hệ thống  \n− Ôn tập & tổng kết  \n Tài nguyên học phần  \nGiáo trình  \n− Phân tích thiết kế Hệ  thống thông tin hướng đối tượng. Phạm Nguyễn Cương, Nguyễn \nTrần Minh Thư, Hồ Bảo Quốc,  2015  \nTài liệu tham khảo  \n− Mike O’ Doccherty, Object -Oriented Analysis and Design Understanding System \nDevelopment with UML 2.0, John Wiley & Sons, Ltd, May 2005, ISBN -13 978 -0-470-\n09240 -8 \n− Raul Sidnei Wazlawick, Object -Oriented Analysis and Design for Information Systems \nModeling with UML, OCL, and IFML,Elsevier Editora Ltda, 2013, ISBN: 978 -0-12-\n418673 -6. \nCông cụ hỗ trợ  \n− Visio  "
}