{
    "course_id": "CSC11101",
    "course_name": "An ninh mạng",
    "course_start_page": 111,
    "course_end_page": 112,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC11101  – An ninh mạng  \n \n Thông tin chung  \n− Mã học phần  : CSC11101  \n− Khối kiến thức:  Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ:  4 \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn học sẽ cân bằng giữa phần mã hóa và các vấn đề an ninh hệ thống máy tính và mạng máy \ntính. Phần đầu môn học là phần các kĩ thuật mã hóa dữ liệu và phần sau là các giao thức bảo \nmật trên mạng như là PGP, IPSec, SSL /TLS,…; các vấn đề về tấn công và bảo vệ mạng máy \ntính: Denial -of-Service, DNS Cache Poisoning, Buffer Overflow, Dictionary, Virus, worms và \nTrojans, Firewall và Intrusion detection.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức  độ cá nhân và cộng tác nhóm để trình bày một số vấn đề an ninh lĩnh \nvực máy tính & mạng máy tính  \n− Biết và giải thích được các thuật ngữ tiếng Anh thuộc chuyên ngành an ninh mạng  \n− Giải thích được các khái niệm cơ bản, thuật ngữ, trách nhiệm, công việc và ngu yên tắc \nđạo đức cơ bản... thuộc lĩnh vực an ninh mạng  \n− Xác định và phân loại được các phương pháp mã hóa và các nguy cơ tấn công máy tính \n& mạng máy tính  \n− Hiểu và triển khai ở mức độ cơ bản các phần mềm bảo mật mạng  \n− Thiết kế + triển khai được an ninh cho một  số trường hợp mạng đơn giản.  \n− Sử dụng các công cụ phần mềm hỗ trợ bảo mật mạng  \n Nội dung học phần    \n 112 − Giới thiệu & tổng quan về an ninh máy tính và mạng máy tính  \n− Mã hóa khóa bí mật: mã hóa khối, mã hóa dòng, mã hóa cổ điển, và DES, AES.  \n− Mã hóa khóa công khai:  Diffire -Hellman, RSA  \n− Ứng dụng của mã hóa khối, mã hóa dòng. Trao đổi khóa và phân phối khóa. Mã hóa \nhiện đại.  \n− Hàm băm và chữ kí số  \n− Chứng thực trên máy tính đơn và trên mạng  \n− Tấn công TCP/IP, BGP, và DNS  \n− PGP, IPSec, SSL/TLS  \n− Firewall  \n− Buffer overflow  \n− Ôn tập \n Tài nguyên học phần  \nGiáo trình  \n− Network Security: Private Communication in a Public World, Second Edition, Charlie \nKaufman, Radia Perlman, Mike Speciner  \nTài liệu tham khảo  \n− Slide và tài liệu phát cùng môn học  \nCông cụ hỗ trợ  "
}