{
    "course_id": "CSC15009",
    "course_name": "Xử lý tín hiệu số",
    "course_start_page": 241,
    "course_end_page": 242,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC15009  - Xử lý tín hi ệu số \n \n Thông tin chung  \n− Mã học phần  : CSC15009  \n− Tên tiếng Anh  : Digital Signal Processing  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :  Giải tích B1, Kỹ thuật lập trình,  \n       Cấu trúc dữ liệu và giải thuật  \n Mô tả học phần  \nViệc cốt lõi trong Công nghệ Thông tin là xử lý thông tin, dữ liệu trên máy tính. Thông tin \nđược thể hiện dưới dạng (vật lý) là các tín hiệu, và khi tín hiệu được đưa v ào trong máy tính \nđể xử lý thì nó sẽ phải được số hóa thành tín hiệu số. Do đó có thể nói xử lý tín hiệu số là một \nnền tảng trong Công nghệ thông tin. Nhu cầu xử lý bằng phần mềm các tín hiệu thực tế ngày \ncàng lớn và chất lượng xử lý đòi hỏi ngày càng cao,  để đáp ứng sinh viên cần nắm được và vận \ndụng hữu hiệu các kiến thức & phương pháp trong xử lý tín hiệu số. Môn học sẽ trình bày các \nkiến thức và phương pháp cơ bản, đồng thời cũng đưa ra một số ứng dụng cụ thể với các tín \nhiệu thông dụng.  \n Mục tiêu của họ c phần  \nSau khoá học, sinh viên có khả năng:  \n− Vận dụng kỹ năng trình bày, kỹ năng viết báo cáo.  \n− Hiểu các thuật ngữ và các tài liệu tiếng Anh liên quan môn học.  \n− Vận dụng kỹ năng tư duy và lập trình để giải quyết vấn đề được cho.  \n− Hiểu rõ các khái niệm cơ bản v ề tín hiệu, cơ chế lấy mẫu tín hiệu liên tục để có tín hiệu \nsố, có thể khảo sát được tín hiệu âm thanh số và vẽ được sóng tín hiệu.  \n− Hiểu được các tính chất của các hệ thống thời gian rời rạc và đáp ứng của hệ tuyến tính \nbất biến.   \n 242 − Hiểu và vận dụng được các phép biến đổi cơ bản Z, Fourier  \n− Hiểu và vận dụng được phương pháp lọc nhiễu, nhúng dữ liệu & nén tín hiệu, một số \nxử lý với tín hiệu âm thanh số.  \n Nội dung học phần   \n− Một số kiến thức bổ sung  \n− Tổng quan về tín hiệu và hệ thống rời rạc  \n− Thu mẫu & tái xuất tín hiệu số  \n− Các phép biến đổi cơ bản  \n− Lọc nhiễu  \n− Nén tín hiệu số  \n− Chuyển đổi dạng tín hiệu & Ẩn dữ liệu  \n− Nhận dạng tín hiệu số  \n− Xử lý tín hiệu âm thanh & tiếng nói  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \n− Xử lý tín hiệu số, QUÁCH T. NGỌC, NXB Giáo dục, Hà Nội.  \nTài liệu tham khảo  \n− Discrete_Time Signal Processing,  ALAN V. OPENHEIM, RONALD W. SCHAFER, \nPrentice Hall, New York.  \n− Digital Signal Processing. A Practical Approach, EMMANUEL C. IFLEACHOR, \nBARRIE W. J ERVIS, Workingham: Addison - Wesley.  \nCông cụ hỗ trợ  \n− Phần mềm mathlab,  \n− Hệ thống máy tính có hỗ trợ soundcard,  \n− Tai nghe & micro  "
}