{
    "course_id": "CSC12106",
    "course_name": "Tương tác người - máy",
    "course_start_page": 164,
    "course_end_page": 165,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC12106  - Tương tác ngư ời - máy \n \n Thông tin chung  \n− Mã học phần  : CSC12106  \n− Tên tiếng Anh  : Human -Computer Interaction  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Sinh viên nên có kiến thức về thiết kế hệ thống thông tin \ntrong môn học Phân Tích Thiết Kế Hệ Thống Thông Tin    \n Mô tả học phần  \nMôn học này cung cấp kiến thức về thiết kế tương tác người -máy trong lĩnh vực tương tác giữa \nhệ thống thông tin (HTTT ) và người khai thác HTTT. Sinh viên sẽ được học nhiều loại mô \nhình và kỹ thuật tương tác trong qui trình thiết kế, cũng như những nguyên lý thiết kế tương \ntác nhằm tạo ra các sản phẩm có tính khả dụng và tương tác cao trong HTTT. Ngoài ra, phương \npháp đán h giá tính khả dụng của một thiết kế cũng được cung cấp để giúp sinh viên so sánh và \nlựa chọn được những bản thiết kế tốt nhất mang lại hiệu quả cao trong công việc cho người \nkhai thác HTTT. Sinh viên cũng sẽ học được làm thế nào để thực hiện việc sáng tạo  ý tưởng \nthiết kế trong quá trình làm việc nhóm.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Phối hợp với các thành viên trong nhóm để trao đổi chính kiến của mình trong quá trình \nthiết kế  \n− Trình bày lại tài liệu/bài báo tiếng Anh có liên quan tới việc vận dụng nguyên lý tương \ntác người - máy vào HTTT  \n− Thực hành suy nghĩ có phê phán, sáng tạo trong việc nắm bắt các vấn đề của TTNM \ntrong HTTT   \n 165 − Diễn giải các nguyên lý, mô hình, và kỹ thuật tương tác người - máy trong lĩnh vực \ntương tác HTT T với những người khai thác HTTT  \n− Vận dụng kiến thức tương tác người - máy vào việc thiết kế để cải tiến tương tác/giao \ndiện HTTT có tính khả dụng và tương tác cao  \n− Đánh giá tính khả dụng và tính tương tác của các thiết kế giao diện trong một HTTT cụ \nthể \n− Xây dựng tương tác/giao diện mới cho 1 HTTT bằng các công cụ hỗ trợ thiết kế tương \ntác/giao diện  \n Nội dung học phần   \n− Dẫn nhập tương tác người -máy \n− Mô hình tương tác người -máy \n− Thiết kế tương tác là gì?  \n− Qui trình thiết kế tương tác  \n− Qui trình thiết kế tương tác ( tt) \n− Tương tác người -máy trong qui trình phần mềm  \n− Qui tắc và phong cách thiết kế  \n− Qui tắc và phong cách thiết kế  \n− Tiếp cận hướng người dùng trong thiết kế tương tác  \n− Phương pháp đánh giá thiết kế  \n− Các vấn đề khác của thiết kế  \n Tài nguyên học phần  \nGiáo trình  \n− Designing the user interface: Strategies for Effective Human -Computer Interaction 5th \nEdition, Ben Shneiderman và Catherine Plaisant, Addison Wesley, 2010.  \n− Interation Design beyond Human -Computer Interaction, Gaynor, Katherine Hepburn, \nKen Santor và cộng sự, John Wiley & Son, 2002.  \nTài liệu tham khảo  \n− Human -Computer Interaction 3rd Edition, Alan Dix, Janet Finlay, Gregory D. Abowd \nvà Russell Beale, Pearson Prentice Hall, 2004.  \n− Bill Buxton, Sketching User Experiences, getting the design right and the right design, \nMorgan Kaufmann Publishers, 2007.  \n− Don Norman, The design of everyday things, Basic Books, Perseus Books Group, 2013.  \nCông cụ hỗ trợ  "
}