{
    "course_id": "CSC15107",
    "course_name": "Phân tích dữ liệu bảo toàn tính riêng tư",
    "course_start_page": 267,
    "course_end_page": 268,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC15107  - Phân tích d ữ liệu bảo toàn tính riêng tư  \n \n Thông tin chung  \n− Mã học phần  : CSC15107  \n− Tên tiếng Anh  : Privacy -Preserving Data Analysis  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn học này nhằm cung c ấp cho sinh vi ên một cái nhìn tổng qu át về khai th ác dữ liệu đảm \nbảo tính riêng tư. Thách th ức nền tảng của kha i thác dữ liệu là làm sao c ân ằng gi ữa tính riêng \ntư và tính tiện dụng trong chia s ẻ dữ liệu. M ôn học, cung c ấp khái niệm về tính riêng tư và định \nnghĩa thóng qua c ác tham s ố. Sau đ ó, tùy thu ộc định ngh ĩa về tính ri êng tư; và với các nhi ệm \nvụ được cho, thu ật giải nào cung c ấp tính hữu dụng cao nh ất cho khai th ác dữ liệu nhưng vẫn \nđảm bảo bảo vệ được tính riêng tư ở mức định ngh ĩa đã xác định. M ôn học cung c ấp tập trung \nvào các kỹ thuật và cơ chế theo ngh ĩa chúng được cài đặt và thực nghi ệm. \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để trình bày một số báo cáo kỹ thuật theo \nmẫu cho trước trong lĩnh vực k ỹ thuật phần mềm  \n− Biết và giải thích được các thuật ngữ tiếng Anh thuộc chuyên ngành Kỹ thuật phần \nmềm  \n− Giải thích được các khái niệm cơ bản, thuật ngữ, trách nhiệm, công việc và nguyên tắc \nđạo đức cơ bản... thuộc lĩnh vực Kỹ nghệ phần mềm  \n− Xác định và phân l oại được các loại tiến trình phát triển phần mềm khác nhau  \n− Hiểu và triển khai ở mức độ cơ bản được cho từng pha trong quá trình phát triển phần \nmềm   \n 268 − Xây dựng được một số thành phần của sản phẩm phần mềm ở quy mô nhỏ  \n− Sử dụng các công cụ phần mềm hỗ trợ  \n Nội dung học phần   \n− Phân tích dữ liệu đảm bảo tính riêng tư: các khái niệm thống kê  \n− Phân tích dữ liệu đảm bảo tính riêng tư: phân tích dữ liệu thống kê và máy học  \n− Differential Privacy: các khái niệm cơ bản  \n− Differential Privacy: các kỹ thuật cơ bản  \n− Different ial Privacy: composition theorems  \n− Differential Privacy: các thuật toán và cơ chế  \n− Differential Privacy: thiết kế cơ chế  \n− Ứng dụng: DP và Máy học  \n− Ứng dụng: DP trong cây quyết định  \n− Ứng dụng: DP trong SVM  \n− Ứng dụng: DP trong mạng nơ -ron và học sâu  \n Tài nguyên học  phần  \nGiáo trình  \n− Bài giảng môn học, Bộ Môn Công nghệ Tri thức, Khoa CNTT, ĐHKHTN, 2019.  \n− Thống kê Máy tính, Khoa CNTT, ĐHKHTN, 2015.  \n− Mạng nơ -ron: Phương pháp và ứng dụng, Nguyễn Đình Thúc - Đặng Trọng Vân -\nHoàng Đức Hải, NXBGD, 2002  \nTài liệu tham khảo  \n− Differential Privacy: From Theory to Practice, Ninghui Li, Min Lyu, Dong Su, Weining \nYang. Elisa Bertino & Ravi Sandhu, Series Editors, 2016.  \n− The Algorithmic Foundations of Differential Privacy, Cynthia Dwork and Aaron Roth, \nNOW, 2014.  \n− Các bài báo nghiên cứu d o Giảng viên cung cấp.  \nCông cụ hỗ trợ  "
}