{
    "course_id": "CSC16112",
    "course_name": "Chuyên đề Xử lý ảnh số và video số",
    "course_start_page": 305,
    "course_end_page": 306,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC16112  – Chuyên đ ề Xử lý ảnh số và video s ố \n \n Thông tin chung  \n− Mã học phần  : CSC16112  \n− Tên tiếng Anh  : Research Topics in Image and Video Processing  \n− Khối kiến thức: Tự chọn  – Kiến thức tốt nghiệp  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Nhập môn l ập trình   \n Mô tả học phần  \nMôn học cung cấp các kiến thức tiến tiến về xử lý, hồi phục, biến hình, ẩn dữ liệu và nén ảnh \nsố, video số để khai thác được hai thuộc tính c ơ bản của ảnh số, video số là  thị giác và ngữ \nnghĩa, nhằm ứng dụng trong các lĩnh vực nhận dạng, sinh trắc học, sinh tin học, truy vấn ảnh, \nbảo mật, quảng cáo, giáo dục, xử lý ảnh vệ tinh, xử lý ảnh y khoa,... Nội dung gồm các phần \nchính như phần xử lý gồ m: phương pháp rút trích đặc trưng màu, vân, dáng, chuyển động, các \ntoán tử hình thái học; phần hồi phục gồm: hồi phục ảnh dựa trên miền không gian, tần số; phần \nnén ảnh gồm: nén mất mát thông tin dựa vào kỹ thuật Fractal; phần ẩn dữ liệu gồm: phương \npháp Watermarking, Steganography. Ngoài ra, môn học còn cung cấp các kỹ năng sử dụng \nthành thạo thư viện xử lý ảnh, video OpenCV.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Có khả năng báo cáo và ứng dụng các kiến thức trong lĩnh vực xử lý ảnh số và video \nsố ỡ mức độ cá nhân và nhóm.  \n− Dịch tài liệu tiếng Anh thuộc chuyên ngành xử lý ảnh số và  video số.  \n− Phân tích và giải quyết vấn đề liên quan đến lĩnh vực xử lý ảnh số và video số.  \n− Diễn giải và ứng dụng biểu diễn ảnh số và video số.  \n− Diễn giải  và ứng dụng toán tử hình thái học trong xử lý ảnh (video)  \n− Diễn giải và ứng phép biến hình Morphing trong ảnh (video)   \n 306 − Diễn giải và ứng dụng phương pháp hồi phục ảnh  \n− Diễn giải và ứng dụng phương pháp nén ảnh dựa vào kỹ thuật Fractal.  \n− Diễn giải và ứng dụng p hương pháp ẩn thông tin trong ảnh  \n− Xây dựng hệ thống xử lý ảnh, video phức tạp  \n Nội dung học phần   \n− Đặc trưng màu, chuyển động  \n− Đặc trưng dáng  \n− Đặc trưng vân  \n− Các toán tử hình thái học cơ bản: co, giãn, đóng, mở  \n− Ứng dụng toán tử hình thái học trong ảnh, video  \n− Phép biến hình Morphing  \n− Hồi phục ảnh dựa vào miền không gian  \n− Hồi phục ảnh dựa vào miền tần số  \n− Cơ sở toán học của nén ảnh dựa vào kỹ thuật Fractal.  \n− Phương pháp nén ảnh dựa vào kỹ thuật Fractal.  \n− Phương pháp nhúng thông tin vào ảnh  \n− Phương pháp ẩn thông tin tron g ảnh  \n− Seminar đồ án  \n• Rút trích đặc trưng màu, vân, dáng, chuyển động.  \n• Toán tử hình thái học  \n• Phép biến đổi Morphing  \n• Hồi phục ảnh  \n• Nén ảnh Fractal  \n• Ẩn thông tin trong ảnh  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− Computer Vision, David A.Forsyth, Jean Ponce, , Person Education, Inc, 2003.  \n− Digital Image Processing, Rafael C. gonzalez, Richard E. Woods, Prentice -Hall, Inc, \n2002.  \n− Handbook of Image & Video Processing, AL Bovik, Academic Press, 2000.  \nCông cụ hỗ trợ  \n− Visual Studio .NET  \n− Matllab  \n "
}