{
    "course_id": "CSC13101",
    "course_name": "Các chủ đề nâng cao trong Công nghệ phần mềm",
    "course_start_page": 197,
    "course_end_page": 198,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC13101  – Các ch ủ đề nâng cao trong Công nghệ phần mềm \n \n Thông tin chung  \n− Mã học phần:  CSC13101  \n− Tên tiếng Anh: Advanced Topics in Software Engineering  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Nhập môn Công nghệ phần mềm    \n Mô tả học phần  \nĐây là học phần tự chọn thuộc lĩnh vực công nghệ phần mềm, đề cập đến những chủ đề chuyên \nsâu đã và đang thu hút được sự quan tâm của cộng đồng nghiên cứu cũng như công nghiệp \nphần mềm. Học phần này cung cấp cho sinh viê n những kiến thức và kỹ năng nâng cao trong \nviệc thực thi các dự án phần mềm, như kiến thức và kỹ năng quản lý dự án, quản lý và làm việc \nnhóm, quản lý rủi ro, phân tích và ước lượng chi phí. Sinh viên còn được trang bị các kỹ năng \nnghiên cứu cơ bản như đọ c hiểu và tóm tắt bài báo khoa học và kỹ năng trình bày một chủ đề \nchuyên sâu nào đó trong lĩnh vực công nghệ phần mềm.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Vận dụng kỹ năng làm việc nhóm nhằm trình bày và báo cáo seminar và hoàn thàn h \nbài tập nhóm  \n− Đọc hiểu và tóm tắt các bài báo khoa học bằng tiếng Anh chuyên ngành CNPM  \n− Phân tích và đánh giá các vấn đề liên quan đến những chủ đề chuyên sâu trong CNPM \nđược đề cập trong chương trình  \n− Nhận biết một số hướng quan trọng và được sự qua tâm c ủa cộng đồng CNPM  \n− Ước lượng dự án phần mềm  \n− Hiểu và áp dụng các phương pháp tiếp cận phổ biến trong tái sử dụng phần mềm \n(software reuse)   \n 198 − Hiểu biết các nguyên lý cơ bản trong quản lý con người trong dự án phần mềm  \n− Hiểu biết cách tiếp cận công nghệ phần mềm theo hướng giá trị  \n Nội dung học phần   \n− Giới thiệu về học phần  \n− Ước lượng phần mềm (Software estimation)  \n• Overview  \n• Software sizing  \n• COCOMO and effort estimation  \n− Quy Trình Phần Mềm (Software process)  \n• CMMI  \n• Agile Methods (Scrum, XP)  \n− Peopleware  \n− Value -Based Software Engineering  \n− User Interface Design (Web UI)  \n− Component -based Software Engineering  \n− Service -oriented Software Engineering  \n− Aspect -oriented Software Development  \n− Một số chủ đề và hướng nghiên cứu khác  \n− Ôn tập  \n− Seminar  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− Software Estimation with COCOMO II, B.W. Boehm, E. Horowitz, R. Madachy, D. \nReifer, B. K. Clark, B. Steece, A. W. Brown, S. Chulani, and C. Abts, Prentice Hall, \n2000.  \n− Peopleware: Productive Projects and Teams, 2nd ed., T. DeM arco, T. Lister, Dorset \nHouse, 1999  \n− Balancing Agility and Discipline: A Guide for the Perplexed, B.W. Boehm, R. Turner, \nAddison -Wesley, 2003  \n− The Mythical Man -Month, F. Brooks , Addison -Wesley Publishing Company, 1995.  \nISBN 0 -2-1083595 -9. \n− Software Engineering, 8th Edition, Ian Sommerville, Addison -Wesley, 2007  \nCông cụ hỗ trợ  "
}