{
    "course_id": "CSC16003",
    "course_name": "Phân tích thống kê dữ liệu nhiều biến",
    "course_start_page": 251,
    "course_end_page": 252,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC16003  – Phân tích th ống kê d ữ liệu nhi ều biến \n \n Thông tin chung  \n− Mã học phần  : CSC16003  \n− Tên tiếng Anh  : Multivariate Statistical Analysis  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Nhập môn l ập trình   \n Mô tả học phần  \nMôn học cung cấp các kiến thức nền tảng về PTTKDLNB để phân tích, khai thác dữ liệu nhiều \nbiến nhằm ứng dụng trong các lĩnh vực như: Kinh doanh, Bảo hiểm, Chứng khoán, Xã hội, Xử \nlý ảnh, Thị giác máy tính, An ninh, Quốc phòng, Giáo dục, Dữ liệu lớn…Nội dung bao gồm \ncác phần chính như các khái niệm cơ bản trong PTTKDLNB,  Mô hình hồi qui tuyến tính nhiều \nbiến, Phân tích thành phần chính của d ữ liệu nhiều biến, Phân tích dữ kiện, Phân tích tương \nquan chính tắc, Gom nhóm dữ liệu nhiều biến, Phân lớp dữ liệu nhiều biến.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Có khả năng báo cáo và ứng dụng các kiến thức trong lĩnh vực phân tích dữ liệu ở mức \nđộ cá nhân và nhóm.  \n− Dịch tài liệu tiếng Anh thuộc chuyên ngành phân tích dữ liệu  \n− Phân tích và giải quyết vấn đề liên quan đến phân tích dữ liệu nhiều biến.  \n− Diễn giải và ứng dụng phương pháp phân tích dữ liệu nhiều biến .  \n− Diễn giải và ứng  dụng phương pháp gom nhóm, phân lớp dữ liệu nhiều biến  \n Nội dung học phần   \n− Giới thiệu về PTTKDLNB  \n− Các khái niệm cơ bản về PTTKDLNB   \n 252 − Mô hình hồi qui tuyến tính nhiều biến.  \n− Phân tích thành phần chính.  \n− Phân tích dữ kiện.  \n− Phân tích tương quan chính tắc.  \n− Phương pháp gom nhóm dữ liệu nhiều biến  \n− Phương pháp phân lớp dữ liệu nhiều biến  \n− Seminar đồ án về phương pháp phân tích dữ liệu nhiều biến .  \n− Seminar đồ án về gom nhóm dữ liệu nhiều biến  \n− Seminar về phân lớp dữ liệu nhiều biến  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu  tham khảo  \n− Applied Multivariate Statistical Analysis, Richard A. Johnson, Dean W. Wichern, \nPerson Education, Inc., 2007.  \nCông cụ hỗ trợ  \n− Visual Studio .NET  \n− Matllab  "
}