{
    "course_id": "CSC13005",
    "course_name": "Phân tích và quản lý yêu cầu phần mềm",
    "course_start_page": 173,
    "course_end_page": 175,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC13005  – Phân tích và qu ản lý yêu c ầu ph ần mềm \n \n Thông tin chung  \n− Mã học phần:  CSC13005  \n− Tên tiếng Anh: Analysis and Management of Software Requirements  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :  Nhập môn Công ngh ệ phần mềm   \n Mô tả học phần  \nHọc phần giới thiệu các phương pháp, kỹ thuật hỗ trợ thu thập, xác định, phân tích, đặc tả, \nkiểm chứng và quản lý yêu cầu phần mềm. Trong đó chú trọng trình bày và hướng dẫn sinh \nviên thực hiện được quy trình phân tích và quản lý yêu cầu thông qua một phương pháp luận \ncụ thể. Môn học cũng giúp xây dựng kiến thức nền tảng cho chuyên ngành Kỹ thuật phần mềm, \nmôn học cung cấp các kiế n thức ở pha đầu tiên của quá trình xây dựng sản phẩm phần mềm, \nlà tiền đề cho các môn học tiếp theo trong quy trình phát triển một sản phẩm phần mềm hoàn \nchỉnh. Môn học cũng giúp sinh viên có những trải nghiệm thực tế về quá trình xây dựng yêu \ncầu cho một  sản phẩm phần mềm thông qua các hoạt động nhóm trải nghiệm thực tế với các \nbên liên quan bên ngoài xã hội.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc cộng tác theo nhóm để trải nghiệm thực tế (phỏng vấn, khảo sát thông tin, \nđóng v ai, quan sát…) quá trình xây dựng yêu cầu cho sản phẩm phần mềm  \n− Giải thích được các thuật ngữ tiếng Anh, đọc hiểu tài liệu liên quan đến lĩnh vực yêu \ncầu phần mền  \n− Nhận thức được ý nghĩa và tầm quan trọng của người phân tích yêu cầu trong việc xây \ndựng dự á n phần mềm.   \n 174 − Ứng dụng được các kỹ thuật thu thập thông tin, phân tích, đặc tả và quản lý thảy đổi \nyêu cầu của một hệ thống phần mềm  \n− Có khả năng phân tích và tổng hợp thông tin yêu cầu hệ thống  \n− Kiểm tra và đánh giá được tính khả thi của dự án  \n− Xây dựng được prototype cho dự án phần mềm  \n− Sử dụng các công cụ hỗ trợ trong việc mô hình hóa yêu cầu và quản lý yêu cầu  \n Nội dung học phần   \n− Giới thiệu môn học  \n− Giới thiệu các kỹ thuật học tập  \n− Giới thiệu tổng quan  \n− Thành lập nhóm và giới thiệu đồ án môn học  \n− Giới thiệu tổng quan về RE  \n− Các khái niệm  \n− Quy trình phân tích và quản lý yêu cầu phần mềm  \n− Các kỹ thuật thu thập yêu cầu  \n− Các kỹ thuật thu thập yêu cầu  \n− Phân tích yêu cầu phần mềm  \n− Mô hình hóa yêu cầu  \n− Mô hình hóa nghiệm vụ  \n− Thiết kế prototype  \n− Đánh giá yêu cầu và sắp xếp độ  ưu tiên  \n− Kiểm tra lại yêu cầu  \n− Quản lý thay đổi  \n− Lưu vết yêu cầu  \n− Seminar đồ án  \n− Phản hồi kết quả seminar và ôn tập  \n Tài nguyên học phần  \nGiáo trình  \n− Karl E. Wiegers (2003) , “Software Requirements, Second Edition”, Microsoft Press, \nFile: \"[1].Software Requireme nts 2Ed.chm\"  \nTài liệu tham khảo  \n− Ralph R.Young (2004), “The Requirement Engineering Handbook”, File: “[2].The \nRequirement Engineering Handbook.pdf\"  \n− Alistair Cockburn (1999 -2000) Writing Effective Use Cases, Addison Wesley, File: \n\"[3].Addison -Wesley - Writing Effective Use Cases.pdf\"  \n− Kotonya G, Sommerville I (2000) Requirements engineering – processes and \ntechniques, John Wiley & Sons UK  \n− Lauesen, S (2002) Software requirements: styles and techniques, Addison -Wesley, \nLondon, UK.  \nCông cụ hỗ trợ  \n− Rational Rose  \n− ArgoUML   \n 175 − Visio  \n− Axure  \n− GUI Studio  "
}