{
    "course_id": "CSC11112",
    "course_name": "Chuyên đề Hệ thống phân tán",
    "course_start_page": 269,
    "course_end_page": 270,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC11112  - Chuyên đ ề Hệ thống phân tán  \n \n Thông tin chung  \n− Mã học phần  : CSC11112  \n− Tên tiếng Anh  : Research Topic in Distributed System  \n− Khối kiến thức: Tự chọn  - Kiến thức tốt nghiệp  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Hệ điều  hành   \n Mô tả học phần  \nMôn học này nhằm cung cấp cho sinh viên một cái nhìn tổng quát về hệ thống phân tán, các \nkiến thức nền tảng liên quan đến các thành phần chính yếu trong hệ thống phân tán (khái niệm \nvề hệ thống phân tán, sự kiện, đồng hồ, thứ tự sự kiện, tính đồng bộ và tính n hất quán..). Môn \nhọc cũng giúp xây dựng kiến thức nền tảng cho việc nghiên cứu sâu về hệ phân tán, trợ giúp \nsinh viên đưa ra các giải pháp cho phần mềm ứng dụng trên mạng máy tính.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức đ ộ tự vận hành cộng tác nhóm để trình bày một giải pháp trong hệ \nphân tán  \n− Biết, giải thích, v à ứng dụng  được các thuật ngữ tiếng Anh thuộc về nhánh hệ thống \nphân tán  \n− Giải thích v à minh h ọa được các khái niệm cơ bản, thuật ngữ,... thuộc về nhánh hệ \nthống phân tán  \n− Xác định và phân loại được các bài toán cơ bản trong hệ thống phân tán  \n− Hiểu và đưa ra giải pháp cho các bài toán cơ bản trong hệ phân tán  \n− Xây dựng được một số ứng dụng nhỏ trong môi trường phân tán  \n Nội dung học phần    \n 270 − Giới thiệu & tổng quan hệ thống phân tán  \n− Ôn tập các khái niệm cơ bản của mạng máy tính (LAN, WAN, TCP/IP)  \n− Sự kiện, đồng hồ, gán giờ cho sự kiện và sắp xếp thứ tự sự kiện  \n− Cơ chế liên lạc giữa các tiến trình. Đồng bộ sự kiện trên hệ thống phân tán.  \n− Khôi phục hệ thống khi bị lỗi v à đảm bảo sự nhất quán dữ liệu trên hệ phân tán.  \n− Hệ thống tập tin phân tán  \n− Các kỹ thuật đảm bảo sự an toàn trên hệ phân tán  \n− Các thuật toán đồng thuận  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \n− Advanced Concepts in Operating Systems, 1 edition, Mukesh Singhal and  Niranjan \nShivaratri, McGraw -Hill, 1994  \nTài liệu tham khảo  \n− Distributed Operating System, 1 Edition, Andrew S.Tanenbaum, Prentice Hall, 1995  \nCông cụ hỗ trợ  \n− Visual Studio .NET  \n− Visio  "
}