{
    "course_id": "CSC14105",
    "course_name": "Khoa học về web",
    "course_start_page": 221,
    "course_end_page": 222,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC14105  - Khoa h ọc về web \n \n Thông tin chung  \n− Mã học phần  : CSC14105  \n− Tên tiếng Anh  : Web Science  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn học sẽ giới thiệu định nghĩa về các thế hệ Web và xu hướng Web trong tương lai. Sinh \nviên sẽ được tiếp cận với các khái niệm trên khía cạnh toán học - lý thuyết đồ thị, trên khía \ncạnh xã hội. Bên cạnh đó, sinh viên cũng sẽ được cung cấp những kiến thức về các bài toán \nliên quan đến Web như: Web crawler, Web search…  Ngoài r a, môn học cũng đề cập đến \nnhững vấn đề khó khan mà các thế hệ Web đang gặp phải để từ đó định ra xu hướng cho thế \nhệ Web trong tương lai.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Hiểu ba thế hệ Web: Web 1.0, Web 2.0, và Web 3.0  \n− Hiểu và phân tích được các ứng dụng Web quan trọng  \n− Biết, hiểu và phân tích những thay đổi về mặt kĩ thuật ảnh hưởng như thế nào tới các \nkhía cạnh xã hội của điện toán dựa trên Web.  \n− Biết và tổng hợp được sự phát triển Web hiện đại.  \n− Tổng hợp kiến thức để phát triển các chương trình liên quan tới ứng dụng Web  \n Nội dung học phần   \n− Giới thiệu khoa học Web  \n− Lý thuyết đồ thị mạng và thuật ngữ   \n 222 − Web Crawler và DNS  \n− Phân tích mạng xã hội  \n− Hệ thống tìm kiếm Web  \n− Web ngữ nghĩa  \n− Các vấn đề xã hội, tính bảo mật và những chuẩn mực  \n− Các xu  hướng phát triển trong Khoa học Web  \n Tài nguyên học phần  \nGiáo trình  \n− Semantic Web Services, D. Fensel, F. Facca, E. Simperl and I.Toma, 2011  \n− A framework for Web Science, Tim Berners Lee, Wendy Hall, 2006  \nTài liệu tham khảo  \n− Web Science and Web Technology, Network Theory and Terminology, Markus \nStrohmaier, 2009  \n− Mining the Web: Discovering Knowledge from Hypertext Data, Soumen Chakrabarti, \n2002  \nCông cụ hỗ trợ  "
}