{
    "course_id": "CSC13108",
    "course_name": "Mô hình hóa phần mềm",
    "course_start_page": 205,
    "course_end_page": 206,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC13108  - Mô hình hóa ph ần mềm \n \n Thông tin chung  \n− Mã học phần  : CSC13108  \n− Tên tiếng Anh  : Software Modeling  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nCung cấp kiến thức tổng quan về mô hình  hoá ;  \nCung cấp kiến thức về ngôn ngữ UML 2.5 ;  \nSử dụng các sơ đồ của ngôn ngữ UML để mô hình hóa phần mềm trong quá trình phát triển ;  \nHiểu và vận dụng được cách chuyển đổi mô hình phục vụ phát triển phần mềm dựa trên mô \nhình hóa.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Giải thích được các khái niệm cơ bản, thuật ngữ,... thuộc lĩnh vực Mô hình hóa phần \nmềm.  \n− Trình bày được vai trò và mục tiêu của việc mô hình hóa trong quá trình phát triển phần \nmềm  \n− Trình bày được các thành phần của một ngôn ngữ mô hình hóa và các hướng tiếp cận \nchính để xây dựng một ngôn ngữ mô hình hóa.  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để Mô hình hóa phần mềm  \n− Trình bày  và thực hiện được việc chuyển đổi mô hình  \n− Sử dụng được các công cụ và phần mềm hỗ trợ v iệc mô hình hóa phần mềm  \n− Vận dụng được các biểu đồ UML vào việc mô hình hoá thực tế ở mức độ đồ án môn \nhọc.  \n 206 \n Nội dung học phần   \n− Tổng quan về mô hình hóa phần mềm  \n− Sơ đồ use case  \n− Sơ đồ lớp và đối tượng  \n− Sơ đồ trạng thái  \n− Sơ đồ tuần tự  \n− Sơ đồ giao tiếp  \n− Case study  \n− Sơ đồ Activity  \n− Sơ đồ triển khai & package  \n− Giới thiệu phương pháp phát triển phần mềm hướng mô hình  \n− Cú pháp trừu tượng  \n− Cú pháp cụ thể  \n− Chuyển đổi mô hình sang mô hình  \n− Chuyển đổi mô hình sang mã nguồn  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− UML @ Classroom, An Introduction to Object -Oriented Modeling, Martina Seidl, \nMarion Scholz, Christian Huemer, Gerti Kappel, Springer International Publishing, \n2015  \n− OMG UML, https://www.omg.org/spec/UML/2.5.1/PDF  \n− The Elements of UML 2.0 Style, Scott W. Ambler, Cambridge University Press, 2005.  \n− Model -Driven Software Engineering in Practice, Marco Brambilla, Jordi Cabot, \nManuel Wimmer, Morgan&Claypool Publishers, 2012  \n− https://www.uml -diagrams.org/  \n− Các website, diễn đàn hỗ trợ sử dụng UML đều được.  \nCông cụ hỗ trợ  \n− Các công cụ khác hỗ trợ vẽ các biểu đồ UML (2.5).  "
}