{
    "course_id": "CSC12108",
    "course_name": "Ứng dụng phân tán",
    "course_start_page": 274,
    "course_end_page": 275,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC12108  - Ứng dụng phân tán  \n \n Thông tin chung  \n− Mã học phần  : CSC12108  \n− Tên tiếng Anh  : Distributed Applications  \n− Khối kiến thức: Tự chọn  - Kiến thức tốt nghiệp  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn học này được thiết kế nhằm cung cấp cho sinh viên về các kỹ thuật xây dựng một ứng \ndụng Web - Ứng dụng được khai thác phân tán trên môi trường Internet. Mục tiêu chính của \nmôn học là giúp cho sinh viên hiểu rõ cơ chế hoạt động của một ứng dụng Web, Các kỹ thuật \ncách thức xây dựng ứng dụng Web trên các phân hệ Client, Web Server, Database Sever. Đồng \nthời môn học  cung cấp cho sinh viên các kiến thức về Web API để giúp xây dựng các Ứng \ndụng web tương tác với nhau và sử dụng những Web API phổ biến để hỗ trợ xây dựng ứng \ndụng. Thêm vào đó môn học sẽ trang bị cho sinh viên các kiến thức về bảo mật Web nhằm xây \ndựng mộ t ứng dụng Web an toàn. Môn học cũng giới thiệu cho sinh viên các mã nguồn mở và \ncác công nghệ mới hỗ trợ cho việc phát triển một ứng dụng Web.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Sử dụng khả năng cộng tác nhóm và trình bày để tìm hiểu và trình bày các vấn đề tìm \nhiểu.  \n− Hiểu được các thuật ngữ tiếng Anh và có thể đọc tài liệu tiếng Anh liên quan đến các \nkỹ thuật và công nghệ xây dựng ứng dụng web.  \n− Thực hành suy nghĩ có phê phán, sáng tạo trong việc xây dựng một ứng dụng web chất \nlượng.  \n 275 − Hiểu và giải thích được cơ chế hoạt động của các ứng dụng web được khai thác phân \ntán qua môi trường Internet, quy trình xây dựng một ứng dụng web từ lúc hình thành ý \ntưởng đến lúc triển khai.  \n− Sử dụng các công nghệ, ngôn ngữ lập trình để xây dựng một ứn g dụng Web hoàn chỉnh.  \n− Hiểu được sự cơ chế hoạt động của các loại Web API, tạo ra và triển khai các Web API \ncho các hệ thống khác sử dụng.   \n− Giải thích được hoạt động của các lỗi bảo mật trên môi trường Internet. Phân tích được \nmột số lỗi bảo mật trong một  ứng dụng Web và áp dụng các kỹ thuật để xây dựng một \nứng dụng Web đáp ứng một số mức độ an toàn cơ bản.  \n− Áp dụng một số kỹ thuật hỗ trợ xây dựng ứng dụng Web như các thư viện hỗ trợ lập \ntrình, các mã nguồn mở, một số công nghệ mới và phổ biến, sử dụng được  các Web \nAPI có sẳn trong việc hỗ trợ xây dụng ứng dụng Web…  \n Nội dung học phần   \n− Tổng quan về Internet và ngôn ngữ HTML  \n− Chương 2. Trình bày trang web bằng CSS  \n− Chương 3. Ngôn ngữ PHP  & Thiết kế giao diện nhập liệu với HTML  \n• Slide: (chapter 02)  \n− Chương 4. Tru yền nhận dữ liệu qua môi trường web và lập trình cơ sở dữ liệu với PHP \nvà MySQL  \n− Chương 5. Lập trình Client  \n• Slide: Chapter 04  \n− Chương 6. Lập trình web với kỹ thuật AJAX  \n− Chương 7. Mô hình Model - View - Controller  \n− Chương 8. Session, Cookies, File, Email  \n− Chươ ng 9. Web API  \n− Chương 10. Một số vấn đề bảo mật của ứng dụng web  \n− Chương 11. Mã nguồn mở  \n− Chương 12. Sử dụng các dịch vụ WebAPI có sẳn  \n− Chương 13. Một số thư viện hỗ trợ xây dựng ứng dụng web  \n− Chương 14. Một số hệ quản trị CSDL phân tán  \n− Tổng kết  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− The Web Application Hacker's Handbook: Discovering and Exploiting Security Flaws, \nDafydd Stuttard, Wiley, 2007.  \n− HTML5 for dummies : elearning kit, Boum phrey Frank, John Wiley & Sons, 2012.  \n− HTML, CSS & JavaScript mobile development for dummies, Harrel William, John \nWiley & Sons, 2011.  \n− Pro JavaScript Design Patterns, Dustin Diaz & Ross Harmes, Apress, 2008  \nCông cụ hỗ trợ  "
}