{
    "course_id": "CSC15001",
    "course_name": "An ninh máy tính",
    "course_start_page": 109,
    "course_end_page": 110,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC15001  – An ninh máy tính  \n \n Thông tin chung  \n− Mã học phần  : CSC15001  \n− Tên tiếng Anh  : Computer Security  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Hệ điều  hành   \n Mô tả học phần  \nMôn học này cung cấp cho sinh viên những kiến thức cơ bản về vấn đề an toàn thông tin điện \ntử, an toàn hệ thống. Bên cạnh đó, môn học còn cung cấp những kiến thức giúp sinh viên có \nthể hiểu được các nguy cơ tiềm ẩn trong thời đại công nghệ thông tin hiện nay; ứng dụng những \nkiến thức đó để xây dựng các giải pháp an ninh thông  tin; thiết kế, xây dựng và vận hành các \nhệ thống máy tính (bao gồm cả chính sách sử dụng thông tin) một cách an toàn.Qua môn học, \nsinh viên nhận thức được về đạo đức và trách nhiệm trong vấn đề sử dụng thông tin.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Hiểu được các khái niệm, thuật ngữ chuyên ngành trong lĩnh vực an ninh thông tin.  \n− Hiểu được các lỗ hổng bảo mật và cách khắc phục.  \n− Hiểu rõ các nguy cơ và các cách khắc phục trong vấn đề an toàn mạng có dây.  \n− Hiểu rõ các nguy cơ và các  cách khắc phục trong vấn đề an toàn mạng không dây.  \n− Biết được các tiêu chuẩn trong việc xây dựng các chính sách bảo mật.  \n− Vận dụng các kiến thức được cung cấp để triển khai một hệ thống an toàn, bảo mật  \n− Biết bảo vệ an toàn thông tin của mình và không xâm h ại thông tin của người/tổ chức \nkhác.  \n Nội dung học phần    \n 110 − Nhắc lại các kiến thức căn bản  \n− Các phương pháp phân tích và tìm kiếm thông tin  \n− Các nguy cơ mất thông tin  \n− Các phương pháp nâng cao an toàn thông tin  \n− Bảo mật Web  \n− Wireless Security  \n− Lập trình an toàn  \n− Chín h sách an toàn toàn thông tin (ISO 17799 -27002)  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− Bài giảng môn An Ninh Máy Tính  \nCông cụ hỗ trợ  "
}