{
    "course_id": "CSC13003",
    "course_name": "Kiểm thử phần mềm",
    "course_start_page": 171,
    "course_end_page": 172,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC13003  – Kiểm th ử phần mềm \n \n Thông tin chung  \n− Mã học phần  : CSC13003  \n− Tên tiếng Anh  : Software Testing  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :  Nhập môn Công ngh ệ phần mềm   \n Mô tả học phần  \nMôn học sẽ cung cấp những kiến thức và kỹ thuật cơ bản giúp sinh viên có thể nắm những khái \nniệm và làm việc trong lĩnh  vực QA, QC của một công ty phần mềm. Ngoài những kiến thức \nliên quan đến kỹ năng kiểm chứng phần mềm, sinh viên sẽ làm quen với các công cụ nguồn \nmở hỗ trợ cho việc kiểm chứng phần mềm. SV sau khi hoàn thành khóa học sẽ nắm được các \nkỹ năng lập kế hoạch, phân tích chiến lược, thiết kế test case và quản lý quy trình kiểm chứng \nphần mềm và các kỹ thuật kiểm thử phần mềm.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để trình bày một số báo cáo kỹ thuật theo \nmẫu cho trước trong lĩnh vực kiểm chứng phần mềm  \n− Biết và giải thích được các thuật ngữ tiếng Anh thuộc lĩnh vực Kiểm chứng phần mềm  \n− Giải thích được các khái niệm cơ bản, thuật ngữ, trách nhiệm, công việc và nguyên tắc \nđạo đức cơ bản... thuộc lĩn h vực Kiểm chứng phần mềm  \n− Áp dụng các kỹ thuật kiểm thử hộp đen và kiểm thử hộp trắng để thiết kế các trường \nhợp kiểm thử phần mềm  \n− Phân tích chiến lược và lập kế hoạch kiểm thử  \n− Quản lý qui trình kiểm thử  \n− Thực hiện kiểm thử phần mềm với nhiều loại kiểm thử khác nhau  \n− Sử dụng các công cụ phần mềm hỗ trợ   \n 172 \n Nội dung học phần   \n− Giới thiệu môn học  \n− Tổng quan kiểm thử phần mềm  \n− Kiểm thử trong vòng đời phần mềm  \n− Phân tích yêu cầu kiểm thử & Thiết kế kiểm thử  \n− Phân hoạch tương đương và phân tích giá trị biên  \n− Đồ thị nhân quả và Bảng quyết định  \n− Lược đồ chuyển trạng thái & Kiểm thử dựa trên đặc tả Use -case \n− Quản lý qui trình kiểm thử  \n− Kiểm thử đơn vị  \n− Kiểm thử tự động  \n− Kiểm thử giao diện và tính tiện dụng  \n− Kiểm thử bảo mật  \n− Kiểm thử hiệu năng  \n− Kiểm thử ứng dụng di động  \n− Ôn tập  \n Tài n guyên học phần  \nGiáo trình  \n− Testing computer Software, Second Edition, by Kaner, Falk, and Nguyen, Wiley \nPublishers, 1999.  \nTài liệu tham khảo  \n− Practical Software Testing, Ilene Burnstein, Springer, 2003.  \n− The art of Software Testing, Second Edition, Glenford J. Myers, John Wiley & Sons, \nInc, 2004.  \nCông cụ hỗ trợ  \n− Visual Studio .NET  \n− NUnit  \n− Selenium  "
}