{
    "course_id": "CSC15007",
    "course_name": "Thống kê máy tính và ứng dụng",
    "course_start_page": 239,
    "course_end_page": 240,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC15007  – Thống kê máy tính và ứng dụng \n \n Thông tin chung  \n− Mã học phần  : CSC15007  \n− Tên tiếng Anh  : Computer Statistics and Applications  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập   : 0 \n− Học phần học trước  : Xác suất thống kê, Nhập môn lập trình    \n Mô tả học phần  \nMôn học nhằm giúp sinh viên hiểu và áp dụng hồi quy tuyến tính để xây dựng mô hình khớp \nvới tập dữ liệu thực tế, hiểu và áp dụng phương pháp phân loại; hiểu và áp dụng các mô hình \nhỗn hợp Gaussian (GMM), mô hình Markov ẩn (HMM) cho các vấn đề công nhận cho hình \nảnh và giọng nói. Sinh viên cũng có khả năng sử dụng các phân mềm thống kê số liệu như \nexcel, R.... Thêm vào đó, sinh viên còn có thể áp dụng được các kỹ năng như việ c theo nhóm, \ntruyền thông và tiếng Anh. Ngoài ra, về mặt thái độ, sinh viên biết về đạo đức nghề nghiệp, \ntrách nhiệm.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để giải quyết các bài toán thống kê bằng \ntay hoặc bằng máy.  \n− Kỹ năng ngoại ngữ: hiểu các thuật ngữ, đọc được tài liệu tiếng Anh.  \n− Xây dựng tư duy phân tích và phản biện. Hiểu và áp dụng các kiến thức cơ bản về thố ng \nkê mô tả. Hiểu và áp dụng một số mô hình thống kê cho các bài toán cụ thể.  \n− Sử dụng các công cụ phần mềm hỗ trợ. Biết về đạo đức nghề nghiệp, tinh thần trách \nnhiệm.  \n Nội dung học phần    \n 240 Phần I: Các vấn đề cơ bản  \nChương 1. Lấy mẫu  \nMục 1.1 Lấy mẫu thống kê  \nMục 1.2 Lấy mẫu phi thống kê  \nChương 2. Thống kê mô tả  \nMục 2.1 Các trị số thống kê mô tả  \nMục 2.2 Các loại biểu đồ  \nPhần II: Hồi quy tuyến tính  \nChương 3. Mô hình hồi quy tuyến tính đơn  \nMục 3.1 Xây dựng mô hình hồi quy tuyến tính đơn  \nMục 3.2 Kiểm định mô hình hồi quy tuyến tính đơn  \nMục 3.2 Các bài toán về mô hình hồi quy tuyến tính đơn  \nChương 4. Mô hình hồi quy tuyến tính bội  \nMục 4.1 Xây dựng mô hình hồi quy tuyến tính bội  \nMục 4.2 Kiểm định mô hình hồi quy tuyến tính bội  \nMục 4.2 Các bài toán về mô hình hồi quy tuyến tính bội  \nPhần III: Các ứng dụng khác  \nChương 5. Phân lớp Naïve Bayes   \nMục 5.1 Phân lớp Naïve Bayes   \nMục 5.2 Khai thác luật kết hợp  \nChương 6. Mô hình Gauss trộn  \nMục 6.1 Nhắc lại về phân phối chuẩn  \nMục 6.2 Mô hình Gauss trộn  \nChương 7. Mô hình Markov ẩn  \nMục 7.1 Xích Markov  \nMục 7.2 Mô hình Markov ẩn  \n Tài nguyên học phần  \nGiáo trình  \n− Thống kê máy tính và ứng dụng, NGUYỄN Đ. THÚC, ĐẶNG H. VÂN, LÊ PHONG, \nnxb KHKT, 2010.  \nTài liệu tham khảo  \n− Pattern Recognition and Machine Learning, Christopher Bishop, S pringer, 2006.  \n− Applied Probability and Statistics in Engineering, Douglas C. Montgomery, George C. \nRunger,  Wiley, 2002.  \n− Introduction to Machine Learning, 2nd, Ethem Alpaydin, MIT Press, 2010.  \n− Phân tích số liệu và tạo biểu đồ bằng R, Nguyễn Văn Tuấn, nxb K HKT, 2007.  \n− Help của R.  \nCông cụ hỗ trợ  "
}