{
    "course_id": "CSC11107",
    "course_name": "Truyền thông kỹ thuật số",
    "course_start_page": 124,
    "course_end_page": 125,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC11107  – Truy ền thông k ỹ thuật số \n \n Thông tin chung  \n− Mã học phần  : CSC11107  \n− Tên tiếng Anh  : Digital Communications  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn học nhằm cung cấp cho sinh viên những kiến thức chuyên sâu về chuyên ngành Mạng \nmáy tính và viễn thông. Môn học giúp sinh viên có kiến thức về truyền tín hiệu dải gốc và dải \nthông bằng điều biến, lý thuyết thông tin và mã hóa, dung lượng kênh và mã hóa sửa lỗi. Môn \nhọc cũng giúp cho sinh viên hiểu rõ và sâu hơn về hoạt động của tầng vật lý và tầng liên kết. \nMôn học cũng cung cấp cho sinh viên kĩ năng sử  dụng các tiện ích giả lập để xây dựng mô \nphỏng hệ thống phục vụ cho việc nghiên cứu sau này.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và nhóm trình bày một số báo cáo kỹ thuật trong lĩnh vực \nMạng máy tính và viễ n thông  \n− Biết và giải thích được các thuật ngữ tiếng Anh thuộc chuyên ngành Mạng máy tính và \nviễn thông  \n− Hiểu được các khái niệm cơ bản về truyền thống kỹ thuật số  \n− Hiểu và trình bày được điều biến xung (PM) và điều biến xung mã (PCM)  \n− Hiểu và trình bày được đ iều biến tương tự và điều biến số  \n− Hiểu và trình bày được lý thuyết thông tin và mã hóa  \n− Hiểu và trình bày được mã hóa kênh  \n− Sử dụng các công cụ phần mềm hỗ trợ  \n  \n 125  \n Nội dung học phần   \n− Giới thiệu & tổng quan truyền thông kỹ thuật số  \n− Truyền tính hiệu dải gốc  \n− Điều  biến tương tự  \n− Điều biến số nhị phân  \n− Điều biến số đa mức  \n− Mã hóa nguồn  \n− Mã hóa khối tuyến tính  \n− Mã hóa chập  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− Digital Communications, Proakis J.G, McGraw Hill, USA, 2001.  \n− Digital Communications: Fundamentals and Applications, Bernard Sklar, Prentice Hall \nP T R, 2001.  \n− Nguyên lý thông tin tương tự - số, Vũ Đình Thành, NXB ĐHQG TPHCM, 2006.  \nCông cụ hỗ trợ  \n− Matlab  "
}