{
    "course_id": "CSC14111",
    "course_name": "Nhập môn thiết kế và phân tích giải thuật",
    "course_start_page": 217,
    "course_end_page": 218,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC14111  – Nhập môn thi ết kế và phân tích gi ải thu ật \n \n Thông tin chung  \n− Mã học phần  : CSC14111  \n− Tên tiếng Anh  : Introduction to Design and Analysis of Algorithms  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Data Structures and Algorithms   \n Mô tả học phần  \nThis course is an introduction to design and analysis of algor ithms. You will learn about \nalgorithms that operate on common data structures, for instance sorting and searching; \nadvanced design techniques such as divide -and-conquer, dynamic programming and greedy \nalgorithms. You will also learn how to analyze the effi ciency of algorithms.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n−  Analyze the asymptotic performance of algorithms  \n− Demonstrate a familiarity with major algorithms and data structures  \n− Design efficient and correct algorithms using sophisticated data structures for complex \ncomputational tasks  \n Nội dung học phần   \n− General introduction to design and analysis of algorithms  \n− Fundamentals of the analysis of algorithm efficiency  \n− Brute -force technique  \n− Backtracking technique  \n− Divide -and-conquer technique  \n− Decrease -and-conquer technique  \n− Space and time trade -offs technique   \n 218 − Dynamic programming  \n− Greedy technique  \n Tài nguyên học phần  \nGiáo trình  \n− Anany Levitin, Introduction to the Design and Analysis of Algorithms, 3rd Edition, \nPearson, 2012.  \nTài liệu tham khảo  \n− Thomas H. Cormen, Charles E. Leiserson, Ronald L. Rivest, Clifford Stein, \nIntroduction to Algorithms, 3rd Edition, The MIT Press, 2009.  \n− Hand -outs, Internet are also useful resources for learning.  \nCông cụ hỗ trợ  "
}