{
    "course_id": "CSC14003",
    "course_name": "Cơ sở trí tuệ nhân tạo",
    "course_start_page": 96,
    "course_end_page": 97,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC14003  - Cơ s ở trí tu ệ nhân t ạo  \n \n Thông tin chung  \n− Mã học phần  : CSC14003  \n− Tên tiếng Anh  : Fundamentals of Artificial Intelligence  \n− Khối kiến thức: Bắt buộc  - Cơ sở ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nThe course is designed to provided students guides to fundamental problems in AI, including \nsolving problems by searching, representing knowledge and reasoning, building intelligent \nentities through machine learning. When problems can be formulated as search problems, \ngeneral -purpose search strategi es are employed in terms of uninformed search or informed \nsearch (i.e. with/without further information during the search). Special search problems, such \nas adversarial search and constraint satisfaction problem, are also introduced for \ncomprehension. Gene ric representation of knowledge in intelligent systems is usually required \nbecause computers cannot fully grasp the semantic of natural languages. Propositional and \nfirst-order logic are helpful means for such purpose. Student are guided to use notions of these \nlogics and apply basic inference processes for small world problems. Finally, a rational agent \ncould not be practical without the ability of improving their skills through experience. Basic \nmachine learning concepts as well as conventional approaches  to achieve such goal are \nintroduced in this part. During the course, students are going to study fundamental terms and \nconcepts in AI so as to use them in appropriate contexts. They are also asked to improve their \nproblem -solving and programming skills by  completing the requirements of assignments and \nlabs. \n Mục tiêu của học phần   \n 97 Sau khoá học, sinh viên có khả năng:  \n− Formulate fundamental AI problems using appropriate concepts and terminologies  \n− Develop search agents to solve common problem -solving tasks  \n− Deve lop logical agents of which knowledge is represented using either propositional \nlogic or first -order logic  \n− Develop simple learning agents that learn by observations  \n− Raise hypotheses and assess them through theoretical and/or empirical evaluations  \n Nội dung học phần   \n− Introduction to AI  \n− Intelligent Agents  \n− Solving Problem by Searching: Basic concepts and Uninformed search  \n− Solving Problem by Searching: Informed search  \n− Local Search  \n− Adversarial Search  \n− Constraint Satisfaction Problem  \n− Midterm Examination  \n− Propositional Logic: Basic concepts  \n− Propositional Logic: Inference Mechanisms  \n− First-Order Logic: Syntax, Semantics, and Inference Mechanisms  \n− Machine learning: Basic concepts and ID3 Decision tree  \n− Perceptron and Multi -layer neural networks  \n− Reviews  \n Tài nguyên học phần  \nGiáo trình  \n− Stuart Russell and Peter Norvig. April 2020. Artificial Intelligence: A Modern \nApproach (4th ed.). Pearson.  \n− Lê Hoài Bắc, Tô Hoài Việt. 2014. Giáo trình Cơ sở Trí tuệ nhân tạo. Khoa Công nghệ \nThông tin.  \nTài liệu tham khảo  \n− Negnevitsky, Michael. Artificial intelligence: A guide to intelligent systems. Pearson \nEducation, 2005.  \nCông cụ hỗ trợ  "
}