{
    "course_id": "CSC11113",
    "course_name": "Quản trị dịch vụ mạng",
    "course_start_page": 126,
    "course_end_page": 127,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC11113  - Quản trị dịch vụ mạng \n \n Thông tin chung  \n− Mã học phần  : CSC11113  \n− Tên tiếng Anh  : Computer and Network Service Administration  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn học này nhằm cung c ấp cho sinh vi ên các kiến thức cơ bản và nâng cao trong qu ản trị các \ndịch vụ mạng (ki ến thức về hệ điều hành: qu ản lý người dùng, qu ản lý hệ thống tập tin, qu ản \nlý và cài đặt phần mềm...; ki ến thức về mạng m áy tính: thi ết lập cấu hình m ạng, c ác dịch vụ: \nDNS, DHCP, SSH, FTP, Web, Mail, Firewall, VPN, Proxy...). M ôn học đề cao s ự thực hành, \nsinh vi ên cần thực hiện một hệ thống m ạng áp dụng cho doanh nghi ệp vừa và nhỏ trong su ốt \ntrong qu á trình học, giúp tiếp cận gần hơn với thực tế và thông qua đ ó sinh vi ên hình th ành các \nkiến thức, kỹ năng để xây dựng các mô hình và giải pháp cho h ệ thống m ạng doanh nghi ệp. \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Sử dụng các kĩ năng cá nhân và làm việc nhóm để phân tích, tri ển khai c ác công ngh ệ \nsử dụng nền tảng Linux, Windows Server  \n− Có khả năng ph ân biệt và so sánh được các thu ật ngữ tiếng Anh li ên quan đ ến các dịch \nvụ mạng trên môi trường Linux, Windows Server.  \n− Có khả năng phân tích, tư duy, ph ác thảo ở mức hệ thống để phát hiện, kh ắc phục các \nsự cố xảy ra trong qu á trình thi ết kế, triển khai, v ận hành các dịch vụ mạng sử dụng \nLinux, Windows Server.  \n− Có khả năng qu ản trị được hệ điều hành Linux, Windows Server  \n− Có khả năng qu ản trị được các dịch vụ trong m ạng nội bộ  \n 127 − Có khả năng qu ản trị được các dịch vụ mạng tr ên mạng Internet  \n− Có khả năng tri ển khai đ ược các ứng dụng m ạng tr ên môi trường Linux, Wind ows \nServer đ ược sử dụng rộng rãi trong th ực tế. \n Nội dung học phần   \n− Giới thiệu HDH Linux, Windows Server  \n− Công cụ dòng lệnh Linux Qu ản lý người dùng \n− Phân quy ền hệ thống tập tin \n− Cài đặt phần mềm  \n− Quản lý đĩa cứng Qu ản lý tiến trình \n− Lập trình Bash Shell  \n− Cơ bản về mạng trên Linux, Windows Server  \n− Dịch vụ SSH \n− Dịch vụ DHCP  \n− Dịch vụ DNS  \n− Dịch vụ Web D ịch vụ FTP \n− Dịch vụ Mail  \n− Dịch vụ NAT D ịch vụ Firewall  \n− Dịch vụ VPN D ịch vụ Proxy  \n− Thuy ết trình \n Tài nguyên họ c phần  \nGiáo trình  \nTài liệu tham khảo  \n− Giáo trình M ạng m áy tính, Mai V ăn Cường, Tr ần Trung D ũng, Tr ương Th ị Mỹ Trang, \nĐào Anh Tu ấn, Lê Ngọc Sơn, Lê Giang Thanh.  \n− Giáo trình H ệ điều hành, Tr ần Trung D ũng, Ph ạm Tu ấn Sơn. \n− TCP/IP Network Administration, Craig Hunt.  \n− Mastering Linux Network Administration, Jay LaCoix.  \n− A Practical Guide to Linux Commands, Editors, and Shell Programming (3rd Edition), \nMark G. Sobell  \n− Pro Linux System Administration (Expert's Voice in Open Source) , James Turnbull, \nPeter Lieverdink and Dennis Matotek  \n− Windows Server 2016 Inside Out, Orin Thomas.  \n− Windows Server 2016 Unleashed, Rand Marimoto.  \nCông cụ hỗ trợ  \n− VMware Workstation  \n− Oracle VM VirutalBox  \n− CentOS 7.x  \n− Ubuntu 19.x  \n− Microsoft Windows Server 2008/201 2/2016  "
}