{
    "course_id": "CSC14117",
    "course_name": "Nhập môn lập trình kết nối vạn vật",
    "course_start_page": 229,
    "course_end_page": 230,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC14117  – Nhập môn l ập trình k ết nối vạn vật \n \n Thông tin chung  \n− Mã học phần  : CSC14117  \n− Tên tiếng Anh  : Introduction to IoT Programming   \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Nhập môn lập trình, C ấu trúc dữ liệu   \n Mô tả học phần  \nHọc phần sẽ cung c ấp cho sinh vi ên kiến thức cơ bản để xây dựng m ột hệ thống kết nối vạn \nvật. Kiến thức cơ bản bao g ồm (A) thi ết kế phần cứng cơ bản để đọc thông tin t ừ cảm biến và \nđiều khi ển thiết bị ngoại vi; (B) l ập trình tr ên thiết bị nhúng nh ư arduino, esp32, raspberry pi; \n(C) c ác kỹ thuật giao ti ếp có dây và không dây cơ bản giữa các thiết bị như TTL, I2C, SPI, \nbluetooth, wifi, ...; (D) gi ới thiệu các kỹ thuật kết nối và lưu trữ dữ liệu lên máy chủ; (E) gi ới \nthiệu các kỹ thuật kết nối tới điện tho ại di đ ộng. H ọc phần cũng gi úp sinh vi ên có những tr ải \nnghiệm thực tế về quá trình xây dựng m ột hệ thống kết nối vạn vật ở mức độ đơn giản một \ncách có hệ thống và có phương ph áp. Nh ững ki ến thức này là nền tảng gi úp sinh vi ên có thể \ntham gia v ào các dự án về chuy ển đổi số trong th ực tế. \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Hiểu biết tổng quan v ề hệ thống kết nối vạn vật \n− Hiểu biết cấu tạo phần cứng cơ bản về các cảm biến, thi ết bị điều khi ển, thi ết bị hiển \nthị \n− Lập trình được trên các thiết bị nhúng Arduinos  \n− Lập trình được trên các thiết bị nhúng Esp8266, Esp32  \n− Lập trình được trên các thiết bị nhúng Raspberry Pi  \n− Lập trình m ột hệ thống kết nối vạn vật đơn giản, ho àn thiện  \n 230 − Có khả năng tự tìm hiểu và đào sâu hơn về hệ thống kết nối vạn vật \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để trình bày và đề xuất xây dựng m ột dự \nán trong l ĩnh vực kết nối vạn vật \n Nội dung học phần   \n− Giới thiệu tổng quan v ề hệ thống kết nối vạn vật và ứng dụng \n− Lập trình tr ên nền tảng Arduino  \n− Lập trình tr ên nền tảng Esp32  \n− Lập trình hệ thống IoT tr ên máy tính nh úng raspberry pi  \n− Lập trình hệ thống kết nối vạn vật đơn giản, ho àn thiện \n− Các nền tảng IoT th ông dụng tr ên cloud  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− Khóa học online \"An Introduction to Programming the Internet of Things (IOT) \nSpecialization\", https://www.coursera.org/specializations/iot  \n− Michael Margolis, “Arduino Cookbook, 2nd Edition”, O'Reilly Media, Inc., December \n2011, ISBN: 9781449313876  \n− Các khóa học về ESP: https://www.espressif.com/en/ecosystem/iot - college/courses  \n− Các sách về ESP: https://www.espressif.com/en/ecosystem/iot -college/books  \n− Các sách về Raspberry Pi: https://magpi.raspberrypi.org/books  \nCông cụ hỗ trợ  "
}