{
    "course_id": "CSC13006",
    "course_name": "Quản lý dự án phần mềm",
    "course_start_page": 176,
    "course_end_page": 178,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC13006  – Quản lý d ự án ph ần mềm \n \n Thông tin chung  \n− Mã học phần  : CSC13006  \n− Tên tiếng Anh  : Software Project Management  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Nhập môn công nghệ phần mềm, Phương pháp lập trình \n      hướng đối tượng   \n Mô tả học phần  \nHọc phần giới thiệu các quy trình để lập kế hoạch, triển khai vận hành và đánh giá một dự án \nphần mềm. Các chủ đề trọng tâm bao gồm các mô hình sản xuất phần mềm (từ m ô hình chu kỳ \nsống tổng quát cho đến những quy trình cụ thể như thác nước, RUP, Scrum với những hoạt \nđộng được đặc tả một cách chi tiết) và phương pháp quản l í dự án (xác định phạm vi dự án, \nphân tích tính khả thi, tạo lịch trình và phân phối tài nguyên, xác định chi phí, thương thảo hợp \nđồng, kiểm tra theo dõi dự án, quản lý con người, quản lý thay đổi, quản l í rủi ro, quản lý cấu \nhình, quản lý chất lượng dự án, đánh giá kết quả dự án). Học phần cũng giới thiệu tổng quan \nvề các mô hình và chuẩn đánh giá cấp độ trưởng thành và cải tiến chất lượng quy trình phát \ntriển phần mềm.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Giải thích, so sánh được phương pháp hoạt động, các sản phẩm, các vai trò tham gia \ntrong các mô hình phát triển phần mềm (thác nước và các biến thể, xoắn ốc, Vee, lặp \nvà tăng dần (IID), linh hoạt (Agile), Scrum và RUP).  \n− Áp dụng được các hoạt động quản lý trong một dự án phần mềm bao gồm xác định \nphạm vi dự án, phân tích tính khả thi, tạo lịch trình và phân phối tài nguyên, x ác định  \n 177 chi phí, thương thảo hợp đồng, kiểm tra theo dõi dự án, quản lý con người, quản lý thay \nđổi, quản l í rủi ro, quản lý cấu hình, quản lý chất lượng dự án, đánh giá kết quả dự án.  \n− Phân biệt, so sánh và áp dụng được các phương pháp để ước lượng chi ph í và thời gian \nsản xuất phần mềm.  \n− Diễn giải được các chuẩn liên quan đến quy trình sản xuất phần mềm.  \n− Sử dụng được các công cụ để quản lý dự án, quy trình.  \n− Xây dựng và quản lý được nhóm để chuẩn bị và thuyết trình một vấn đề cho trước trong \n15 - 20 phút và  xây dựng được phần mềm kích cỡ khoảng 75.000 dòng mã nguồn theo \nmột mô hình.  \n− Nhận thức được trách nhiệm và đạo đức của mình khi quản lý một dự án phần mềm.  \n Nội dung học phần   \n− Mô hình chu kỳ sống của phần mềm và quy trình phần mềm  \n− Quản trị nhóm phát triển phần mềm  \n− Lập kế hoạch cho dự án phần mềm  \n− Vận hành, kiểm soát, theo dõi, báo cáo và đánh giá dự án phần mềm  \n− Quản lý rủi ro phần mềm  \n− Quản lý cấu hình phần mềm  \n− Quản lý chất lượng phần mềm  \n− Các mô hình phát triển phần mềm (thác nước và các biến thể, xoắn ốc, Ve e, lặp và tăng \ndần (IID), linh hoạt (Agile), Scrum và RUP)  \n− Ước lượng phần mềm  \n− Mô hình cải tiến quy trình phần mềm CMMI  \n Tài nguyên học phần  \nGiáo trình  \n− A Guide to the Project Management Body of Knowledge. 4rd Edition, Project \nManagement Institute, 2008  \nTài liệu tham khảo  \n− Applied Software Project Management,   Jennifer Greene and Andrew Stellman, 2005.  \n− Theory -W Software Project Management : Principles and Examples, BW Boehm and \nR Ross, 1989.  \n− Mastering the Requirements Process, Suzanne Robertson and James Robertson, 2006.  \n− Practice Standard for Earned Value Management, Project Management Institute, 2005.  \n− Software risk management: principles and practices, BW Boehm, 1991  \n− Configuration Management Principles and Practice, Anne Mette Jonassen Hass, 2002.  \n− Factors in Software Quality, J.A. McCall et al.., 1977.  \n− Agile and Iterative Development: A Manager's Guide,  Craig Larman, 2003.  \n− Agile Project Management with Scrum, Ken Schwaber,  2004.  \n− The Rational Unified Process Made Easy: A Practitioner's Guide to the RUP, Per Kroll \nand Philippe Kruchten, 2003.  \n− Software Estimation: Demystifying the Black Art, Steve McConnel l, 2006.  \n− Interpreting the CMMI: A Process Improvement Approach, Margaret K. Kulpa and \nKent A. Johnson, 2003  \nCông cụ hỗ trợ   \n 178 − MS Project  "
}