{
    "course_id": "CSC16002",
    "course_name": "Phương pháp toán trong phân tích dữ liệu thị giác",
    "course_start_page": 249,
    "course_end_page": 250,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC16002  – Phương pháp toán trong phân tích d ữ liệu thị giác \n \n Thông tin chung  \n− Mã học phần  : CSC16002  \n− Tên tiếng Anh  : Mathematical Methods for Visual Information Analysis  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Nhập môn l ập trình   \n Mô tả học phần  \nMôn học cung cấp các kiến thức nền tảng về Toán và chỉ rõ các kiến thức này được ứng dụng \ncụ thể như thế nào trong các lĩnh vực xử lý thông tin thị giác như Đồ họa máy tính, Xử lý ảnh \nsố và video số, Thị giác máy tính, nhằm đáp ứng nhu cầu nghiên cứu và phát triển các ứng \ndụng thực tế. Nội dung gồm các phần chính như Không gian metric;  Giải hệ phương trình tuyến \ntính, Phương pháp bình phương tối tiểu, Giá trị riêng -vector riêng, Giải phương trình phi tuyến, \nPhương pháp tối ưu không ràng buộc và có ràng buộc, Phương pháp nội suy, Giải phương trình \nvi phân, Giải phương trình đạo hàm riêng . Ngoài ra, môn học còn cung cấp các kỹ năng sử \ndụng thành thạo thư viện tính toán Matlab trong xử lý thông tin thị giác.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Có khả năng báo cáo và ứng dụng các kiến thức trong lĩnh vực PPTXLA ở mức độ cá \nnhân và nhóm.  \n− Dịch tài liệu tiếng Anh thuộc chuyên ngành PPTXLA  \n− Phân tích và giải quyết vấn đề liên quan đến PPTXLA  \n− Diễn giải và ứng dụng không gian metric và các định lý liên quan vào lĩnh vực ĐHMT, \nXLA, TGMT.  \n− Diễn giải và ứng dụng phương pháp g iá trị riêng -vector riêng vào lĩnh vực ĐHMT, \nXLA, TGMT.   \n 250 − Diễn giải và ứng dụng phương pháp giải phương trình phi tuyến vào lĩnh vực ĐHMT, \nXLA, TGMT.  \n− Diễn giải và ứng dụng phương pháp tối ưu vào lĩnh vực ĐHMT, XLA, TGMT.  \n− Diễn giải và ứng dụng phương pháp giả i phương trình vi  phân, đạo hàm riêng vào lĩnh \nvực ĐHMT, XLA, TGMT.  \n Nội dung học phần   \n− Giới thiệu về  PPT trong hệ thống xử lý TTTG.  \n− Giới thiệu về  PPT trong hệ thống xử lý TTTG (tt)  \n− Không gian metric  \n− Ánh xạ co và định lý ánh xạ co  \n− Ứng dụng không gian met ric trong ĐHMT, XLA.  \n− Phương pháp giá trị riêng -vector riêng.  \n− Phương pháp giá trị riêng -vector riêng (tt)  \n− Ứng dụng phương pháp giá trị riêng -vector riêng trong hệ thống xử lý TTTG.  \n− Phương pháp giải phương trình phi tuyến.  \n− Ứng dụng phương pháp giải phương trình phi tuyến.trong hệ thống xử lý TTTG.  \n− Phương pháp tối ưu  \n− Ứng dụng phương pháp tối ưu trong hệ thống xử lý TTTG.  \n− Phương pháp giải phương trình vi  phân.  \n− Ứng dụng phương pháp giải phương trình vi  phân trong hệ thống xử lý TTTG.  \n− Phương pháp giải phương trình đạo hàm riêng.  \n− Ứng dụng phương pháp giải phương trình đạo hàm riêng trong hệ thống xử lý TTTG.  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− Digital Image Processing. Rafael C. gonzalez, Richard E. Woods, Prentice -Hall, Inc, \n2004.  \n− Visual Information Retrieval. Alberto Del Bimbo, Morgan Kaufmann Publishers, Inc. \n1999.  \nCông cụ hỗ trợ  \n− Visual Studio .NET  \n− Matlab  "
}