{
    "course_id": "CSC14006",
    "course_name": "Nhận dạng",
    "course_start_page": 213,
    "course_end_page": 214,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC14006  – Nhận dạng \n \n Thông tin chung  \n− Mã học phần:  CSC14006  \n− Tên tiếng Anh: Pattern Recognition  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :  Introduction to artificial intelligence  \n Mô tả học phần  \nThe course is designed to provide students:  \n1. The foundations of pattern recognition, i.e. how patterns are recognized on the \ncomputer.  \n2. Wide understanding of different related topics, i.e., pattern recognition systems, \npreprocessing and feature extraction, theories of supervised and unsupervised le arning, \nobject classification and recognition, deep neural networks, and other topics as well.  \n3. With sufficient background in the theoretical concepts behind stages of pattern \nrecognition systems, and to implement these systems using computer applicatio ns. \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Learn about pattern recognition and its broad applications in various aspects of our day \nto day life.  \n− Understand the algorithms used in various phases of pattern recognition systems, \nincluding data acquisition, pre -processing, segmentation, feature extraction, and \nclassification.  \n− Understand the techniques used recognize patterns, such as statistical approaches, data \nclustering, neural networks, etc.   \n 214 − Knowledge of various applications of pattern r ecognition in real life, this includes \nreading research papers and preparing presentations by the students.  \n− Writing pattern recognition programs and implement the various techniques discussed \nthroughout the course.  \n Nội dung học phần   \n− Class overview: Class organization, topics overview, software etc.  \n− Pattern recognition: Introduction to Biometric Systems  \n− Various phases of pattern recognition systems  \n− Feature extraction,  object detection and classification using Local binary pattern (LBP)  \n− Feature extraction using Principal Component Analysis (PCA) and Linear Discriminant \nAnalysis (LDA).  \n− Data clustering, Classification and Template matching (algorithms:  K -mean, k -nearest \nneighbor and Support vector machine).  \n− Various phases of Face Recognition System, includin g face detection, face alignment, \nfeature extraction, feature matching  and their applications.  \n− An introduction to Deep Learning:  \n− Deep learning architectures  \n− Deep Learning Tutorial: Why Deep? Tips for Training Deep Neural Network.  \n− Deep learning architectur es: convolutional neural networks (CNNs) and their \napplications.  \n− Presentations  \n− Review  \n Tài nguyên học phần  \nGiáo trình  \n− Pattern Classification 2nd Edition, Richard O. Duda, Peter E. Hart, and David G. Stork \nWiley, 2004.  \n− Handbook of Biometrics, Anil K. Jain, Patrick Flynn, and Arun A. Ross, Springer, \n2008.  \n− Handbook of Face recognition, Stan Z. Li and Anil K. Jain, Springer, 2011.  \n− Deep Learning for Computer Vision with Python, Starter Bundle, Dr. Adrian \nRosebrock, 2017.  \n− Deep Learning for Computer Vision w ith Python, Practitioner Bundle, Dr. Adrian \nRosebrock, 2017.  \nTài liệu tham khảo  \n− http://www.pyimagesearch.com/contact  \nCông cụ hỗ trợ  "
}