{
    "course_id": "CSC11106",
    "course_name": "Truyền thông không dây",
    "course_start_page": 122,
    "course_end_page": 123,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC11106  – Truy ền thông không dây  \n \n Thông tin chung  \n− Mã học phần  : CSC11106  \n− Tên tiếng Anh  : Wireless Communications  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn h ọc này cung c ấp cho sinh viên ki ến thức nền tảng về hệ thống m ạng không dây. Cung \ncấp các kiến thức về Radio, m ạng Ad -hoc, WLAN, PANs, security … gi úp sinh viên hi ểu được \nviệc thi ết lập và cách th ức xây d ựng, tri ển khai m ột hệ thống m ạng không dây cho doanh \nnghiệp, gia đ ình và cá nhân. M ục tiêu môn h ọc nhằm hỗ trợ và giúp sinh viên c ó khả năng thi ết \nlập và xây d ựng đư ợc một mạng không dây PANs an to àn. \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để trình bày một số báo cáo kỹ thuật theo \nmẫu cho trước trong lĩnh vực M ạng m áy tính \n− Biết và giải thích được các thuật ngữ tiếng Anh  thuộc chuyên ngành M ạng m áy tính \n− Giải thích được các khái niệm cơ bản, thuật ngữ, công việc v à các thu ật toán trong \nMạng truy ền thông không dây  \n− Phân lo ại được các Mạng truy ền thông không dây WLAN, PANs  \n− Hiểu và triển khai ở mức độ cơ bản m ột hệ thống m ạng không dây c á nhân.  \n− Xây d ựng đư ợc một mạng không dây gia đ ình và kèm theo đ ộ an to àn và tin cậy so v ới \nmạng không dây b ình thư ờng. \n− Sử dụng các công cụ phần mềm hỗ trợ  \n Nội dung học phần    \n 123 − Wireless Communications Introductions & History  \n− Radio Resource Management  \n− Wireless Local Area Networks  \n− Cellular Systems  \n− Infrastructure -Based Wireless Networks  \n− Ad hoc Network  \n− Personal Area Networks (PANs)  \n− Wireless sensor network  \n− Security Issues in Wireless Systems  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \n− P. Nicopolitidis, Wireless Network,  Aristotle University, Greece,  2003 John Wiley & \nSons Ltd.  \n− William Stallings, Wireless Communications And Networks, Second Edition.  \nTài liệu tham khảo  \n− Andrew S. Tanenbaum, Computer Networks, Fourth Edition, Prentice Hall, 2003.  \n− Matthew Gast, 802.11 Wireless Networks: The Definitive Guide, O'Reilly, 2002.  \n− Jean-Pierre Lips, Les Réseaux sans Fils, Université de Nice – Sophia Antipolis (link : \nhttp://sesame -mips.unice.fr/~lips/cours/rese aux/cours/05c -Reseaux -sans-fil.pdf)  \n− Theodores Rappaport, Wireless communications, Prentice Hall.  \nCông cụ hỗ trợ  \n− Visual Studio 2008  \n− NS2 \n− Visio  "
}