{
    "course_id": "CSC15005",
    "course_name": "Nhập môn mã",
    "course_start_page": 137,
    "course_end_page": 142,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC15005  – Nhập môn mã hóa – mật mã  \n \n Thông tin chung  \n− Mã học phần  : CSC15005  \n− Tên tiếng Anh  : Introduction to Cryptography  \n− Khối kiến thức:  Tự chọn – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ:  4 \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Nhập môn l ập trình   \n Mô tả học phần  \nMôn học nhằm giúp sinh viên lĩnh hội các kiến thức cơ bản về các hệ thống mã hóa mật mã \nnhư hệ mã công khai, hệ mã bí mật, hàm băm và mã dòng… Sinh viên có thể áp dụng các kiến \nthức này để xây dựng giải pháp cho các yêu cầu về bảo mật như xác thực, kiểm soát truy cập… \nThêm vào đó, môn học cũng giúp sinh viên rèn luyện thêm các kĩ năng làm việc nhóm, cũng \nnhư tư duy, giải quyết vấn đề 1 cách độc lập và sử dụng các thuật ngữ tiếng Anh trong lĩnh vực \nmã hóa… Sinh viên cũng có thể hình thành ý thức trách nhiệm liên quan đến an toàn thông tin.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Biết cách làm việc ở mức độ cá nhân và cộng tác nhóm để giải quyết các bài toán mã \nhóa bằng tay hoặc bằng máy.  \n− Sử dụng kỹ năng ngoại ngữ: hiểu các thuật ngữ, đọc được tài liệu tiếng Anh.  \n− Xây dựng tư duy phân tích và ph ản biện.  \n− Hiểu rõ và áp dụng được các kiến thức cơ bản của mã hóa mật mã, bảo mật thông tin, \ncác hệ thống mã, một số hệ mã cơ bản, hàm băm mật mã và mã dòng.  \n− Ứng dụng kiến thức về MH -MM để xây dựng lời giải cho bài toán chứng thực và bài \ntoán kiểm soát truy  cập. \n−  \n− Áp dụng kĩ năng lập trình và sử dụng các công cụ ứng dụng hạ tầng khóa công khai vào \ncác bài toán cụ thể.  \n−   \n 138 − Biết bảo vệ an toàn thông tin của mình và không xâm hại thông tin của người/tổ chức \nkhác.  \n Nội dung học phần   \n− Giới thiệu về lý thuyết thông tin  \n− Mã hóa công khai  \n− Mã đối xứng (symmetric cryptography)  \n− Mã xác thực thông điệp (message authentication codes)  \n− Hàm băm  \n− Mã dòng  \n− Các tính chất bảo mật  \n− Chứng thực và Kiểm soát truy cập  \n− Hạ tầng khóa công khai (PKI)  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− Nhap Mon Tin Hoc Ly Thuyet. Tinh Toan Va cac Otomat. Arto Salomaa, Vietnamese \ntranslation of Computation and Automata published by Nha Xuat Ban Khoa Hoc Va \nKy Thuat, Hanoi, 1992.  \n− Public -Key Cryptography, Arto Salomaa, Second, Enlarged E dition. Springer -Verlag, \nBerlin, Heidelberg, New York, x+271 pp, 1996.  \n− Cryptography: Theory And Practice, Third Edition, Douglas Stinson, Chapman and \nHall/CRC, 2005  \n− Handbook of Applied Cryptography, Menezes, P. van Oorschot, S. Vanstone, CRC \nPress.  \nCông cụ  hỗ trợ  \n− Visual Studio .NET   \n 139  \nĐẠI HỌC QUỐC GIA TP. HỒ CHÍ MINH  \nTRƯỜNG ĐẠI HỌC KHOA HỌC TỰ NHIÊN  CỘNG HOÀ XÃ HỘI CHỦ NGHĨA VIỆT NAM  \nĐộc lập – Tự do – Hạnh phúc  \n_____o  0 o_____  \n \nĐỀ CƯƠNG TÓM TẮT \nCSC15006  – Nhập môn x ử lý ngôn ng ữ tự nhiên  \n \n Thông tin chung  \n− Mã học phần  : CSC15006  \n− Tên tiếng Anh  : Introduction to Natural Language Processing  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nĐây là môn học cơ bản giới thiệu về những vấn đề của xử lý ngôn ngữ tự nhiên bằng máy tính. \nMôn học sẽ giới thiệu tổng quan về ngôn ngữ tự nhiên; nhấn mạnh về tính nhập nhằng của nó \nở các cấp độ ngôn ngữ và trên các phương diện khác nhau. Mô n học sẽ giới thiệu những phương \npháp phân tích hình thái học; những giải thuật phân tích cú pháp theo văn phạm phi ngữ cảnh \ncho các ngôn ngữ tự nhiên; và các ứng dụng trong xử lý tiếng Anh/tiếng Việt. Ngoài ra, môn \nhọc cũng sẽ giới thiệu một số kỹ thuật p hân tích văn bản và những ứng dụng đơn giản (kiểm \nlỗi chính tả, tìm kiếm thông tin,…)  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Vận dụng kỹ năng làm việc cá nhân và nhóm để nghiên cứu, giải quyết các bài toán \nXLNNTN.  \n− Biết cách tìm kiếm và đọc hiểu các tài liệu chuyên môn bằng tiếng Anh.  \n− Biết được các khái niệm cơ bản về XLNNTN, các thuật ngữ trong NNTN, những điểm \ntương đồng và dị biệt giữa tiếng Anh và tiếng Việt trên phương diện xử lý NN tự động.  \n− Hiểu các bài toán cơ bản trong XLNNTN như phân tích hình thái, phân tích ngữ pháp.  \n− Vận dụng được phương pháp phân tích cú pháp theo các tiếp cận luật và tiếp cận máy \nhọc. \n− Sử dụng được các công cụ XLNNTN có sẵn để xử lý một công việc cụ thể.   \n 140 − Hiểu và vận dụng các khối xử lý có sẵn trong hệ thống  XLNNTN.  \n Nội dung học phần   \n− Đại cương về Ngôn ngữ tự nhiên  \n− Đại cương về Ngôn ngữ hình thức: Biểu diễn và văn phạm của ngôn ngữ  \n− Đại cương về Ngôn ngữ hình thức: Luật sản sinh, Cây suy dẫn và Phân tích cú pháp.  \n− Cách tiếp cận XLNNTN dựa trên luật:  phân tích cú pháp bằng giải thuật Earley  \n− Cách tiếp cận XLNNTN dựa trên ngữ liệu: giải thuật học TBL và ứng dụng trong bài \ntoán gán nhãn từ loại.  \n− Cách tiếp cận lai XLNNTN  \n− Bài toán tiền xử lý trong XLNNTN  \n− Bài toán Phân tích hình thái trong XLNNTN  \n− Bài toán Phân tích ng ữ pháp trong XLNNTN  \n− Các ứng dụng khác  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \n− Đinh Điền, Xử Lý Ngôn Ngữ Tự Nhiên, 2006, NXB ĐHQG.  \nTài liệu tham khảo  \n− Daniel Jurafsky, James H. Martin, Speech and Language Processing: An Introduction \nto Natural Language Processing, Computational Linguistics, and Speech Recognition, \n2009.  \n− Christopher D.Manning, Hinrich Schutze, Foundations of Statistical Natural Language \nProcessing, 2001, MIT Press.  \n− Hoàng Trọng Phiến, Đại cương ngôn ngữ học, 1990, NXB GD.  \n− James Al len, Natural Language Understanding, 1995, Academic Press.  \n− Ngữ liệu tiếng Việt VCor, VTB  \n− Ngữ liệu tiếng Anh PTB  \n− Từ điển điện tử  \nCông cụ hỗ trợ   \n 141  \nĐẠI HỌC QUỐC GIA TP. HỒ CHÍ MINH  \nTRƯỜNG ĐẠI HỌC KHOA HỌC TỰ NHIÊN  CỘNG HOÀ XÃ HỘI CHỦ NGHĨA VIỆT NAM  \nĐộc lập – Tự do – Hạnh phúc  \n_____o  0 o_____  \n \nĐỀ CƯƠNG TÓM TẮT \nCSC16005  – Xử lý ảnh số và video s ố \n \n Thông tin chung  \n− Mã học phần  : CSC16005  \n− Tên tiếng Anh  : Digital Image and Video Processing  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Nhập môn l ập trình   \n Mô tả học phần  \nBên cạnh dữ liệu văn bản, dữ liệu hình ảnh đóng vai trò ngày càng quan trọng trong đời sống \ncon người. Hình ảnh được số hóa với chất lượng và  số lượng ngày càng tăng. Từ đó dẫn đến \nnhu cầu thiết yếu là khai thác ảnh số hóa để đạt được các ứng dụng hữu ích trong cuộc sống \nnhư xử lý ảnh y khoa, phát hiện lỗi trên thiết bị điện vi,  hồi phục ảnh, nén ảnh, rút trích đặc \ntrưng màu, vân, dáng phục vụ  cho nhận dạng, truy vấn ảnh.  \nMôn học này nhằm cung cấp cho sinh viên các kiến thức nền tảng trong lĩnh vực xử lý ảnh số \nvà video số (phép biểu diễn ảnh số và video số, tiền xử lý ảnh, phân đoạn ảnh và video, phép \nbiến đổi ảnh, nén ảnh). Môn học giúp sinh  viên tích lũy các kỹ năng trong việc xây dựng hệ \nthống xử lý ảnh, video cơ bản phục vụ các ứng dụng thực tế. Dựa trên các kiến thức, kỹ năng \nđược cung cấp, sinh viên sẽ  dễ dàng tiếp thu kiến thức từ các môn học như thị giác máy tính, \nnhận dạng, truy vấn ảnh. \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Có khả năng báo cáo và ứng dụng các kiến thức trong lĩnh vực xử lý ảnh số và video \nsố ở  mức độ cá nhân và nhóm.  \n− Dịch tài liệu tiếng Anh thuộc chuyên ngành xử lý ảnh số và video số.  \n− Phân tích và giải quyết vấn đề liên quan đến lĩnh vực xử lý ảnh số và video số.   \n 142 − Diễn giải và ứng dụng biểu diễn ảnh số và video số.  \n− Diễn giải và ứng dụng phương pháp tiền xử lý ảnh  \n− Diễn giải và ứng dụng phương pháp phân đoạn ảnh số và video số  \n− Diễn giải và ứng dụng phương pháp biến đổi ảnh  \n− Diễn giải và ứng dụng phương pháp nén ảnh  \n− Xây dựng hệ thống xử lý ảnh, video đơn giản  \n Nội dung học phần   \n− Giới thiệu về lĩnh vực xử lý ảnh số và video số  \n− Các khái niệm cơ bản trong xử lý ảnh số và video số  \n− Phép biến đổi màu  \n− Phép biến đổi hình học  \n− Làm trơn ảnh dựa trên miền không gian  \n− Phát hiện biên cạnh dựa trên miền không gian  \n− Phân đoạn ảnh  \n− Phân đoạn video  \n− Phép biến đổi Fourier  \n− Phép biến đổi Karhunen -Loève  \n− Nén ảnh  \n− Seminar đồ án  \n− Rút trích đặc trưng màu, vân, dáng.  \n− Biến đổi màu.  \n− Biến đổi hình học  \n− Seminar đồ án  \n− Làm trơn ảnh  \n− Phát hiện biên cạnh  \n− Seminar đồ án  \n− Phân đoạn ảnh, video  \n− Nén ảnh  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− Computer Vision, David A.Forsyth, Jean Ponce, , Person Education, Inc, 2003.  \n− Digital Image Processing, Rafael C. gonzalez, Richard E. Woods, Prentice -Hall, Inc, \n2002.  \n− Handbook of Image & Video Processing, AL Bovik, Academic Press, 2000.  \nCông cụ hỗ trợ  \n− Visual Studio .NET  \n− Matllab  "
}