{
    "course_id": "CSC11103",
    "course_name": "Thiết kế mạng",
    "course_start_page": 120,
    "course_end_page": 121,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC11103  - Thiết kế mạng \n \n Thông tin chung  \n− Mã học phần  : CSC11103  \n− Tên tiếng Anh  : Computer Network Design  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Mạng Máy Tính   \n Mô tả học phần  \nMôn học trang bị cho sinh viên các khái niệm cơ bản liên quan đến việc thiết kế một mạng máy \ntính, cụ thể giới thiệu cho SV phương pháp top -down để thiết kế một mạng máy tính, đi từ các \nmục tiêu kinh doanh, các ràng buộc,… đến thiết kế logic, vật lý, kiểm tra, tối ưu… Môn học đi \nsâu giới thiệu chi tiết các thuật toán cơ bản cho phép thiết kế các mạng đơn giản (one center, \none speeds) đến các mạng phức tạp (n centers, n speeds) theo các mức độ mạng Access \nNetwork đến WAN. Môn học  cũng đề cập đến việc thiết kế các mạng với các công nghệ cụ thể \nnhư WLAN, WiMax, VPN.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Trình bày đầy đủ các yêu cầu và mục tiêu cần xem xét khi thiết kế một mạng máy tính  \n− Triển khai thiết kế một mạng máy tính với các yêu cầu đơn giản theo các bước trong \nphương pháp thiết kế top -down  \n− Vận dụng thành thạo các thuật toán thiết kế mạng người dùng (Access Network) cho \ncác mạng từ đơn giản (one center, one speed) đến phức tạp (n centers, n speeds)  \n− Chọn l ọc các thiết bị mạng phù hợp để sử dụng cho từng loại mạng cụ thể trong ngữ \ncảnh cụ thể  \n− Hoạch định các bước cần thực hiện cho việc thiết kế một mạng không dây, VPN  \n− Cấu hình cơ bản trên thiết bị Router và Switch của Cisco   \n 121 − Đánh giá hệ thống mạng sau khi thiế t kế và triển khai  \n− Viết báo cáo phân tích, thiết kế, triển khai và vận hành của hệ thống  \n Nội dung học phần   \n− Cơ bản về thiết kế mạng  \n− Yêu cầu và mục tiêu của thiết kế  \n− Khảo sát hiện trạng và lưu lượng mạng  \n− Định giá các mục tiêu kĩ thuật  \n− Lý thuyết đồ thị và cá c thuật toán cơ bản  \n− Mô hình Logic  \n− Mô hình vật lý  \n− Giới thiệu về WiFi  \n− Thiết kế mạng WAN  \n− Thiết kế mạng VPN  \n Tài nguyên học phần  \nGiáo trình  \n− Priscilla Oppenheimer. Top -Down Network Design. Macmillan Technical Publishing, \n2010.  \nTài liệu tham khảo  \n− Comer,D.E. Internetworking with TCP/IP: Principles, Protocols and Architecture. 3rd \nedition, Prentice Hall, 1995  \n− Andrew S.Tanenbaum. Computer Network. 4rd edition, Prentice Hall of India.  \nCông cụ hỗ trợ  \n− NetworkSmartDesign, phiên bản 1.0  \n− PacketTracer, phiên bản 4.1, www.cisco.com.  \n− Microsoft Visio, phiên bản 2007, www.microsofts.com  "
}