{
    "course_id": "CSC13001",
    "course_name": "Lập trình Windows",
    "course_start_page": 194,
    "course_end_page": 196,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC13001  - Lập trình Windows  \n \n Thông tin chung  \n− Mã học phần  : CSC13001  \n− Tên tiếng Anh  : Windows Programming  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Hệ điều hành, Mạng máy tính   \n Mô tả học phần  \nCung cấp cho sinh viên các kiến thức và phương pháp lập trình trê n môi trường Windows: cơ \nchế quản lý chương trình, lập trình giao diện đồ họa (GUI), cơ chế quản lý bộ nhớ, thư viện \nliên kết động, lập trình đa nhiệm…, từ đó sinh viên có khả năng tự xây dựng được các ứng \ndụng hoàn chỉnh ở mức độ vừa phải trên Windows bằn g ngôn ngữ C/C++.  \nTạo nền tảng cho sinh viên trong việc tiếp thu và khai thác các ngôn ngữ lập trình cấp cao khác \ntrên Windows như: C#, Java, VB.NET…  \nTạo cho sinh viên nền tảng kiến thức để có thể tự nghiên cứu các kỹ thuật lập trình sâu hơn \ntrên môi trườn g Windows.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Nắm vững các kiến thức tổng quan về việc phát triển ứng dụng trên môi trường \nWindows  \n− Hiểu rõ các kiến thức về lập trình giao diện đồ họa trên Windows.  \n− Hiểu rõ cách thức lập trình xử lý bộ nhớ trên Windows  \n− Hiểu rõ cách thức lập trình thư viện liên kết động  \n− Hiểu rõ cách thức lập trình mạng trên Windows  \n− Hiểu rõ cách thức lập trình đa nhiệm  \n− Viết được các ứng dụng giao diện đồ họa mức độ nhỏ và vừa trên Windows   \n 195 − Viết được các ứng dụng xử lý bộ nhớ ở mức độ cơ bản.  \n− Viết được các ứng dụng về lập trình mạng ở mức độ nhỏ và vừa.  \n− Viết được các ứng dụng về lập trình đa nhiệm ở mức độ nhỏ và vừa.  \n− Viết được các ứng dụng xử lý đồ họa ở mức độ cơ bản.  \n− Viết được các thư viện liên kết động.  \n− Hình thành đư ợc tính nghiêm túc, tư duy tổ chức một cách có hệ thống và tác phong \nnghề nghiệp về lập trình ứng dụng.  \n− Hình thành ý thức về tầm quan trọng của việc góp sức của cá nhân vào nhóm làm việc \ntrong quá trình lập trình cho một dự án phần mềm.  \n Nội dung học phần   \nChương 1. Các khái niệm cơ bản  \n1.1 Giới thiệu các thư viện lập trình của HĐH Windows  \n1.2 Các thành phần giao diện GUI (Cửa sổ, hộp thoại, các controls)  \n1.3 Các khái niệm cơ bản (Handle, ID, Instance, Callback)  \n1.4 Lập trình sự kiện (Event driven programmin g), vòng lặp xử lý thông điệp \n(Message loop) trong các ứng dụng  \n1.5 Tài nguyên của ứng dụng (Resources)  \n1.6 Một chương trình tổng quát xây dựng trên Windows 32 API  \n1.7 Một số API cơ bản.  \nChương 2. Lập trình giao diện đồ họa  \n2.1 Giới thiệu các Control cơ bản \n2.2 Xây dựng và xử lý hộp thoại (Dialog box)  \n2.3 SDI - Single Document Interface  \n2.4 MDI - Multi Document Interface  \n2.5 Xử lý Mouse và Keyboard  \nChương 3. Thư viện đồ họa GDI  \n3.1 Giới thiệu  \n3.2 Các hàm GDI cơ bản  \n3.3 Xử lý Bitmap  \n3.4 In ấn (Printing)  \nChương 4. Thư viện liên kết động  \n4.1 Giới thiệu  \n4.2       Cách thức gọi DLL trong ứng dụng  \n4.3 Xây dựng 1 DLL  \n4.4 Chặn thông điệp (Hook)  \nChương 5. Quản lý bộ nhớ  \n5.1 Tổng quan  \n5.2 Các hàm xử lý trên bộ nhớ ảo  \n5.3 Các hàm xử lý bộ nhớ chuẩn của C /C++  \n5.4 Xử lý Clipboard  \nChương 6. Multi -thread programming  \n6.1 Khái niệm Multi -tasking và Multi -threading  \n6.2 Tiến trình (Process), tiểu trình (Thread)  \n6.3 Quản lý các tiểu trình  \n6.4 Đồng bộ các tiểu trình  \nChương 7. Lập trình mạng  \n7.1 Khái niệm cơ bản về lập trình mạng  \n7.2 Lập trình với đối tượng socket   \n 196  \n Tài nguyên học phần  \nGiáo trình  \n− Windows System Programming, 4th Edition, Johnson (John) M. Hart, Addison -\nWesley, 2010.  \n− Programming Windows, 5th Edition, Charles Petzold, Microsoft Press, 1998.  \nTài liệu tham khảo  \nCông cụ hỗ trợ  "
}