{
    "course_id": "CSC16106",
    "course_name": "Nhập môn lập trình điều khiển thiết bị thông minh",
    "course_start_page": 207,
    "course_end_page": 208,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC16106  – Nhập môn l ập trình đi ều khi ển thi ết bị thông minh  \n \n Thông tin chung  \n− Mã học phần  : CSC16106  \n− Tên tiếng Anh  : Introduction to Smart Device Programming  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Kỹ thuật lập trình, C ấu trúc dữ liệu và giải thu ật   \n Mô tả học phần  \nMôn học này cung c ấp các kiến thức cơ bản liên quan đ ến lập trình kết nối vạn vật và điều \nkhiển tương tác thông minh cho c ác thiết bị dân dụng - Đưa trí tuệ nhân tạo vào thiết bị. Nội \ndung m ôn học xoay quanh c ác vấn đề về thiết kế hệ thống kết nối vạn vật, lập trình thu nh ận \ntín hiệu cảm biến, lập trình đi ều khi ển thiết bị ngoại vi, l ập trình xử lý tiếng nói và thị giác máy \ntính. C ác kiến thức là nền tảng gi úp sinh vi ên có cái nhìn tổng quan v ề việc xây dựng m ột hệ \nthống kết nối vạn vật với các thiết bị thông minh c ó thể ứng dụng trong th ực tế. \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Vận dụng kỹ năng trình bày, kỹ năng vi ết báo cáo. \n− Hiểu các thu ật ngữ và các tài liệu tiếng Anh li ên quan m ôn học. \n− Vận dụng kỹ năng tư duy v à lập trình để giải quy ết vấn đề được cho li ên quan.  \n− Hiểu rõ các khái niệm cơ bản về lập trình kết nối vạn vật, cấu trúc thiết bị thông minh, \nhệ thống cảm biến, nguy ên lý lập trình đi ều khi ển thiết bị. \n− Áp dụng xử lý tiếng nói và thị giác máy tính trong b ài toán tương tác thông minh v ới \nthiết bị. \n− Hiểu được các ứng dụng tiêu biểu cho thi ết bị thông minh trong th ực tế. \n Nội dung học phần    \n 208 Phần I: L ập trình k ết nối vạn vật \nLập trình Arduino  \nĐiện tử cơ bản và thiết kế thiết bị thông minh  \nHệ thống cảm biến \nLập trình đi ều khi ển thiết bị ngoại vị \nGiới thiệu \"M áy trạng th ái hữu hạn\" \nPhần II: Ứng dụng Tr í tuệ nhân tạo trên thi ết bị thông minh  \nGiới thiệu Robot Operating System (ROS)  \n• Giới thiệu ROS  \n• ROS tr ên thiết bị raspberry pi  \n• ROS tr ên thiết bị Jetson Nano  \n Xử lý tiếng nói và nhận dạng ti ếng nói trong ứng dụng tương tác với thiết bị thông \nminh  \n• Xử lý tiếng nói \n• Mô hình nhận dạng tiếng nói \n• Mô hình tổng hợp tiếng nói \n• Giao ti ếp bằng tiếng nói \n• Nhận dạng ng ười nói \nThị giác máy tính trong ứng dụng tương tác với thiết bị thông minh  \n• Lập trình thu/nh ận và xử lý video theo th ời gian th ực \n• Ứng dụng nh ận dạng m ặt người / hay đ ồ vật vào xử lý hành vi c ủa thiết bị thông \nminh  \n• Ứng dụng TGMT k ết hợp với các cảm biến để giải quy ết bài toán định vị của \nthiết bị thông minh  \nGiới thiệu các bài toán nghi ên cứu và mô hình ứng dụng của thiết bị thông minh trong \nthực tế \nTổng kết, ôn tập \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− Handbook on Soft Computing for Video Surveillance, Maddalena, Lucia Petrosino, \nAlfredo Pal, Sankar K, In Chapman & Hall, 2012.  \n− Artificial intelligence and soft computing, Amit Konar, CRC Press, 1999.  \n− Arduino Cookbook, Michael Margolis and Nicholas Weldin, O’Reilly Media, 2011.  \n− An Introduction to Programming the Internet of Things (IOT) Specialization, \nhttps://www.cours era.org/specializations/iot  \n− ROS For Beginners, https://www.udemy.com/topic/robot -operating -system/  \n− Lập trình C, Arduino, Python, ROS  \n− Các sách tham kh ảo liên quan đ ến mã nguồn mở OpenCV v à phần mềm Weka.  \nCông cụ hỗ trợ  "
}