{
    "course_id": "CSC16004",
    "course_name": "Thị giác máy tính",
    "course_start_page": 253,
    "course_end_page": 254,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC16004  – Thị giác máy tính  \n \n Thông tin chung  \n− Mã học phần  : CSC16004  \n− Tên tiếng Anh  : Computer Vision  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Nhập môn l ập trình   \n Mô tả học phần  \nMôn học này nhằm cung cấp cho sinh viên một cái nhìn tổng quát về lĩnh vực Thị giác máy \ntính, các kiến thức nền tảng liên quan đến các thành phần chính yếu trong lĩnh vực thị giác máy \ntính (khái niệm về đặc tả đối tượng từ ảnh, các tiến trình, các phương pháp, kỹ thuật phát triển \nphần mềm ảnh và video, các phương pháp tổ chức quản lý dữ liệu, công cụ và môi trường phát \ntriển và triển khai phần mềm ảnh và video...). Môn học cũng giúp xây dựng kiến thức nền tảng \ncho chuyên ngành Thị Giác Máy Tính nhằm tạo sự sẵn sàng cho các môn học chuyên sâu hơn \nở các năm sau. Môn học cũng giúp sinh viên có những trải nghiệm thực tế về quá trình thiết kế \nvà xây dựng giải pháp cho phần mềm ảnh và video ở mức độ đơn giản một cách có hệ thống.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để trình bày một số báo cáo kỹ thuật theo \nmẫu cho trước trong lĩnh vực th ị giác máy tính.  \n− Biết các thuật ngữ tiếng Anh thuộc chuyên ngành Thị Giác Máy Tính.  \n− Sử dụng tư duy phân tích logic của kiến thức toán học, vật lý để viết giải thuật.  \n− Giải thích được các khái niệm cơ bản, thuật ngữ thuộc lĩnh vực Thị Giác Máy Tính.  \n− Xây dựng  được một số thành phần của sản phẩm ứng dụng thị giác máy tính đáp ứng \nmột số nhu cầu thực tế.  \n− Sử dụng các công cụ phần mềm hỗ trợ   \n 254 \n Nội dung học phần   \n− Giới thiệu tổng quan về Thị giác máy tính  \n− Phương pháp đặc tả đối tượng từ ảnh, dãy ảnh  \n− Mô hình camera  \n− Hồi phục đối tượng 3D  \n− Theo vết đối tượng  \n− Phát hiện hành động  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− Computer Vision: A Modern Approach, Second Edition, David A. Forsyth, Jean Ponce, \nPrentice Hall International Inc, 2011.  \n− Computer Vision: Algorithms and Applications, Richard Szeliski, Springer; 2011.  \nCông cụ hỗ trợ  \n− Visual Studio C++  \n− OpenCV  "
}