{
    "course_id": "CSC14004",
    "course_name": "Khai thác dữ liệu và ứng dụng",
    "course_start_page": 211,
    "course_end_page": 212,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC14004  - Khai thác d ữ liệu và ứng dụng \n \n Thông tin chung  \n− Mã học phần  : CSC14004  \n− Tên tiếng Anh  : Data Mining and Applications  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn học này nhằm cung cấp cho sinh viên những kiến thức cơ bản về lĩnh vực Khai thác dữ \nliệu và những ứng dụng của nó vào các ngành khoa học khác. Môn học này bao gồm các nội \ndung tổng quát liên quan đến quy trình khám phá tri thức từ dữ liệu và các nội dung chuyên \nsâu liên quan đến các kỹ thuật thông dụng trong khai thác dữ liệu như khai thác tập phổ biến \nvà luật kết hợp, phân loại, gom cụm, biểu diễn và đánh g iá tri thức.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để trình bày một số báo cáo khoa học \ntheo mẫu và thuyết trình các nội dung liên quan đến môn học  \n− Biết và giải thích được các thuật ngữ tiếng Anh thuộc lĩnh vực khai thác dữ liệu  \n− Giải thích được các khái niệm cơ bản, thuật ngữ thuộc lĩnh vực khai thác dữ liệu  \n− Hiểu được ý nghĩa và ứng dụng của các bài toán trong khai thác dữ liệu đối với các vấn \nđề thực tế  \n− Hiểu và giải thích được cơ chế hoạ t động của các thuật toán cơ bản trong khai thác dữ \nliệu \n− Xây dựng được một số thành phần của một hệ thống khai thác dữ liệu ở quy mô nhỏ  \n− Sử dụng các công cụ phần mềm hỗ trợ  \n Nội dung học phần    \n 212 − Giới thiệu Khai thác dữ liệu  \n− Chuẩn bị dữ liệu  \n− Khai thác tập phổ biến và luật kết hợp  \n− Phân lớp  \n− Gom cụm  \n− Chủ đề mở rộng  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− Introduction to Data Mining, First Edition, P -N. Tan, M, Steinbach, V. Kumar, \nAddison -Wesley Longman Publishing Co. Inc., 2005  \n− Data Mining: Concept s & Technique, Third Edition, J.Han and M.Kamber, Morgan \nKaufmann Publishers, 2012  \n− Web Data Mining: Exploring Hyperlinks, Contents, and Usage Data, Second Edition, \nB. Liu, Springer, 2011  \nCông cụ hỗ trợ  \n− Visual Studio .NET  \n− Java \n− Mircosoft SQL, 2008  "
}