{
    "course_id": "CSC14113",
    "course_name": "Trình biên dịch",
    "course_start_page": 227,
    "course_end_page": 228,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC14113  - Trình biên d ịch \n \n Thông tin chung  \n− Mã học phần  : CSC14113  \n− Tên tiếng Anh  : Compiler  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Cấu trúc dữ liệu và Giải thuật, Toán rời rạc, Ô -tô-mát và \nNgôn ngữ hình thức, Kiến trúc máy tính và Hợp ngữ    \n Mô tả học phần  \nMáy tính điện tử đã, đang và sẽ luôn là một phần không thể thiếu trong thế giới hiện đại. Mọi \nthứ mà máy tính làm được đều là kết quả của một chương trình, được viết bởi ngôn ngữ lập \ntrình nhân tạo nào đó. Tất nhiên, để máy tính có thể hiểu được mã nguồn, nhất thiết phải có \nchương trình dịch.  \nThiết kế và xây dựng chương trình dịch cho các ngôn ngữ lập trình cấp cao là công việc thật \nsự khó khăn, đòi hỏi kiến thức sâu và rộng về nhiều chuyên ngành hẹp trong khoa học máy \ntính. Trong môn học này, các thành ph ần chính sẽ được đề cập đến, bao gồm: bộ phân tích từ \nvựng, bộ phân tích cú pháp, bộ phân tích ngữ nghĩa, bộ sinh mã trung gian, bộ sinh mã đích và \nbảng danh biểu.  \nThông qua học phần này, ngoài việc thu thập được những kiến thức về mặt học thuật, sinh viên \nsẽ có dịp thấy được vẻ đẹp của khoa học máy tính, thể hiện bằng sự kết hợp nhuần nhuyễn giữa \nnền tảng lý thuyết và ứng dụng thực tế để kết tinh nên một sản phẩm ph ần mềm có vai trò mang \ntính cốt lõi: Trình biên dịch.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Hiểu được vị thế, vai trò cũng như tổ chức của hệ thống thực thi ngôn ngữ lập trình   \n 228 − Biết, hiểu và giải thích được thuật ngữ tiếng Anh liên qua n đến lĩnh vực thiết kế và xây \ndựng chương trình dịch  \n− Phân tích được các cách tiếp cận cho việc dịch ngôn ngữ lập trình  \n− Hiểu và giải thích được cơ chế quản lý sự vận hành của chương trình tại thời điểm thực \nthi \n− Phân tích được vai trò, thiết kế và thực thi của bộ phân tích từ vựng  \n− Phân tích được vai trò, thiết kế và thực thi của bộ phân tích cú pháp  \n− Phân tích được vai trò, thiết kế và thực thi của bộ phân tích ngữ nghĩa  \n− Phân tích được vai trò, thiết kế và thực thi của bộ sinh mã trung gian  \n− Phân tích được vai  trò, thiết kế và thực thi của bộ sinh mã đích  \n Nội dung học phần   \n− Giới thiệu chương trình dịch  \n− Tổng quan về một trình biên dịch đơn giản  \n− Phân tích từ vựng  \n− Phân tích cú pháp  \n− Bảng danh biểu  \n− Phân tích ngữ nghĩa  \n− Biểu diễn trung gian và Phát sinh mã trung gian  \n− Môi trường thời gian thực thi  \n− Phát sinh mã đích  \n Tài nguyên học phần  \nGiáo trình  \n− Compilers: Principles, Techniques and Tools, Alfred. V. Aho, Monica S. Lam, Ravi \nSethi, Jeffrey D. Ullman, 2nd ed., Addison Wesley, 2007.  \nTài liệu tham khảo  \n− Engineering a Compiler, Keith Cooper, Linda Torczon, 2nd ed., Morgan Kaufmann, \n2012.  \nCông cụ hỗ trợ  "
}