{
    "course_id": "CSC12111",
    "course_name": "Quản trị cơ sở dữ liệu hiện đại",
    "course_start_page": 276,
    "course_end_page": 278,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC12111  - Quản trị cơ sở dữ liệu hiện đại \n \n Thông tin chung  \n− Mã học phần  : CSC12111  \n− Tên tiếng Anh  : Modern Database Management  \n− Khối kiến thức: Tự chọn  - Kiến thức tốt nghiệp  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nSự xuất hiện của dữ liệu lớn (big data) đ ã thúc đẩy nhu c ầu về một loại hệ thống cơ sở dữ liệu \n(CSDL) m ới có thể lưu trữ và thao t ác dữ liệu phi quan h ệ một cách dễ dàng. M ôn học này \nnhằm cung c ấp cho sinh vi ên một cách nh ìn về các khía cạnh kh ác nhau c ủa quản lý dữ liệu \ntrong c ác hệ thống CSDL hi ện đại. Môn học cũng nh ấn mạnh vào việc quản lý dữ liệu có cấu \ntrúc phức tạp, ch ẳng hạn như dữ liệu web, d ữ liệu xã hội, ... N ội dung chi ti ết, môn học đề cập \nđến các loại CSDL m ức nâng cao bao g ồm CSDL phi qu an hệ (NoSQL), CSDL theo chu ỗi \nthời gian (Time series Databases), CSDL kh ông gian đ ịa lý (Geographic Databases), ... Đ ối \nvới cơ sở dữ liệu NoSQL, kh óa học cung c ấp một cái nhìn tổng quan v ề kiến trúc lưu trữ nội \nbộ của từng lo ại: lưu trữ hướng cột (column -family stores), l ưu trữ theo c ác cặp khóa-giá trị \n(key-value stores) , l ưu trữ theo h ướng tài liệu (document stores), l ưu trữ theo h ướng đồ thị \n(graph stores), v à cũng gi úp họ làm quen v ới khái niệm hệ thống tệp được nối mạng ph ân tán. \nSinh vi ên cũng được học các công cụ, hệ quản trị cơ sở dữ liệu để tạo, lưu trữ và truy v ấn dữ \nliệu trong m ôi trường NoSQL v à các dạng CSDL kh ác. \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Thực hành các kỹ năng làm việc nhóm trong ho ạt động thi ết kế, chia s ẻ các loại CSDL \nmới theo nh óm.  \n 277 − Thực hành đọc tài liệu tiếng Anh li ên quan đ ến các chủ đề CSDL m ới \n− Thực hành suy ngh ĩ có phê phán, sáng tạo trong c ác chủ đề CSDL m ới. \n− Hiểu tổng quan v ề nhu c ầu của các loại CSDL m ới hiện nay đ ược áp dụng trong c ác \nlĩnh vực ứng dụng. \n− Liệt kê kiến trúc và mô hình dữ liệu cơ bản, hệ quản trị CSDL cho c ơ sở dữ liệu NoSQL \n(key-value stores, document databases, column -family stores, graph databases)  \n− Liệt kê kiến trúc, mô hình dữ liệu, hệ quản trị CSDL cho CSDL theo chu ỗi thời gian, \nCSDL kh ông gian đ ịa lý \n− Đánh gi á, sử dụng các công cụ, phần mềm để khai th ác CSDL m ới qua ứng dụng minh \nhọa cụ thể (NoSQL Databases, Times Series Databases, Geographic Databases)  \n Nội dung học phần   \n− Thế hệ tiếp theo c ủa cơ sở dữ liệu: \n• Sự đa dạng của các loại dữ liệu, ứng dụng hi ện nay (Big data, IoT, ...)  \n• Những th ách th ức mới cho h ướng nghi ên cứu CSDL  \n− Tổng quan v ề NoSQL  \n• Định ngh ĩa và lịch sử NoSQL  \n• Tại sao c ần sử dụng NoSQL  \n• Các loại CSDL NoSQL  \n− Đặc thù của CSDL NoSQL v à hướng tiếp cập trong ứng dụng \n• Đặt vấn đề \n• Hướng tiếp cận theo CSDL quan h ệ và các thách th ức \n• Hướng tiếp cận theo NoSQL  \n− Các loại lưu trữ của NoSQL  \n• CSDL h ướng cột (column - oriented databases)  \n• CSDL h ướng tài liệu (document store)  \n• CSDL l ưu trữ hướng kh óa-giá trị (key-value store)  \n• CSDL l ưu trữ hướng đồ thị (graph store)  \n• So sánh giữa các loại lưu trữ NoSQL  \n−  Phân tích áp dụng CSDL NoSQL tr ên các loại ứng dụng \n• Loại ứng dụng giao t ác (Transactional Application)  \n• Loại ứng dụng tính toán (Computational Application)  \n• Loại ứng dụng web m ức qui m ô (Web -scale Application)  \n− *** M ỗi loại ứng dụng sẽ được phân tích: \n• Các yêu cầu về lược đồ thực thể \n• Các yêu cầu về truy xu ất dữ liệu \n• NoSQL c ó khả năng và không có năng gì trên các yêu cầu \n• Quyết định lựa chọn loại NoSQL  \n−  CSDL kh ông gian đ ịa lý \n• Định ngh ĩa \n• Đặc thù và mô hình dữ liệu \n• Các loại ứng dụng \n−  CSDL theo chu ỗi thời gian:  \n• Định ngh ĩa \n• Đặc thù và mô hình dữ liệu \n• Các loại ứng dụng \n−  Giới thiệu Các sản phẩm của CSDL NoSQL   \n 278 • Key-value stores: Redis  \n• Document stores: MongoDB  \n• Graph store: Neo4j  \n• Wide column stores: Cassandra, Hbase  \n−  Các sản phẩm của một số loại CSDL hi ện đại khác: \n• Time -series databases: TimescaleDB, Geographic databases: PostGIS  \n−  Case study:  \n• Sử dụng các loại CSDL m ới trên một số lĩnh vực ứng dụng hi ện nay.  \n• NoSQL trong Bigdata S ử dụng ph ân tích đồ thị trong Bigdata.  \n− Tổng kết, ôn tập, hệ thống lại nội dung m ôn học \n Tài nguyên học phần  \nGiáo trình  \n− Gaurav Vaish, Getting Started with NoSQL, Published by Packt Publishing Ltd, ISBN \n978-1- 84969 -4-988 \n− Dan Sullivan, NoSQL for Mere Mortals, Addison -Wesley Professional. 2015. ISBN: \n0134023218 (DS)  \n− Guy Harrison, Next -Generation Dat abases, Apress. 2016. ISBN: 9781484213292 (GH) \n[4]. Sadalage, P. & Fowler, NoSQL Distilled: A Brief Guide to the Emerging World of \nPolyglot Persistence, Pearson Education  \n− Redmond, E. &Wilson , Seven Databases in Seven Weeks: A Guide to Modern \nDatabases and  the NoSQL Movement, Edition, 1st Edition. T ài liệu đa ph ương tiện: \n− Link youtube  \n− Link website ch ứa bài học \n− Moodle  \nTài liệu tham khảo  \nCông cụ hỗ trợ  \n− Các hệ QT CSDL hi ện đại: MongoDB, Neo4j, Redis, ...  \n− Zoom (SV c ần dùng email sinh vi ên để kích ho ạt tài kho ản và tham gia l ớp học) \n− Google doc, slides, sites... (đ ịnh danh t ài kho ản bằng MSSV)  \n− Draw.io  "
}