{
    "course_id": "CSC14001",
    "course_name": "Automata và ngôn ngữ hình thức",
    "course_start_page": 128,
    "course_end_page": 131,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC14001  – Automata và ngôn ng ữ hình th ức \n \n Thông tin chung  \n− Mã học phần  : CSC14001  \n− Tên tiếng Anh  : Automata and Formal Languages  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :  Cấu trúc d ữ liệu và Gi ải thu ật, Toán r ời rạc  \n Mô tả học phần \nTrang bị cho sinh viên kiến thức lý thuyết nền tảng của khoa học máy tính, bao gồm các mô \nhình trạng thái hữu hạn, các hệ thống văn phạm, máy Turing, các phân lớp ngôn ngữ hình thức. \nBên cạnh đó, khả năng tư duy logic của sinh viên cũng được cải thiện v à nâng cao trong quá \ntrình học tập. Tri thức có được từ môn học này sẽ là tiền đề cho việc học tập và nghiên cứu \nnhững lĩnh vực chuyên sâu như: xử lý ngôn ngữ tự nhiên, trình biên dịch, máy học, lý thuyết \nngôn ngữ lập trình, lý thuyết tính toán, thiết kế v à phân tích độ phức tạp của giải thuật, …  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Hiểu thuật ngữ tiếng Anh và các từ viết tắt phổ biến trong lĩnh vực này  \n− Đọc và hiểu các phần đọc thêm trong sách tham khảo  \n− Sử dụng máy tính và ngôn ngữ lập trình cho các bài tập  \n− Trình bày trôi chảy, mạch lạc một số nội dung mở rộng  \n− Chứng minh hình thức  \n− Lý thuyết tập hợp  \n− Nhận thức về khả năng tính toán của máy tính  \n− Cài đặt mô phỏng các mô hình tính toán  \n− Vận dụng thuần thục các cấu trúc dữ liệu cơ sở. Thiết  kế và vận hành các giải thuật \nnhằm giải quyết vấn đề.   \n 129 − Vận dụng kiến thức để tìm hiểu và phân tích vấn đề được nêu ra, chứng minh tính đúng \ncủa nó từ góc độ lý thuyết hoặc xây dựng chương trình thử nghiệm và kiểm định kết \nquả thực tế.  \n− Chỉ ra được tính đúng  của các phát biểu, các định lý thông qua phép chứng minh hình \nthức \n− Biết tự khai phá tri thức từ các nguồn thông tin như Internet, sách tham khảo.  \n Nội dung học phần   \nChương 1. Giới thiệu lý thuyết automata và các phương pháp chứng minh hình thức  \n 1.1. Vai trò của lý thuyết automata và ngôn ngữ hình thức trong khoa học máy tín   \n 1.2. Giới thiệu về chứng minh hình thức   \n  1.2.1. Phương pháp chứng minh suy diễn   \n  1.2.2. Các dạng chứng minh bằng phương pháp suy diễn   \n  1.2.3. Các dạng chứng minh bổ sung   \n 1.3. Chứng minh qui nạp   \n  1.3.1. Nguyên lý thứ nhất của qui nạp toán học   \n  1.3.2. Nguyên lý thứ hai của qui nạp toán học   \n  1.3.3. Chứng minh qui nạp có cấu trúc   \n  1.3.4. Chứng minh qui nạp tương hỗ   \n 1.4. Ngôn ngữ và câu   \n  1.4.1. Bảng chữ cái   \n  1.4.2. Câu   \n  1.4.3. Ngôn ngữ   \nChương 2. Automata hữu hạn   \n 2.1. Giới thiệu   \n 2.2. Automata hữu hạn đơn định   \n  2.2.1. Định nghĩa   \n  2.2.2. Sơ đồ truyền   \n  2.2.3. Hàm truyền mở rộng   \n 2.3. Automata hữu hạn không đơn định   \n  2.3.1. Định nghĩa   \n  2.3.2. Sơ đ ồ truyền   \n  2.3.3. Sự tương đương với automata hữu hạn đơn định   \n 2.4. Automata hữu hạn không đơn định với phép truyền rỗng   \n  2.4.1. Phép truyền rỗng   \n  2.4.2. Định nghĩa   \n  2.4.3. Bao đóng rỗng   \n  2.4.4. Hàm truyền mở rộng   \n  2.4.5. Sự tương đương với au tomata hữu hạn đơn định   \nChương 3. Biểu thức chính qui, văn phạm và ngôn ngữ chính qui    \n 130  3.1. Biểu thức chính qui   \n 3.2. Sự tương đương giữa biểu thức chính qui và automata hữu hạn   \n  3.2.1. Chuyển từ automata hữu hạn đơn định sang biểu thức chính qui   \n  3.2.2. Chuyển từ biểu thức chính qui sang automata hữu hạn không đơn định \nvới phép truyền rỗng   \n  3.2.3. Chuyển từ biểu thức chính qui sang automata hữu hạn đơn định   \n 3.3. Văn phạm chính qui và automata hữu hạn   \n 3.4. Ngôn ngữ chính qui   \n  3.4.1. Bổ đề bơm  dành cho ngôn ngữ chính qui   \n  3.4.2. Tính đóng của ngôn ngữ chính qui   \n  3.4.3. Tối thiểu hóa automata hữu hạn   \nChương 4. Văn phạm và ngôn ngữ phi ngữ cảnh   \n 4.1. Văn phạm phi ngữ cảnh   \n  4.1.1. Định nghĩa   \n  4.1.2. Khái niệm Dẫn xuất và Cây phân tích  \n  4.1.3. Tính nhập nhằng của văn phạm   \n 4.2. Ngôn ngữ phi ngữ cảnh   \n  4.2.1. Dạng chuẩn Chomsky   \n  4.2.2. Bổ đề bơm dành cho ngôn ngữ phi ngữ cảnh   \n  4.2.3. Tính đóng của ngôn ngữ phi ngữ cảnh   \nChương 5. Automata đẩy xuống   \n 5.1. Định nghĩa automata đẩy xuống   \n 5.2. Nhận dạng ngôn ngữ bởi automata đẩy xuống   \n  5.2.1. Kiểu trạng thái kết thúc   \n  5.2.2. Kiểu ngăn xếp rỗng   \n  5.2.3. Quan hệ giữa hai phương thức nhận dạng ngôn ngữ   \n 5.3. Sự tương đương giữa văn phạm phi ngữ cảnh và automata đẩy x uống   \n 5.4. Automata đẩy xuống đơn định   \nChương 6. Giới thiệu máy Turing   \n 6.1. Máy Turing  \n  6.1.1. Mô t ả máy Turing  \n  6.1.2. Khái niệm hình trạng  \n  6.1.3. Sơ đồ truyền   \n 6.2. Ngôn ngữ của máy Turing   \n 6.3. Các biến thể của máy Turing  \n  6.3.1. Máy Turing  đa băng đọc/ghi  \n  6.3.2. Máy Turing với băng đọc/ghi một hướng  \n  6.3.3. Máy Turing không đơn định    \n 131 \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− Introduction to Automata Theory, Languages, and Computation, 2nd Edition, J. E. \nHopcroft, R. Motwani, J. D. Ullman, Addison Wesley, 2001.  \n− Introduction to the Theory of Computation, 2nd Edition, M. Sipser, Course \nTechnology, 2005.  \n− Automata, Computability and Complexity: Theory and Applications, E. A. Rich, 1st \nEdition, Prentice Hall, 2008.  \nCông cụ hỗ trợ  "
}