{
    "course_id": "CSC16105",
    "course_name": "Truy vấn thông tin thị giác",
    "course_start_page": 261,
    "course_end_page": 262,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC16105  – Truy v ấn thông tin th ị giác \n \n Thông tin chung  \n− Mã học phần  : CSC16105  \n− Tên tiếng Anh  : Visual Information Retrieval  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Nhập môn l ập trình   \n Mô tả học phần  \nMôn học cung cấp các kiến thức nền tảng về tổ chức dữ liệu và cách thức truy vấn để khai thác \nđược hai thuộc tính cơ bản của ảnh số, video số là  thị giác và ngữ nghĩa, nhằm đáp ứng nhu \ncầu truy vấn ảnh, video trong các ứng dụng thực tế. Nội dung gồm các phần chính như phần \nrút trích đặc trưng thị giác gồm: phương pháp rút trích đặc trưng cấp thấp, đặc trưng vùng, đặc \ntrưng cục bộ; phần tổ chức dữ liệu gồm: tổ chức dữ liệu ảnh, video ở mức thị giác và ngữ nghĩa; \nphần truy vấn gồm: truy vấn ảnh, video ở mức thị giác và ngữ nghĩa ; phần đánh giá tính hiệu \nquả của hệ thống gồm: đáng giá định tính và định lượng. Ngoài ra, môn học còn cung cấp các \nkỹ năng sử dụng thành thạo thư viện xử lý ả nh, video OpenCV trong truy vấn ảnh, video.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Có khả năng báo cáo và ứng dụng các kiến thức trong lĩnh vực TVTTTG ở mức độ cá \nnhân và nhóm.  \n− Dịch tài liệu tiếng Anh thuộc chuyên ngành TVTTTG  \n− Phân tích  và giải quyết vấn đề liên quan đến TVTTTG  \n− Diễn giải và ứng dụng phương pháp rút trích đặc trưng ảnh (video)  \n− Diễn giải và ứng dụng phương pháp tổ chức dữ liệu ảnh (video)  \n− Diễn giải và ứng dụng phương pháp truy vấn ảnh (video)  \n Nội dung học phần    \n 262 − Giới thiệu về TVTTTG.  \n− Các khái niệm cơ bản về TVTTTG.  \n− Đặc trưng toàn cục của ảnh (video)  \n− Đặc trưng cục bộ của ảnh (video).  \n− Độ đo đối sánh ảnh (video).  \n− Tổ chức và truy vấn ảnh dựa vào đặc trưng vùng của ảnh (video)  \n− Tổ chức và truy vấn dữ liệu ảnh dựa vào phả hệ tri thức thị giác  \n− Tổ chức và truy vấn ảnh dựa vào ngữ nghĩa  \n− Tổ chức và truy vấn ảnh dựa vào kết hợp đặc trưng thị giác, phả hệ tri thức thị giác và \nngữ nghĩa  \n− Phương pháp đánh giá kết quả truy vấn  \n− Seminar về r út trích đặc trưng của ảnh (video)  \n− Seminar về tổ chức dữ liệu ảnh (video)  \n− Seminar về truy vấn ảnh (video) & đánh giá kết quả.  \n Tài nguyên học phần  \nGiáo trình  \nTài liệu tham khảo  \n− Digital Image Processing. Rafael C. gonzalez, Richard E. Woods, Prentice -Hall, Inc, \n2004.  \n− Visual Information Retrieval. Alberto Del Bimbo, Morgan Kaufmann Publishers, Inc. \n1999.  \nCông cụ hỗ trợ  \n− Visual Studio .NET  \n− Matllab  "
}