{
    "course_id": "CSC16102",
    "course_name": "Kỹ thuật lập trình xử lý ảnh số và video số",
    "course_start_page": 257,
    "course_end_page": 258,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC16102  – Kỹ thuật lập trình x ử lý ảnh số và video s ố \n \n Thông tin chung  \n− Mã học phần  : CSC16102  \n− Tên tiếng Anh  : Programming Techniques in Digital Image and Video Processing  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Kỹ thuật lập trình, Lập trình hướng đối tượng,  \n      Cấu trúc dữ liệu và giải thuật    \n Mô tả học phần  \nMôn học này cung cấp cho sinh viên các công cụ, thư viện lập trình và các kĩ thuật lập trình \nC/C++ nâng cao trong giải quyết các vấn đề trong xử lý ảnh và video số. Môn học kh ông đặt \nnặng vào giới thiệu các giải thuật và phương pháp xử lý trên ảnh và video số mà tập trung vào \nkhía cạnh kỹ thuật, mô hình lập trình, cấu trúc dữ liệu, … để khai thác tốt các thư viện, môi \ntrường lập trình và các hổ trợ sẵn có trong thực hiện hoặc t ăng cường năng lực thực hiện xử lý \nảnh và video số. Với chức năng bổ trợ kỹ năng cho sinh viên học các môn liên quan đến thị \ngiác máy tính, môn học chú trọng vào các thư viện cũng như công cụ lập trình được sử dụng \nrộng rãi như Matlab, OpenMP, COM, Media F oundation, FFMPEG, … Môn học cũng mở \nrộng việc xử lý ảnh thực hiện trên nền web.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để giải quyết các vấn đề liên quan môn \nhọc \n− Hiểu và có thể giải thích lại một cách mạch lạc các thuật ngữ tiếng Anh thuộc chuyên \nngành liên quan môn học  \n− Giải thích một cách chính xác và đầy đủ các khái niệm cơ bản, các thuật ngữ liên quan \nmôn học   \n 258 − Xác định được các ưu, khuyết điểm của từng công cụ, thư viện lập trình trong giải c ác \nbài toán xử lý ảnh và video số  \n− Thiết kế và vận dụng các kỹ thuật để cài đặt hệ thống phần mềm hiện thực hóa các thuật \ntoán liên quan đến xử lý ảnh, video số và thị giác máy tính  \n Nội dung học phần   \n− Giới thiệu môn học  \n− Kỹ thuật lập trình xử lý ảnh với Matl ab \n− Kỹ thuật lập trình xử lý ảnh trên nền Web  \n− Xây dựng hệ thống xử lý ảnh & video trực tuyến dùng ứng dụng dịch vụ web  \n− Sơ lược kỹ thuật lập trình theo mô hình đối tượng thành phần (COM)  \n− Kỹ thuật lập trình xử lý video với Media Foundation  \n− Kỹ thuật lập trình xử lý video với FFMPEG  \n− Kỹ thuật lập trình song song trên CPU với OpenMP  \n− Tổng kết  \n Tài nguyên học phần  \nGiáo trình  \n− Digital Image Processing Using Matlab, First Edition, Rafael C. Gonzalez ,Richard E. \nWoods and Steven L. Eddins, Gatesmark Publishing, 2009  \n− Developing Microsoft Media Foundation Applications (Developer Reference), First \nEdition, Anton Polinger, Microsoft Press, English, 2011  \n− Using OpenMP, First Edition, Barbara Chapman, Gabriele Jost and Ruud Van Der Pas, \nThe MIT Press, Cambri dge, Massachusetts, London, English, 2007  \n− Essential COM, First Edition, Don Box, Addison Wesley, 1998  \nTài liệu tham khảo  \n− FFMPEG tutorial, http://dranger.com/ffmpeg/  \nCông cụ hỗ trợ  \n− Visual Studio  \n− OpenMP  \n− FFMPEG  \n− Matlab hoặc Octave  \n− Open Office  "
}