{
    "course_id": "CSC10003",
    "course_name": "Phương pháp lập trình hướng đối tượng",
    "course_start_page": 79,
    "course_end_page": 80,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC10003  - Phương pháp l ập trình hư ớng đối tượng \n \n Thông tin chung  \n− Mã học phần  : CSC10003  \n− Tên tiếng Anh  : Object -Oriented Programming  \n− Khối kiến thức: Bắt buộc  - Cơ sở ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :  Kỹ thuật lập trình  \n Mô tả học phần  \nThe course is designed to provide students the object -oriented concepts, problem analysis, \ndesign and solving. The course helps students to differentiate between procedural programming \nand object -oriented programming. Students are also introduced and instructed with more \nadvanced C++ concepts and featu res such as class, inheritance, polymorphism, operator \noverloading, templates, exception handling, and some design patterns. In particular, students \ncould describe key object -oriented concepts, such as encapsulation, data hiding, inheritance \nand dynamic bi nding, and are able to solve problems using object -oriented programming. In \naddition, students are also guided to work in groups on a substantial computer program during \nthe term, providing a user’s manual and external design documentation. Students are al so \ngained reading comprehension skills and learn to write simple reports in English.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Work independently or in groups to solve problems using object -oriented concepts.  \n− Perform reading comprehension skills, write and present simple reports in English  \n− Use object -oriented, analysis and design concepts to solve real -world problems.  \n− Comprehend the OOP concepts: class, object, data hiding, encapsulation, inheritance, \ndynamic binding...  \n− Descri be the key differences between C++, C#, and Java on some OOP topics   \n 80 − Solve problems in C++ using OOP  \n Nội dung học phần   \n− Introduction to Object -Orient Concepts and Programming  \n− Class, constructors and destructor  \n− Operator overloading  \n− Inheritance  \n− Inheritance  and polymorphism  \n− Const -correctness & Review  \n− Midterm Exam  \n− Templates and meta -programming  \n− Exception handling & RAII  \n− Standard template library (STL): vector, string, streams  \n− Design patterns: Singleton, Composite  \n− Review for the final exam  \n Tài nguyên học phần  \nGiáo trình  \n− C++ Primer Plus, Stephen Prata, 6th edition, Addison -Wesley, 2011.  \nTài liệu tham khảo  \n− The C++ Programming Language, Bjarne Stroustroup, 4th Edition, Addison -Wesley \nProfessional, 2013.  \n− Design Patterns: Elements of Reusable Objected -Oriented Software, Erich Gamma, \nRichard Helm, Ralph Johnson, and John Vlissides,  Addison -Wesley, 1995.  \n− Effective Modern C++: 42 Specific Ways to Improve Your Use of C++11 and C++14 \n1st Edition, Scott Meyers, O'Reilly Media, Incorporated, 1st edit ion, 2014.  \n− Phương pháp lập trình hướng đối tượng, Trần Đan Thư, Đinh Bá Tiến, Nguyễn Tấn \nTrần Minh Khang, Nhà xuất bản Khoa học và Kỹ thuật.  \nCông cụ hỗ trợ  \n− Visual Studio C++  \n− Dev C/C++  "
}