{
    "course_id": "CSC16111",
    "course_name": "Chuyên đề Thị giác máy tính",
    "course_start_page": 303,
    "course_end_page": 304,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC16111  – Chuyên đ ề Thị giác máy tính  \n \n Thông tin chung  \n− Mã học phần  : CSC16111  \n− Tên tiếng Anh  : Research Topics in Computer Vision  \n− Khối kiến thức: Tự chọn  – Kiến thức tốt nghiệp  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Nhập môn l ập trình   \n Mô tả học phần  \nMôn học này nhằm cung cấp cho sinh viên kiến thức nâng cao về lĩnh vực thị giác máy tính \nqua việc trình bày các hướng nghiên cứu chính và phương pháp cơ sở trong từng lĩnh vực của \nthị giác máy tính. Môn học cung cấp cho sinh viên có cái nhìn thực tế đối với các ứng dụng \ncũng như các thách thức đối với ngành TGMT dựa trên nền tảng của khối kiến  thức chuyên \nngành. Môn học cũng giới thiệu với sinh viên các ứng dụng mang tính chất liên ngành giữa \nngành TGMT và các ngành khác trong xã hội qua đó giúp sinh viên nhận biết các cơ hội nghề \nnghiệp trong tương lai.  \n Mục tiêu của học phần  \nSau khoá học, sinh  viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để trình bày một số báo cáo kỹ thuật \ntrong lĩnh vực thị giác máy tính.  \n− Diễn dịch và giải thích được các thuật ngữ tiếng Anh thuộc chuyên ngành Thị Giác \nMáy Tính.  \n− Sử dụng tư duy phân tích logic để đọc hiểu bài báo khoa học và viết chương trình  \n− Biết cách khởi đầu hoạt động nghề nghiệp thông qua đồ án môn học, gợi ý tưởng về \ncác sản phẩm trong tương lai  \n− Xây dựng sản phẩm phần mềm ứng dụng thị giác máy tính đáp ứng một số yêu cầu cho \ntrước.   \n 304 − Sử dụng các công cụ mã nguồn mở để xây dựng hệ thống.  \n Nội dung học phần   \n− Đặt trưng toàn cục  \n− Các phương pháp gom nhóm dựa trên cấu trúc đồ thị  \n− Bài toán phân đoạn ảnh  \n− Mô tả đồ án và các công cụ hổ trợ  \n− Bài toán ảnh stereo  \n− Trường Makov ngẫu nhiên và ứng dụng trong TGMT  \n− Bài toán rút trích thông tin từ Video  \n− Đọc và thảo luận nhóm bài báo chuyên ngành  \n Tài nguyên học phần  \nGiáo trình  \n− Computer Vision: Algorithms and Applications, Richard Szeliski, Springer; 2011.  \nTài liệu tham khảo  \n− Computer Vision: A Modern Approa ch, Second Edition, David A. Forsyth, Jean Ponce, \nPrentice Hall International Inc, 2011.  \nCông cụ hỗ trợ  \n− Visual Studio C++  \n− OpenCV  "
}