{
    "course_id": "CSC13116",
    "course_name": "Đồ án Công nghệ phần mềm",
    "course_start_page": 285,
    "course_end_page": 286,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC13116  - Đồ án Công ngh ệ phần mềm \n \n Thông tin chung  \n− Mã học phần  : CSC13116  \n− Tên tiếng Anh  : Software Engineering Capstone  \n− Khối kiến thức: Tự chọn  - Kiến thức tốt nghiệp  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Các môn chuyên ngành bắt buộc của CNPM   \n Mô tả học phần  \nMôn học được tổ chức dưới dạng một nhóm nhỏ từ 5 đến 7 sinh viên thực hiện một dự án thực \ntế, với khách hàng trong thế giới thực nhằm cung cấp những trải nghiệm thực tế cho sinh viên. \nThông qua môn học, sinh viên sẽ được vận dụng và trải nghiệm lại toàn bộ những kiến thức \ntrong các môn học chuyên ngành, từ khâu phân tích yêu cầu, thiết kế, cài đặt, kiểm tra, chuyển \ngiao và vận hành sản phẩm cho khách hàng. Mỗi thành viên trong nhóm sẽ trải nghiệm những \nvai trò khác nhau và cùng hỗ trợ nhau trong suốt quá trình thực hiện dự án, đem lại những kinh \nnghiệm th ực tiễn trong quá trình giao tiếp nội bộ trong nhóm, giao tiếp với khách hàng.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để trình bày một số báo cáo kỹ thuật theo \nmẫu cho trước trong lĩnh vực kỹ t huật phần mềm  \n− Xây dựng và quản trị yêu cầu của dự án phần mềm  \n− Thiết kế và cài đặt và triển khai dự án  \n− Quản lý tốt dự án phần mềm  \n− Sử dụng hiệu quả các công cụ hỗ trợ phát triển dự án phần mềm  \n− Giao tiếp hiệu quả với khách hàng và các bên liên quan  \n− Nhận thức được tầm quan trọng trong từng khâu của dự án phần mềm  \n Nội dung học phần    \n 286 − Giới thiệu & tổng quan về đề án, nguyên tắc tham gia dự án, phân nhóm và giới thiệu \ndự án  \n− Giới thiệu quy trình phần mềm và lựa chọn quy trình cho dự án  \n− Quản trị yêu cầu phần mềm  (lấy yêu cầu, quản lý, và mô hình hóa)  \n− Công cụ quản lý dự án phần mềm (lên kế hoạch, đánh giá, giám sát dự án)  \n− Đảm bảo chất lượng cho dự án  \n− Sinh viên thực hiện dự án, báo cáo tiến độ hằng tuần  \n− Sinh viên thuyết trình dự án,demo sản phẩm, giới thiệu tài liệ u dự án  \n Tài nguyên học phần  \nGiáo trình  \n− Software Engineering, Ian Sommerville.  \nTài liệu tham khảo  \n− Software Engineering: A Practitioner's Approach,   Roger S. Pressman.  \n− What Every Engineer Should Know about Software Engineering, Laplante, Phillip A.  \n− Kỹ nghệ phần mềm, Tập 1, 2, 3, Roger S. Pressman, Bản dịch của Ngô Trung Việt, \n1999.  \n− Software Requirements, Second Edition, Microsoft Press, Karl E. Wiegers, 2003  \nCông cụ hỗ trợ \n− Các công cụ và môi trường phát triển phần mềm  \n− Các công cụ hỗ trợ quản lý dự án  \n− Các công cụ hỗ trợ giao tiếp khách hàng từ xa  "
}