{
    "course_id": "CSC12109",
    "course_name": "Hệ thống thông tin doanh nghiệp",
    "course_start_page": 166,
    "course_end_page": 167,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC12109  - Hệ thống thông tin doanh nghi ệp \n \n Thông tin chung  \n− Mã học phần  : CSC12109  \n− Tên tiếng Anh  : Introduction to Enterprise Information Systems  \n− Khối kiến thức: Tự chọn  - Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn học này nhằm cung c ấp cho sinh vi ên một cái nhìn tổng qu át về lĩnh vực hệ thống th ông \ntin, c ác kiến thức nền tảng liên quan đ ến các thành ph ần chính yếu trong l ĩnh vực hệ thống \nthông tin (kh ái niệm về hệ thống th ông tin, c ác chi ến lược phát triển hệ thống th ông tin, c ác \nloại hệ thống th ông tin, đ ạo đức nghi ệp nghi ệp...). M ôn học này cũng gi úp xây dựng ki ến thức \nnền tảng cho sinh vi ên chuy ên ngành hệ thông tin nh ằm tạo sự sẵn sàng cho h ọ để có thể tiếp \ncận các môn học chuy ên sâu hơn ở các năm tiếp theo.  \n Mục tiêu của học phần  \nSau khoá học, sinh viê n có khả năng:  \n− Hiểu được hệ thống th ông tin trong doanh nghi ệp (kiến trúc chung, c ác thành ph ần, vai \ntrò, qui tr ình ph át triển ....)  \n− Hiểu được các loại hệ thống th ông tin t ự động hóa và công ngh ệ triển khai  \n− Trình bày được các thách th ức trong ph át triển hệ thống th ông tin  \n Nội dung học phần   \nChương 1: Gi ới thiệu HTTT  \nHTTT l à gì? \nCác thành ph ần, đặc điểm của HTTT?  \nGiới thiệu vai tr ò HTTT trong doanh nghi ệp?  \n 167 HTTT l à gì? \nCác thành ph ần, đặc điểm của HTTT?  \nGiới thiệu vai tr ò HTTT trong doanh nghi ệp? \nChương 2: Ph át triển hệ thống th ông tin  \nGiới thiệu kiến trúc HTTT (Information System Architecture: Zachman)  \nQuy tr ình ph át triển hệ thống th ông tin (IS Systems Development L ife Cycle)  \nChiến lược phát triển HTTT trong doanh nghi ệp  \nGiới thiệu kiến trúc HTTT (Information System Architecture: Zachman)  \nQuy tr ình ph át triển hệ thống th ông tin (IS Systems Development Life Cycle)  \nChương 3: C ác loại HTTT trong doa nh nghi ệp (Business Applications)  \nEDP, ERP,  \nEC, \nData warehouse, BI  \nDSS \nAI technologies in business  \nChương 4: Qu ản lý mô hình nghi ệp vụ (Business process management)  \nMục tiêu mô hình hóa nghi ệp vụ, \nCác kiểu mô hình, \nCông cụ hỗ trợ \nMục tiêu mô hình hóa nghi ệp vụ, \nCác kiểu mô hình, \nCông cụ hỗ trợ \nChương 5: M ột số thách th ức trong qu ản lý HTTT  \nAn to àn bảo mật, \nĐạo đức ngh ề nghiệp, \nQuản lý HTTT to àn cầu... \nChương 6: C ác nhóm nghi ên cứu của BM HTTT  \nHệ thống th ông tin di đ ộng \nHệ thống IR  \nAn toàn bảo m ật \nHệ thống tư vấn \nCơ sở dữ liệu NoSQL  \nDữ liệu lớn... \nTổng kết \n Tài nguyên học phần  \nGiáo trình  \n− Introduction to Information Systems, A. O'Brien, George M. Marakas  \nTài liệu tham khảo   \nCông cụ hỗ trợ  "
}