{
    "course_id": "CSC13107",
    "course_name": "Mẫu thiết kế hướn g đối tượng và ứng dụng",
    "course_start_page": 203,
    "course_end_page": 204,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nCSC13107  – Mẫu thi ết kế hướng đ ối tượng và ứng d ụng \n \n Thông tin chung  \n− Mã học phần:  CSC13107  \n− Tên tiếng Anh  : Object -Oriented Design Patterns and Applications  \n− Khối kiến thức: Tự chọn  – Kiến thức ngành/ chuyên ngành  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Phương pháp lập trình Hướng đối tượng    \n Mô tả học phần  \nSau khi hoàn tất môn học này, sinh viên có khả năng: trình bày tổng quan về mẫu thiết kế \nhướng đối tượng (OO Design Patterns) cùng với các tình huống cần áp dụng những mẫu này, \nvận dụng 23 mẫu thiết kế cơ bản của Gamma và cộng sự để giải quyết một số vấn đề thường \ngặp trong quy trình xây dựng phần mềm, tổ chức mã nguồn chương trình và tái sử dụng các \nthành tố phần mềm nhờ vào việc áp dụng các mẫu thiết kế cơ bản.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Có khả năng cộng tác nhóm để giải quyết các vấn đề trong thiết kế phần mềm hướng \nđối tượng.  \n− Giải thích được các thuật ngữ tiếng Anh liên quan đến thiết kế phần mềm hướng đối \ntượng.  \n− Nhận biết được tầm quan trọng và phân tích ảnh hưởng của bản thiết kế lên chất lượng \nphần mềm.  \n− Mô tả các mẫu thiết kế Gang of Four và giải thích các tình huống sử dụng mẫu.  \n− Áp dụng mẫu thiết kế Gang of Four vào các tình huống cụ thể trong thiết kế phần mề m. \n− Phân tích các nguyên lý hướng đối tượng làm nền tảng cho các mẫu thiết kế.  \n− Đánh giá chất lượng và cải tiến bản thiết kế có sẵn.  \n Nội dung học phần    \n 204 − Tổng quan về mẫu thiết kế hướng đối tượng  \n− Bài tập tình huống Biểu thức:  \n• Mẫu Composite  \n• Mẫu Template Method  \n• Mẫu Singleton  \n• Mẫu Factory Method  \n• Mẫu Strategy  \n− Bài tập luyện tập Mảng  \n− Các nguyên lý lập trình hướng đối tượng SOLID  \n− Bài tập tình huống Đồ họa:  \n• Mẫu Adapter  \n• Mẫu Bridge  \n• Mẫu Abstract Factory  \n• Mẫu Decorator  \n− Các vấn đề nâng cao trong thiết kế hướng đối tượn g: \n• Đa kế thừa  \n• Nguyên l ý Liskov  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \n− Elements of Reusable Object Oriented Software, Erich Gamma, Richard Helm, Ralph \nJohnson, John Vlissides, Addison -Wesley, 1995.  \nTài liệu tham khảo  \n− Head First Design Patterns, Eric Freeman, Elisabeth Freeman, Kathy Sierra, Bert Bates,  \n− O'Reilly Media, Inc., 2004.  \n− Refactoring: Improving the Design of Existing Code, Martin Fowler, Kent Beck, John \nBrant, William Opdyke, Don Roberts, Addison -Wesley, 1999.  \nCông cụ hỗ trợ  \n− Visual Studio .NET  \n− Eclipse  \n− Visio  \n− StarUML  "
}