{
    "course_id": "MTH00030",
    "course_name": "Đại số tuyến tính",
    "course_start_page": 53,
    "course_end_page": 55,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nMTH00030  - Đại số tuyến tính   \n \n Thông tin chung  \n− Mã học phần  : MTH00030  \n− Khối kiến thức: Bắt buộc  - Giáo dục đại cương  \n− Số tín chỉ: 3  \n• Lý thuyết  : 45 \n• Thực hành  : 0 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn học ĐẠI SỐ TUYẾN TÍNH thuộc phạm vi kiến thức khoa học cơ bản.  \nMôn học này nhằm cung cấp cho sinh viên các kiến thức cơ bản, các kết quả và kỹ năng  \nứng dụng của Đại số tuyến tính : ma trận và hệ phương trình tuyến tính, các phép toán ma  \ntrận, tính khả nghịch của ma trận vuông, định thức của ma trận vuông, không gian vecteur  \nRn, không gian vecteur tổng quát và ánh xạ tuyến tính. Các kiến thức này hỗ trợ nhiều cho  \nsinh viê n ngành Công nghệ thông tin tiếp thu tốt các môn học cơ sở và chuyên ngành của  \nmình.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Nhận biết và giải thích được các thuật ngữ tiếng Pháp liên quan đến môn học.  \n− Thực hành tốt việc giải và biện luận các hệ phương trình tuyến tính.  \n− Thực hành tốt các phép tính ma trận và biết vận dụng ma trận khả nghịch để giải phương \ntrình ma trận.  \n− Thực hành tốt việc tính định thức của ma trận để sử dụng vào việc giải hệ phương trình \ntuyến tính, tìm hạng ma trận, xét tính khả nghịch và tìm ma trận nghịch đảo.  \n− Vận dụng tốt các kiến thức về hệ phương trình tuyến tính, các phép tính ma trận, ma \ntrận khả nghịch và định thức ma trận để mô tả cấu trúc Không gian vecteur cùng các \nvấn đề liên quan (không gian con, tập sinh , tập hợp độc lập hoặc phụ thuộc tuyến tính, \ncơ sở, tọa độ vecteur theo cơ sở, ma   \n 54 − trận đổi cơ sở, công thức đổi tọa độ).  \n− Vận dụng thành thạo Không gian vecteur để nghiên cứu  \n− Ánh xạ tuyến tính giữa các không gian vecteur cùng các vấn đề liên quan (cơ sở khô ng \ngian nhân, cơ sở không gian ảnh, ma trận biểu diễn ánh xạ tuyến tính, công thức thay \nđổi ma trận biểu diễn theo các cơ sở, tìm ánh xạ tuyến tính dựa theo ảnh một cơ sở).  \n− Nhận biết các nguyên tắc đạo đức và trách nhiệm trong học tập.  \n− Có cách suy nghĩ sán g tạo, giàu tính phản biện. Có tinh thần học và tự học nghiêm túc.  \n Nội dung học phần   \nChương 1:MA TRẬN VÀ HỆ PHƯƠNG TRÌNH TUYẾN TÍNH.  \n1.1: Ma trận và các phép biến đổi sơ cấp trên dòng.  \n1.2: Hệ phương trình tuyến tính.  \n1.3: Phương pháp giải hệ phương trình tuyến tính.  \n1.4: Hạng của ma trận.  \nChương 2: CÁC PHÉP TOÁN MA TRẬN - MA TRẬN VUÔNG KHẢ NGHỊCH.  \n2.1 : Các phép toán ma trận.  \n2.2: Các phép toán trên ma trận vuông.  \n2.3: Ma trận khả nghịch.  \n2.4: Giải phương trình ma trận.  \nChương 3: ĐỊNH THỨC CỦA MA TRẬ N VUÔNG.  \n3.1: Định thức.  \n3.2: Định thức và các phép biến đổi sơ cấp trên dòng và trên cột.  \n3.3: Định thức và tính khả nghịch của ma trận.  \n3.4: Qui tắc Cramer.  \nChương 4: KHÔNG GIAN VECTEUR.  \n4.1: Không gian vecteur Rn  \n4.2: Không gian vecteur con.  \n4.3: Không gian con sinh bởi một tập hợp hữu hạn.  \n4.4: Tính độc lập và phụ thuộc tuyến tính của một tập hợp hữu hạn.  \n4.5: Cơ sở và số chiều của Không gian vecteur.  \n4.6: Tọa độ của vecteur theo cơ sở.  \nChương 5: ÁNH XẠ TUYẾN TÍNH  \n5.1: Các khái niệm cơ bản.  \n5.2: Ma trận  biểu diễn ánh xạ tuyến tính theo các cơ sở.  \n5.3: Xác định ánh xạ tuyến tính từ ảnh của một cơ sở.  \nÔn tập thi cuối kỳ.  \n Tài nguyên học phần  \nGiáo trình  \n− Bài giảng ĐẠI SỐ TUYẾN TÍNH, Lê Văn Hợp. Link : http://www.bit.do/dstt -hop \nTài liệu tham khảo  \n− Bùi Xuân Hải (chủ biên), Đại số tuyến tính và ứng dụng (Tập 1), NXB Đại học quốc \ngia TPHCM, 2011.  \n− Nguyễn Hữu Việt Hưng, Đại số tuyến tính, NXB Đại học quốc gia Hà Nội, 2004.  \n− Ngô Việt Trung, Đại số tuyến tính, NXB Đại học quốc gia Hà Nội , 2001.  \n− Nguyễn Viết Đông, Lê Thị Thiên Hương, Nguyễn Anh Tuấn, Lê Anh Vũ, Toán cao \ncấp, tập 2 (sách lý thuyết và sách bài tập), NXB Giáo dục, 1998.   \n 55 − Jean - Marie Monier, Đại số 1, NXB Giáo dục, 2001 (Dunod Paris, 1996).  \n− Jean - Marie Monier, Đại số 2, NXB Gi áo dục, 2001 (Dunod Paris, 1996).  \n− Gilbert Strang, Linear Algebra and learning from data, Wellesley - Cambridge Press, \n2019.  \n− David C.Lay, Steven R.Lay, Judi J. McDonald, Linear Algebra and its Applications, \nPearson, 2015.  \n− Howard Anton, Chris Rorres, Element ary linear Algebra : Applications, Wiley, 10th, \n2010.  \n− David C.Lay, Linear Algebra and its Applications, Addition Wesley, 1994.  \n− Charles G. Cullen, Matrices and linear transformations, Dove Publications, 1985.  \n− Jean Guégand, Jean - Pierre Gavini, Algèbre, Ell ipses, Paris, 1995.  \n− Voiévodine, Algèbre linéaire, Édition MIR Moscou,1976.  \nH. Ikramov, Receueil de problèmes d’algèbre linéaire, Édition MIR Moscou,1977.  \nCông cụ hỗ trợ  \n− Phần mềm Maple.  "
}