{
    "course_id": "MTH00005",
    "course_name": "Vi tích phân 1",
    "course_start_page": 37,
    "course_end_page": 39,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nMTH00005  – Vi tích phân 1   \n \n Thông tin chung  \n− Mã học phần  : MTH00005  \n− Khối kiến thức: Bắt buộc  – Đại cương  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn học được thiết kế dành cho sinh viên khoa Công nghệ  Thông tin. Môn học này sẽ trang \nbị cho sinh viên một cách có hệ thống kiến thức đại cương về phép tính vi tích phân hàm một \nbiến và lý thuyết về chuỗi số. Cụ thể, sinh viên sẽ học về hàm số một biến, các tính chất, các \nphép tính giới hạn, phép tính đạo hà m và phép tính tích phân của hàm một biến, lý thuyết cơ \nbản về dãy số, chuỗi số và chuỗi lũy thừa. Sinh viên không chỉ được giảng dạy kỹ năng tính \nmà còn trang bị kiến thức toán giải tích một biến nhằm giúp cho sinh viên có khả năng vận \ndụng tư duy logic t oán để giải quyết các bài toán ứng dụng trong thực tiễn và các môn học \nkhác. Để làm được như vậy, ở mỗi chương ngoài phần lý thuyết trình bày về cơ sở toán, chúng \ntôi sẽ hướng người học đến một số ứng dụng mang tính học thuật, một số thí dụ ứng dụng gợi \nmở, liên quan trực tiếp đến các vấn đề về công nghệ thông tin.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Nắm vững kiến thức nền tảng của vi tích phân hàm một biến như: hàm số, đạo hàm, vi \nphân, tích phân, dãy số và chuỗi số.  \n− Vận dụng được kiến thức đã học để giải quyết các bài toán thực tế có liên quan đến các \nchủ đề đã học.  \n− Phân tích, tư duy có logic toán để giải quyết các bài toán ứng dụng trong thực tiễn.  \n− Đọc hiểu tài liệu bằng tiếng Anh  \n  \n 38 \n Nội dung học phần   \nChương 1: Hàm số  \nHàm số - Hàm đơn ánh, toàn ánh, song ánh  \nHàm đơn điệu – Hàm bị chặn  \nHàm hợp - Hàm ngược  \nĐồ thị hàm số  \nCác phép biến đổi đồ thị,  \nBốn cách biểu diễn một hàm số  \nGiới hạn của hàm số - Giới hạn trái – Giới hạn phải – Giới hạn trên một miền  \nCác qui tắc gi ới hạn. Định lý bất đẳng thức kẹp  \nHàm số liên tục: Hàm liên tục tại một điểm, liên tục trên một miền - Một số tính chất \nhàm số liên tục  \nĐịnh lý giá trị trung gian  \nChương 3: Phép tính vi phân hàm một biến  \nXét hai bài toán trung tâm: tìm tiếp tuyến của đường  cong – tìm vận tốc tức thời trong \nchuyến động thẳng  \nĐạo hàm - Đạo hàm của hàm hợp, hàm ngược  \nĐạo hàm bậc cao – Định lý Leibniz – Khai triển Taylor – MacLaurin  \nChương 4: Ứng dụng của đạo hàm  \nXấp xỉ tuyến tính  \nLiên hệ giữa các vận tốc  \nĐiểm tới hạn – Điểm d ừng – Cực trị của hàm số  \nĐịnh lý giá trị trung bình  \nĐạo hàm cấp 1 - Hàm đơn điệu  \nĐạo hàm cấp 2 - Tính lồi lõm của hàm số, vẽ đồ thị hàm số  \nCác dạng vô định – Qui tắc l’Hôpital  \nPhương pháp Newton  \nNguyên hàm – Tích phân bất định – Các tính chất cơ bản của tích phân bất định  \nChương 5: Phép tính tích phân hàm một biến  \nXét bài toán tính diện tích của một miền phẳng bị chận - Tổng Rieman  \nTích phân xác định  \nĐịnh lý cơ bản của phép tính vi tích phân  phần 1 - Định lý cơ bản của phép tính vi tích \nphân  phần 2 (Côn g thức Newton Leibniz)  \nCác phương pháp tích phân: Phương pháp đổi biến – Phương pháp tích phân từng phần  \nCác chặn sai số trong xấp xỉ tích phân bằng tổng Riemann  \nTích phân suy rộng: Tích phân suy rộng loại 1 – Tích phân suy rộng loại 2 – Các tiêu \nchuẩn hội  tụ của tích phân suy rộng  \nXấp xỉ tích phân  \nChương 6: Ứng dụng của tích phân hàm một biến  \nDiện tích giữa các đường cong  \nThể tích của hình khối  \nĐộ dài dây cung  \nGiá trị trung bình của một hàm  \nChương 7: Lý thuyết chuỗi  \nDãy số thực  \nDãy số  \nDãy đơn điệu - Dãy b ị chặn  \nSự hội tụ của dãy  \nGiới hạn của dãy số. Đinh lý bất đẳng thức kẹp – Định lý Weierstrass   \n 39 Chuỗi số thực  \nChuỗi không âm – Tiêu chuẩn so sánh, Tiêu chuẩn tích phân  \nChuỗi có dấu bất kỳ: Tiêu chuẩn Cauchy, Tiêu chuẩn d'Alembert  \nChuỗi đan dấu - Định lý Leibniz  \nChuỗi lũy thừa  \nBán kính hội tụ - miền hội tụ  \nXấp xỉ một hàm bằng đa thức Taylor – Định lý phần dư Taylor  \nChương 8: Phương Trình Vi Phân  \nVí dụ mở đầu  \nĐịnh nghĩa phương trình vi phân  \nPhân loại nghiệm của phương trình vi phân: nghiệm tổng quát, nghi ệm riêng, nghiệm \nkì dị \nBài toán Cauchy – Điều kiện tồn tại nghiệm của bài toán Cauchy  \nPhương trình tách biến. Phương trình tuyến tính  \n Tài nguyên học phần  \nGiáo trình  \n− Vi tích phân 1, Bộ môn Giải tích, trường ĐH KHTN, ĐHQG -HCM biên soạn, 2020  \n− Calculus, Jame s Stewart, Early Transcendentals, 7th edition, Brooks Cole, 2012  \nTài liệu tham khảo  \n− Giải tích 1, James Stewart, Calculus, Early Transcendentals, 7th edition, Brooks Cole, \n2012 (Bản dịch tiếng việt do Đại học Hồng Đức dịch)  \nCông cụ hỗ trợ  "
}