{
    "course_id": "MTH00051",
    "course_name": "Toán ứng dụng và thống kê",
    "course_start_page": 62,
    "course_end_page": 63,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nMTH00051  – Toán ứng dụng và th ống kê  \n \n Thông tin chung  \n− Mã học phần  : MTH00051  \n− Tên tiếng Anh  : Applied Mathematics and Statistics  \n− Khối kiến thức: Tự chọn  – Đại cương  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :  Đại số tuyến  tính, Xác su ất thống kê, Vi tích phân 1 , Vi tích \nphân 2  \n Mô tả học phần  \nMôn học này hệ thống hóa các kiến thức Toán sinh viên đã học trong 3 học kỳ đầu đại học \n(giải tích, đại số tuyến tính, xác suất -thống kê) và giới thiệu các kỹ năng thuật toán, lậ p trình \nđể sinh viên có thể nắm bắt và giải quyết các bài toán liên quan đến phân tích dữ liệu. Cụ thể, \nmôn học gồm 3 khối kiến thức:  \n− Đại số ma trận và kỹ thuật xử lý ma trận, đặc biệt các ma trận thưa.  \n− Giải tích và phương pháp tính giải bài toán tối ưu.  \n− Thống kê và các mô hình thống kê.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm  \n− Biết và giải thích được các thuật ngữ tiếng Anh thuộc chuyên ngành KHMT  \n− Giải thích được các khái niệm cơ bản, thuật ngữ  \n− Xác định các vấn đề liên quan đến KHMT và ứng dụng toán  \n− Hiểu và hiện thực ở mức độ cơ bản các phương pháp toán và thống kê được giảng dạy  \n− Xây dựng được một số mô -đun ứng dụng toán  \n− Sử dụng các công cụ phần mềm hỗ trợ  \n Nội dung học phần    \n 63 − Hệ phương trình tuyế n tính  \n− Vec-tơ \n− Ma-trận \n− Phân tích ma -trận: QR (Gram -Schmidt), Trị riêng và vector riêng, Chéo hóa và chéo \nhóa trực giao, đọc thêm SVD (2 tuần)  \n− Dạng toàn phương, ma trận xác định dương và ứng dụng  \n− Hàm lồi và tối ưu lồi  \n− Phương pháp bình phương tối tiểu và ứng dụng (2 tuần)  \n− Ôn tập: xác xuất, xác suất có điều kiện và biến ngẫu nhiên rời rạc  \n− Xích Markov và ứng dụng (2 tuần)  \n Tài nguyên học phần  \nGiáo trình  \n− S. Boyd, L. Vandenberghe, Introduction to Applied Linear Algebra: Vectors, Matrices, \nand Least Squares, 1st edition, Cambridge University Press, 2018.  \nTài liệu tham khảo  \n− G. H. Golub, C. F. Van Loan, Matrix computations, 4th edition, Johns Hopkins \nUniversity Press, 2013.  \n− G. Strang, Linear Algebra and Learning from Data, 1st edition, Wellesley -Cambri dge \nPress, 2019.  \n− S. Boyd, L. Vandenberghe, Convex optimization, 7th edition, Cambridge University \nPress, 2009.  \n− R. V. Hogg, J. W. McKean, A. T. Craig, Introduction to mathematical statistics, 8th \nedition, Pearson, 2018.  \n− Đ. Đ. Trọng, Đ. N. Thanh, Lý thuyết t hống kê, NXB ĐHQG Tp HCM, 2016.  \n− Đ. N. Thanh et. al., Bài tập và thực hành lý thuyết thống kê, NXB ĐHQG Tp HCM, \n2016.  \nCông cụ hỗ trợ  \n− Python  \n− Anaconda, Jupyter Lab/Notebook, Google Colab  \n− NumPy, SciPy, SymPy, pandas, Matplotlib, scikit -learn,  .."
}