{
    "course_id": "MTH00040",
    "course_name": "Xác suất thống kê",
    "course_start_page": 48,
    "course_end_page": 49,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nMTH00040  - Xác su ất thống kê   \n \n Thông tin chung  \n− Mã học phần  : MTH00040  \n− Khối kiến thức:  Bắt buộc  - Đại cương  \n− Số tín chỉ:   \n• Lý thuyết  :  3 \n• Thực hành  :  45 \n• Bài tập  :  0 \n− Học phần học trước  :  0 \n Mô tả học phần  \nMục tiêu chung: cung c ấp các kiến thức cơ bản của Lý thuyết xác suất và Lý thuyết thống kê \ntoán. Lý thuyết xác suất - ngành khoa h ọc về các hiện tượng ng ẫu nhi ên. Lý thuyết thống kê \ntoán phân tích số liệu để đưa ra c ác mô hình tổng qu át và các quy ết định th ống kê. \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Kiến thức: Môn học cung c ấp các kiến thức và các khái niệm cơ bản nhất của xác suất \n− thống kê làm kiến thức nền cho nh ững môn học sau.  \n− Kỹ năng: V ận dụng xác suất thống kê để giải quy ết một số bài toán thực tế liên quan  \n− đến việc phân tích và trình bày dữ liệu. \n− Thái độ, chuy ên cần: M ôn học giúp sinh vi ên có hiểu biết ban đ ầu về xác suất thống kê \ncũng nh ư nhận biết được vai tr ò của xác suất thống kê trong nhi ều lĩnh vực khoa h ọc \nvà đời sống. T ừ đó hình th ành nên sự yêu thích khoa h ọc, có thái độ nghiêm túc, tích \ncực trong h ọc tập. \n Nội dung học phần   \n− Các khái niệm cơ bản về xác suất, biến ngẫu nhi ên, một số phân phối xác suất thông \n− dụng, kho ảng tin c ậy, kiểm định gi ả thuyết, hồi quy v à tương quan.  \n Tài nguyên học phần  \nGiáo trình   \n 49 − Xác Suất Thống K ê, Nguy ễn Th ị Mộng Ng ọc (ch ủ biên), 2018  \n− Bài Tập và Thực Hành X ác Suất Thống K ê, Nguy ễn Thị Mộng Ng ọc (ch ủ biên), 2018  \nTài liệu tham khảo  \n− Giáo trình lý thuyết xác suất và thống kê toán, Tr ần Tuấn Điệp, Lý Hoàng Tú, 1979  \n− Bài tập Lý thuyết xác suất và thống kê toán, Ho àng H ữu Nh ư, Nguy ễn Văn Hữu, 1978  \n− Lý Thuy ết Thống K ê, Đặng Đ ức Trọng (ch ủ biên), 2016  \n− Bài Tập và Thực Hành L ý Thuy ết Thống K ê, Đinh Ng ọc Thanh (ch ủ biên), 2016  \n− Probability and Statistics: Theory  and Applications, Gunnar Blom, 1989  \n− Statistics Applications for Environmental Science, Stacey J. Shaefer, Louis Theodore, \n2007  \n− Applied Statistics and Probability for Engineers, 5ed, Douglas C. Montgomery, George \nC. Runger, 2011  \nCông cụ hỗ trợ  "
}