{
    "course_id": "MTH00006",
    "course_name": "Vi tích phân 2",
    "course_start_page": 43,
    "course_end_page": 45,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nMTH00006  - Vi tích phân 2   \n \n Thông tin chung  \n− Mã học phần  : MTH00006  \n− Khối kiến thức: Bắt buộc  - Đại cương  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Vi tích phân 1B ( phải có kết quả Đạt )   \n Mô tả học phần  \nMôn học được thiết kế dành cho sinh viên khoa Công nghệ Thông tin. Môn học này sẽ trang \nbị cho sinh viên một cách có hệ thống kiến thức đại cương về phép tính vi tích  phân hàm nhiều \nbiến và đại cương về phương trình vi phân cấp một, cấp hai. Cụ thể, sinh viên sẽ học về không \ngian Euclide nhiều chiều, hàm số nhiều biến, các tính chất, các phép tính giới hạn, phép tính \nđạo hàm riêng phân, đạo hàm theo hướng và phép tính tích phân của hàm nhiều biến (chủ yếu \nlà hai và ba biến), đại cương về trường vector, phép tính tích phân đường loại một, loại hai và \nphương trình vi phân. Sinh viên không chỉ được giảng dạy kỹ năng tính mà còn trang bị kiến \nthức toán giải tích nhiều biến nhằm giúp cho sinh viên có khả năng vận dụng tư duy logic toán \nđể giải quyết các bài toán ứng dụng trong thực tiễn và các môn học khác. Để làm được như \nvậy, ở mỗi chương ngoài phần lý thuyết trình bày về cơ sở toán, chúng tôi sẽ hướng người học \nđến một số ứng dụng mang tính học thuật, một số thí dụ ứng dụng gợi mở, liên quan trực tiếp \nđến các vấn đề về công nghệ thông tin, vật lý, cơ học và các ngành khoa học ứng dụng có liên \nquan khác.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Nắm vững kiến thức nền tảng của vi tích phân hàm nhiều biến biến như: không gian \nEuclide nhiều chiều, hàm số, đạo hàm riêng phần, đạo hàm theo hướng, tích phân bội  \n 44 hai - bội ba, trường vector hai chiều - ba chiều, tích phân đường loại một - loại hai và \nphương trình vi phân.  \n− Vận dụng được kiến thức đã học ( Vi tích phân 1B) để giải quyết các bài toán thực tế \ncó liên quan đến các chủ đề đã học.  \n− Phân tích, tư duy có logic toán để giải quyết các bài toán ứng dụng trong thực tiễn.  \n− Đọc hiểu tài liệu bằng tiếng A nh \n− Có khả năng nhìn nhận và giải quyết bài tập, vấn đề một cách khoa học, toàn diện và \ncó hệ thống, vận dụng linh hoạt các kiến thức, kỹ năng và kinh nghiệm để giải quyết \ncác bài toán từ dễ đến khó và khác nhau  \n Nội dung học phần   \n− Giới thiệu môn học  \n− Không gian R^n (với n=2,3 là chính)  \n− Khoảng cách trong R^n  \n− Khái niệm tập mở trong R^n  \n− Hàm số nhiều biến: miền xác định và đồ thị.  \n− Định nghĩa Giới hạn hàm nhiều biến ( n=2,  3 là chính) theo khoảng cách  \n− Sự tồn tại giới hạn theo các hướng trên các đường cong k hác nhau  \n− Sự liên tục của hàm nhiều biến.  \n− Đạo hàm riêng phần của các hàm số nhiều biến.  \n− Các quy tắc tính đạo hàm  \n− Đạo hàm các hàm số có các đạo hàm riêng phần liên tục.  \n− Áp dụng: phương trình mặt phẳng tiếp xúc, xấp xỉ tuyến tính  \n− Đạo hàm riêng phần cấp cao. Đ ạo hàm cấp cao  \n− Khai triển Taylor  \n− Cực trị của hàm số nhiều biến.  \n− Các ứng dụng khác  \n− Tích phân bội 2: Định nghĩa. Ý nghĩa hình học.  \n− Các tính chất của tích phân bội 2.  \n− Phương pháp tính tích phân bội 2 trên hình chữ nhật loại 1, loại 2.  \n− Đổi biến trong tích phân bội 2. Trường hợp tổng quát.  \n− Tích phân bội 2  trong hệ toạ độ cực.  \n− Ứng dụng của tích phân bội 2 trong hình học, cơ học.  \n− Tích phân bội ba trên hình hộp chữ nhật, hình chữ nhật loại 1,2,3.  \n− Tích phân bộ ba trong tọa độ trụ (nếu đủ t hời lượng)  \n− Trường vector. Trường bảo toàn  \n− Đường cong tham số.  \n− Tích phân đường loại 1  \n− Tích phân đường loại 2.  \n− Mối liên hệ giữa Tích phân đường loại 1 và 2.  \n− Công cơ học  \n− Khảo sát trường vector bảo toàn.  \n− Tích phân đường loại 2 và trường vector bảo toàn  \n− Công t hức Green  \n− Phương trình vi phân cấp 1. Các mô hình có phương trình vi phân. Phương trình tách \nbiến. Phương trình đẳng cấp.  \n− Phương trình vi phân cấp 1 tuyến tính   \n 45 − Phương trình vi phân cấp 2: Định nghĩa. Điều kiện tồn tại nghiệm  \n− Phương trình vi phân cấp 2 tuyế n tính hệ số hằng: vế phải bằng không và vế phải là các \nhàm đơn giản  \n− Ôn tập.  \n Tài nguyên học phần  \nGiáo trình  \n− Vi tích phân 1, Bộ môn Giải tích, trường ĐH KHTN, ĐHQG -HCM biên soạn, 2020  \n[Link của giáo trình: \nhttps://drive.google.com/file/d/1NA1G0NSIVjnu_zG7e 0JTnOvGfFqmuuVg/view]Ca\nlculus, James Stewart, Early Transcendentals, 7th edition, Brooks Cole, 2012  \nTài liệu tham khảo  \n− Giải tích 1, James Stewart, Calculus, Early Transcendentals, 7th edition, Brooks Cole, \n2012 (Bản dịch tiếng việt  của [2] do Đại học Hồn g Đức dịch)  \nCông cụ hỗ trợ  "
}