{
    "course_id": "MTH00008",
    "course_name": "Đại số tuyến tính",
    "course_start_page": 50,
    "course_end_page": 52,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nMTH00008  - Đại số tuyến tính   \n \n Thông tin chung  \n− Mã học phần  : MTH00008  \n− Khối kiến thức: Bắt buộc  - Đại cương  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  : Toán r ời rạc  (MTH 00009)   \n Mô tả học phần  \nMôn học ĐẠI SỐ TUYẾN TÍNH thuộc phạm vi kiến thức khoa học cơ bản. Môn học này giúp \ncho sinh viênnắm vững các khái niệm, tính chất và kỹ năng ứng dụng cơ bản nhất của Đại số \ntuyến tính : ma trận và hệ phương trình tuyến tính, các phép toán ma trận, ma trận vuông khả \nnghịch, định thức của ma trận vuông, không gian vector Rn, không gian vector tổng quát và \nánh xạ tuyến tính. Các kiến thức này hỗ trợ nhiều cho sinh viên ngành Công nghệ thông tin \ntiếp thu tốt các môn học cơ sở và chuyên ngành của mình.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Nhận biết và giải thích được các thuật ngữ  tiếng Anh liên quan đến môn học.  \n− Thực hành tốt việc giải và biện luận các hệ phương trình tuyến tính.  \n− Thực hành tốt các phép tính ma trận và biết vận dụng ma trận khả nghịch để giải phương \ntrình ma trận.  \n− Thực hành tốt việc tính định thức của ma trận để sử  dụng vào việc giải hệ phương trình \ntuyến tính, tìm hạng ma trận, xét tính khả nghịch và tìm ma trận nghịch đảo.  \n− Vận dụng tốt các kiến thức về hệ phương trình tuyến tính, các phép tính ma trận, ma \ntrận khả nghịch và định thức ma trận để mô tả cấu trúc Khô ng gian vector cùng các vấn \nđề liên quan (không gian con, tập sinh, tập hợp độc lập hoặc phụ thuộc tuyến tính, cơ \nsở, tọa độ vectơ theo cơ sở, ma trận đổi cơ sở, công thức đổi tọa độ).  \n− Vận dụng thành thạo Không gian vector để nghiên cứu Ánh xạ tuyến tính g iữa các \nkhông gian vector cùng các vấn đề liên quan (cơ sở không gian nhân, cơ sở không gian  \n 51 ảnh, ma trận biểu diễn ánh xạ tuyến tính, công thức thay đổi ma trận biểu diễn theo các \ncơ sở, tìm ánh xạ tuyến tính dựa theo ảnh một cơ sở).  \n− Hiểu rõ các nguyên tắ c đạo đức và trách nhiệm trong học tập.  \n Nội dung học phần   \nChương 1:  MA TRẬN VÀ HỆ  PHƯƠNG TRÌNH  TUYẾN TÍNH.  \n1.1: Ma trận và các phép  biến đổi sơ cấp trên  dòng.  \n1.2: Hệ phương trình tuyến  tính. \n1.3: Phương pháp giải hệ phương trình tuyến tính.  \n1.4: Hạng của ma trận.  \nChương 2: CÁC PHÉP TOÁN MATRẬN - MA TRẬN  VUÔNG KHẢ NGHỊCH.  \n2.1 : Các phép toán ma trận.  \n2.2: Các phép toán trên ma trận vuông.  \n2.3: Ma trận khả nghịch.  \n2.4: Giải phương trình ma  trận. \n Chương 3: ĐỊNH THỨC CỦA MA  TRẬN VUÔNG.  \n3.1: Định thức.  \n3.2: Định thức và các phép  biến đổi sơ cấp trên  dòng và trên cột.  \n3.3: Định thức và tính khả  nghịch của ma trận.  \n3.4: Qui tắc Cramer.  \n Chương  4: KHÔNG GIAN VECTOR.  \n4.1: Không gian vectơ  Rn .  \n4.2: Không gian vectơ con.  \n4.3: Không gian con sinh  bởi mộ t tập hợp hữu hạn.  \n4.4: Tính độc lập và phụ  thuộc tuyến tính của  một tập hợp hữu hạn.  \n4.5: Cơ sở và số chiều của  Không gian vectơ.  \n4.6: Tọa độ của vectơ theomột cơ sở.  \n Chương  5 : ÁNH XẠ TUYẾN TÍNH  \n5.1: Các khái niệm cơ bản.  \n5.2: Ma trận biểu diễn ánh  xạ tuyến tính theo các  cơ sở.  \n5.3: Xác định ánh xạ tuyến  tính từ ảnh của một cơ sở.                 \nÔn tập thi Giữa kỳ & cuối kỳ.  \n Tài nguyên học phần  \nGiáo trình  \n− Bài giảng ĐẠI SỐ TUYẾN TÍNH, Nguyễn Viết Đông  \n− (https://sites.google.com/site/nguyenvietdongsite/Home/dai -so-tuyen -tinh)  \n− Bài giảng ĐẠI SỐ TUYẾN TÍNH, Lê Văn Hợp (http://www.bit.do/dstt -hop).  \nTài liệu tham khảo  \n− ĐẠI SỐ TUYẾN TÍNH VÀ ỨNG DỤNG ( Tập 1), Bùi Xuân Hải (chủ biên), NXB Đại \nhọc quốc gia  TPHCM , 2011.  \n− ĐẠI SỐ TUYẾN TÍNH, Nguyễn Hữu Việt Hưng, NXB Đại học quốc gia Hà Nội, 2004.  \n− ĐẠI SỐ TUYẾN TÍNH, Ngô Việt Trung, NXB Đại học quốc gia Hà Nội, 2001.  \n− TOÁN CAO CẤP, Tập 2 (Sách lý thuyết và sách bài tập), Nguyễn Viết Đông, Lê Thị \nThiên Hương, Nguyễn Anh  Tuấn, Lê Anh Vũ , NXB Giáo dục, 1998.  \n− ĐẠI SỐ 1, Jean - Marie Monier, NXB Giáo dục, 2001(Dunod  Paris, 1996).  \n− ĐẠI SỐ 2, Jean - Marie Monier, NXB Giáo dục, 2001 (Dunod  Paris, 1996).   \n 52 − LINEAR ALGEBRA AND LEARNING FROM DATA, Gilbert Strang, Wellesley - \nCambrid ge Press, 2019.  \n− LINEAR ALGEBRA AND ITS APPLICATIONS, David  C.Lay, Steven R.Lay, Judi \nJ. McDonald, Pearson, 2015.  \n− ELEMENTARY LINEAR ALGEBRA : APPLICATIONS, Howard Anton, Chris \nRorres, Wiley, 10th, 2010.       \n− LINEAR ALGEBRA AND ITS APPLICATIONS, David C.La y, Addition Wesley, \n1994.  \n− MATRICES AND LINEAR TRANSFORMATIONS, Charles G. Cullen, Dove \nPublications, 1985.  \n− ALGÈBRE, Jean Guégand & Jean - Pierre Gavini, Ellipses, Paris, 1995.  \nCông cụ hỗ trợ  "
}