{
    "course_id": "MTH00007",
    "course_name": "Xác suất thống kê",
    "course_start_page": 46,
    "course_end_page": 47,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nMTH00007  – Xác su ất thống kê   \n \n Thông tin chung  \n− Mã học phần  : MTH00007  \n− Khối kiến thức: Bắt buộc  – Đại cương  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nMôn học này nhằm cung cấp cho sinh viên các khái niệm cơ bản về xác suất, biến ngẫu nhiên, \nmột số phân phối xác suất thông dụng, khoảng tin cậy, kiểm định giả thuyết, hồi quy và tương \nquan.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Hiểu các kiên thức cơ bản về xác suất  \n− Hiểu các kiên thức cơ bản về thống kê  \n− Khả năng phân tích, giải thíc h và lập luận để giải quyết các bài toán xác suất thống kê \nvà khả năng tự đọc tài liệu theo hướng dẫn gợi ý của giáo viên.  \n− Kỹ năng làm việc nhóm, giao tiếp và thuyết trình giải thích vần đề trong nhóm cũng \nnhư trước lớp.  \n− Sử dụng các công cụ phần mềm hỗ trợ \n Nội dung học phần   \n− Biến cố và xác suất  \n− Biến ngẫu nhiên  \n− Các phân phối thông dụng  \n− Vector ngầu nhiên  \n− Thống kê mô tả  \n− Ước lượng   \n 47 − Kiểm định giả thuyết  \n− Hồi qui và tương quan  \n− Ôn tập  \n Tài nguyên học phần  \nGiáo trình  \n− Bài Tập Xác Suất Thống Kê, Nguyễn Thị Mộng Ngọc (chủ biên)  \nTài liệu tham khảo  \n− Lý Thuyết Thống Kê, Đặng Đức Trọng (chủ biên), 2016  \n− Bài Tập và Thực Hành Lý Thuyết Thống Kê, Đinh Ngọc Thanh (chủ biên), 2016  \n− Giáo trình lý thuyết xác suất và thống kê toán, Trần Tuấn Điệp, Lý Hoàng Tú, 1979  \n− Bài tập Lý t huyết xác suất và thống kê toán, Hoàng Hữu Như, Nguyễn Văn Hữu, 1978  \n− Probability and Statistics: Theory and Applications, Gunnar Blom, 1989  \n− Statistics Applications for Environmental Science, Stacey J. Shaefer, Louis Theodore, \n2007  \n− Applied Statistics and Pr obability for Engineers, 5ed, Douglas C. Montgomery, George \nC. Runger, 2011  \nCông cụ hỗ trợ  \n− R  và R Studio  "
}