{
    "course_id": "PHY00006",
    "course_name": "Vật lý đại cương 2",
    "course_start_page": 69,
    "course_end_page": 70,
    "content": "ĐỀ CƯƠNG TÓM TẮT \nPHY00006  - Vật lý đ ại cương 2   \n \n Thông tin chung  \n− Mã học phần  : PHY00006  \n− Khối kiến thức: Tự chọn  - Đại cương  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :    \n Mô tả học phần  \nThe Internet of Things (IoT) is a special network of objects or sensors that allow them to \nconnect to each other to collect and exchange data to bring quality of life for people and society.  \nIn this course, we will learn more about the concept of IoT, common electronic circuit boards, \nresearch IoT products, build a basic IoT system to control electronic devices.  \nIn addition, with the growing trend of Big Data and Artificial Intelligen ce, it is essential to \nunderstand and apply artificial intelligence knowledge to IoT products.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Understand the technical specifications, operating principles of electrical circuits, \nsensors, electro nic components.  \n− Fluent in using and programming some popular electronic circuits such as Arduino, \nESP 8266, Raspberry Pi 3.  \n− Know how to design 3D models and use 3D printers.  \n− Know how to build a basic Internet of Things (IoT) system, using web / mobile to \ncontrol electrical devices in the house, at school or at work.  \n− Understand the application of Artificial Intelligence knowledge (Natural language \nprocessing, Speech language processing, Digital image processing) processing on \nRaspberry Pi 3 board.  \n− Organize t eamwork, tasks assignment and report presentation.  \n  \n 70 \n Nội dung học phần   \n− Introduce the course content  \n− Introduce Arduino electronic board  \n− Program on Arduino board to control LED, some basic sensors such as light sensor, \nmotion sensor, humidity and temperature  sensor…  \n− Program to display text on LCD screen  \n− Assemble and program to control a mini vehicle with Bluetooth and motor.  \n− Design 3D models with Autodesk Fusion 360.  \n− Assemble and program a complete product with Arduino, sensor and wrapped by 3D \nmodel.  \n− Introdu ce ESP 8266 and Raspberry Pi 3 boards.  \n− Install and config Raspbian Operating System for Raspberry Pi 3.  \n− Introduce Socket concept and data transmission/reception model.  \n− Program communication between ESP8266 and Raspberry Pi 3 via local wireless \nnetwork.  \n− Introduce a basic Internet of Things system model.  \n− Introduce NodeRed IDE  \n− Build a web/mobile application to control electronic devices via local wireless network.  \n− Advanced thematic: Artificial Intelligence (AI) in IoT  \n− Review  \n Tài nguyên học phần  \nGiáo trình  \n− Slides of lecture  \nTài liệu tham khảo  \n− Raspberry Pi beginner’s guide. Website: https://www.raspberrypi.org/magpi -\nissues/MagPi49.pdf  \n− Raspberry Pi Projects Book. Website: https://www.raspberrypi.org/magpi -\nissues/Projects_Book_v1.pdf  \nCông cụ hỗ trợ  "
}