{
    "course_id": "PHY00005",
    "course_name": "Vật lý đại cương 1",
    "course_start_page": 66,
    "course_end_page": 68,
    "content": " \n 66  \nĐẠI HỌC QUỐC GIA TP. HỒ CHÍ MINH  \nTRƯỜNG ĐẠI HỌC KHOA HỌC TỰ NHIÊN  CỘNG HOÀ XÃ HỘI CHỦ NGHĨA VIỆT NAM  \nĐộc lập – Tự do – Hạnh phúc  \n_____o  0 o_____  \n \nĐỀ CƯƠNG TÓM TẮT \nPHY00005  – Vật lý đ ại cương 1   \n \n Thông tin chung  \n− Mã học phần  : PHY00005  \n− Khối kiến thức: Tự chọn  – Đại cương  \n− Số tín chỉ: 4  \n• Lý thuyết  : 45 \n• Thực hành  : 30 \n• Bài tập  : 0 \n− Học phần học trước  :  Toán ph_ thông  \n Mô tả học phần  \nMôn học này nhằm cung cấp cho sinh viên kiến thức cơ bản về các dạng chuyển động, các qui \nluật chuyển động của chất điểm và của các vật thể khác. Trang bị cho sinh viên kiến thức về \nnhiệt động lực học. Hiểu và vận dụng các định luật bảo toàn trong cơ học. Hiểu và vận dụng \ncác phương tr ình trạng thái khí lý tưởng, nguyên lý thứ nhất, nguyên lý thứ hai của nhiệt động \nlực học. Môn học cũng giúp xây dựng kiến thức nền tảng cho chuyên ngành Vật lý, Hải dương, \nKỹ thuật hạt nhân và các ngành khoa học khác nhằm tạo sự sẵn sàng cho các môn học c huyên \nsâu hơn ở các năm sau. Môn học cũng giúp sinh viên có những kỹ năng cơ bản về giải quyết \ncác vấn đề trong khoa học và cuộc sống.  \n Mục tiêu của học phần  \nSau khoá học, sinh viên có khả năng:  \n− Làm việc ở mức độ cá nhân và cộng tác nhóm để trình bày một số  báo cáo kỹ thuật theo \nmẫu cho trước trong các bài toán cơ và nhiệt  \n− Biết được các thuật ngữ tiếng Anh liên quan đến môn học  \n− Giải thích được các khái niệm cơ bản về qui luật vận động của vật thể trong tự nhiên  \n− Vận dụng được các định luật, các nguyên lý để g iải quyết các bài toán liên quan cơ và \nnhiệt  \n− Nắm được các nguyên tắc đạo đức, trách nhiệm trong học tập  \n Nội dung học phần    \n 67 − Vật lý và các phép đo  \n• Các tiêu chuẩn về chiều dài, khối lượng và thời gian  \n• Phân tích thứ nguyên của đại lượng vật lý  \n• Biến đổi đơn vị  \n• Tính toán độ lớn  \n• Chữ số có nghĩa  \n− Động học chất điểm  \n• Vectơ vị trí của chất điểm  \n• Vectơ vận tốc của chất điểm  \n• Vectơ gia tốc của chất điểm  \n• Các loại chuyển động đặc biệt  \n− Động lực học chất điểm  \n• Khái niệm về lực  \n• Định luật thứ nhất của Newton và hệ qui chiếu quán tính  \n• Khối lượng  \n• Định luật thứ hai của Newton  \n• Lực hấp dẫn và trọng lực  \n• Định luật thứ ba của Newton  \n• Các ứng dụng định luật thứ hai của Newton  \n• Lực ma sát  \n− Các định luật bảo toàn trong cơ học  \n• Động lượng của chất điểm  \n• Định luật bảo toàn động lượng  \n• Định luật bảo toàn mômen động lượng của hệ chất điểm  \n• Định luật bả o toàn và chuyển hóa cơ năng  \n− Cơ học vật rắn  \n• Các khái niệm cơ bản  \n• Khối tâm của vật rắn  \n• Hệ qui chiếu khối tâm, hệ qui chiếu phòng thí nghiệm  \n• Phương trình cơ bản của vật rắn quay quanh trục cố định  \n• Momen quán tính của vật rắn  \n• Cơ năng của vật rắn  \n• Định luật bảo toàn mômen  động lượng của vật rắn  \n− Khí lý tưởng  \n• Các khái niệm  \n• Phương trình cơ bản khí lí tưởng  \n• Phươn g trình cơ bản của thuyết động học phân tử các chất khí  \n− Nguyên lý thứ nhất của nhiệt động lực họ c \n• Nội năng, công và nhiệt lượng  \n• Nguyên lí thứ nhất nhiệt động lực học  \n• Ứng dụng  nguyên lí thứ nhất trong một số quá trình cân bằng  \n− Nguyên lý thứ hai của nhiệt động lực học  \n• Nguyên lí thứ hai nhiệt động lực học  \n• Chu trình Cacnô thuận nghịch đối với khí lí tưởng  \n• Hàm Entr ôpi và nguyên lí tăng Entrôpi  \n− Ôn tập  \n Tài nguyên học phần   \n 68 Giáo trình  \n− Vật lý đại cương 1 (Cơ và Nhiệt),   Nguyễn Thành Vấn, NXB ĐHQG -HCM, 2013.  \nTài liệu tham khảo  \n− Các bài giảng cơ và nhiệt, Nguyễn Nhật Khanh, NXB ĐHQG -HCM, 2005.  \n− Physics for Sc ientists and Engineers with Modern Physics, Raymond A. Serway, John \nW. Jewett, Sr, 2014.  \n− Physics, Alan Giambattista, Betty McCarthy Richardson, Robert C. Richardson, 2010.  \nCông cụ hỗ trợ  "
}